STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/**
  * @brief FLASH Registers
  */
typedef struct
{
  __IO uint32_t ACR;              /*!< FLASH access control register,                      Address offset: 0x00 */
       uint32_t RESERVED0;        /*!< RESERVED1,                                          Address offset: 0x04 */
  __IO uint32_t NSKEYR;           /*!< FLASH non-secure key register,                      Address offset: 0x08 */
#if $WBA_SECURITY$
  __IO uint32_t SECKEYR;          /*!< FLASH secure key register,                          Address offset: 0x0C */
#else
       uint32_t RESERVED1;        /*!< Reserved1,                                          Address offset: 0x0C */
#endif
  __IO uint32_t OPTKEYR;          /*!< FLASH option key register,                          Address offset: 0x10 */
#if $WBA_SECURITY$
       uint32_t RESERVED1;        /*!< Reserved1,                                          Address offset: 0x14 */
#else
       uint32_t RESERVED2;        /*!< Reserved2,                                          Address offset: 0x14 */
#endif
#if $WBA_DUAL_BANK$
  __IO uint32_t PDKEY1R;          /*!< FLASH Bank 1 power-down key register,               Address offset: 0x18 */
  __IO uint32_t PDKEY2R;          /*!< FLASH Bank 2 power-down key register,               Address offset: 0x1C */
#else
  __IO uint32_t PDKEYR;           /*!< FLASH Bank power-down key register,                 Address offset: 0x18 */
#if $WBA_SECURITY$
       uint32_t RESERVED2;        /*!< Reserved2,                                          Address offset: 0x1C */
#else
       uint32_t RESERVED3;        /*!< Reserved3,                                          Address offset: 0x1C */
#endif
#endif
  __IO uint32_t NSSR;             /*!< FLASH non-secure status register,                   Address offset: 0x20 */
#if $WBA_SECURITY$
  __IO uint32_t SECSR;            /*!< FLASH secure status register,                       Address offset: 0x24 */
#else
       uint32_t RESERVED4;        /*!< Reserved4,                                          Address offset: 0x24 */
#endif
  __IO uint32_t NSCR1;            /*!< FLASH non-secure control register,                  Address offset: 0x28 */
#if $WBA_SECURITY$
  __IO uint32_t SECCR1;           /*!< FLASH secure control register,                      Address offset: 0x2C */
#else
       uint32_t RESERVED5;        /*!< Reserved5,                                          Address offset: 0x2C */
#endif
  __IO uint32_t ECCR;             /*!< FLASH ECC register,                                 Address offset: 0x30 */
  __IO uint32_t OPSR;             /*!< FLASH OPSR register,                                Address offset: 0x34 */
  __IO uint32_t NSCR2;            /*!< FLASH non-secure control register,                  Address offset: 0x38 */
#if $WBA_SECURITY$
  __IO uint32_t SECCR2;           /*!< FLASH secure control register,                      Address offset: 0x3C */
#else
       uint32_t RESERVED6;        /*!< Reserved6,                                          Address offset: 0x3C */
#endif
  __IO uint32_t OPTR;             /*!< FLASH option control register,                      Address offset: 0x40 */
  __IO uint32_t NSBOOTADD0R;      /*!< FLASH non-secure boot address 0 register,           Address offset: 0x44 */
  __IO uint32_t NSBOOTADD1R;      /*!< FLASH non-secure boot address 1 register,           Address offset: 0x48 */
#if $WBA_SECURITY$
  __IO uint32_t SECBOOTADD0R;     /*!< FLASH secure boot address 0 register,               Address offset: 0x4C */
#if $WBA_DUAL_BANK$
  __IO uint32_t SECWM1R1;         /*!< FLASH bank 1 secure watermark1 register 1,          Address offset: 0x50 */
  __IO uint32_t SECWM1R2;         /*!< FLASH bank 1 secure watermark1 register 2,          Address offset: 0x54 */
#else
  __IO uint32_t SECWMR1;          /*!< FLASH secure watermark1 register 1,                 Address offset: 0x50 */
  __IO uint32_t SECWMR2;          /*!< FLASH secure watermark1 register 2,                 Address offset: 0x54 */
#endif
#else
       uint32_t RESERVED7[3];     /*!< Reserved7,                                          Address offset: 0x4C-0x54 */
#endif
#if $WBA_DUAL_BANK$
  __IO uint32_t WRP1AR;           /*!< FLASH WRP bank 1 area A address register,           Address offset: 0x58 */
  __IO uint32_t WRP1BR;           /*!< FLASH WRP bank 1 area B address register,           Address offset: 0x5C */
#else
  __IO uint32_t WRPAR;            /*!< FLASH WRP area A address register,                  Address offset: 0x58 */
  __IO uint32_t WRPBR;            /*!< FLASH WRP area B address register,                  Address offset: 0x5C */
#endif
#if $WBA_SECURITY$
#if $WBA_DUAL_BANK$
  __IO uint32_t SECWM2R1;         /*!< FLASH bank 2 secure watermark2 register 1,          Address offset: 0x60 */
  __IO uint32_t SECWM2R2;         /*!< FLASH bank 2 secure watermark2 register 2,          Address offset: 0x64 */
  __IO uint32_t WRP2AR;           /*!< FLASH WRP bank 2 area A address register,           Address offset: 0x68 */
  __IO uint32_t WRP2BR;           /*!< FLASH WRP bank 2 area B address register,           Address offset: 0x6C */
#else
       uint32_t RESERVED3[4];     /*!< Reserved3,                                          Address offset: 0x60-0x6C */
#endif
#else
       uint32_t RESERVED8[4];     /*!< Reserved8,                                          Address offset: 0x60-0x6C */
#endif
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
  __IO uint32_t OEM1KEYR1;        /*!< FLASH OEM1 key register 1,                          Address offset: 0x70 */
  __IO uint32_t OEM1KEYR2;        /*!< FLASH OEM1 key register 2,                          Address offset: 0x74 */
  __IO uint32_t OEM2KEYR1;        /*!< FLASH OEM2 key register 1,                          Address offset: 0x78 */
  __IO uint32_t OEM2KEYR2;        /*!< FLASH OEM2 key register 2,                          Address offset: 0x7C */
#else /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#if $WBA_SECURITY$
       uint32_t RESERVED5[4];     /*!< Reserved5,                                          Address offset: 0x70-0x7C */
#else
       uint32_t RESERVED9[4];     /*!< Reserved9,                                          Address offset: 0x70-0x7C */
#endif
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#if $WBA_SECURITY$
#if $WBA_DUAL_BANK$
  __IO uint32_t SECBB1R1;         /*!< FLASH bank 1 secure block-based bank register 1,    Address offset: 0x80 */
  __IO uint32_t SECBB1R2;         /*!< FLASH bank 1 secure block-based bank register 2,    Address offset: 0x84 */
  __IO uint32_t SECBB1R3;         /*!< FLASH bank 1 secure block-based bank register 3,    Address offset: 0x88 */
  __IO uint32_t SECBB1R4;         /*!< FLASH bank 1 secure block-based bank register 4,    Address offset: 0x8C */
       uint32_t RESERVED2[4];     /*!< Reserved2,                                          Address offset: 0x90-0x9C */
  __IO uint32_t SECBB2R1;         /*!< FLASH bank 2 secure block-based bank register 1,    Address offset: 0xA0 */
  __IO uint32_t SECBB2R2;         /*!< FLASH bank 2 secure block-based bank register 2,    Address offset: 0xA4 */
  __IO uint32_t SECBB2R3;         /*!< FLASH bank 2 secure block-based bank register 3,    Address offset: 0xA8 */
  __IO uint32_t SECBB2R4;         /*!< FLASH bank 2 secure block-based bank register 4,    Address offset: 0xAC */
       uint32_t RESERVED3[4];     /*!< Reserved3,                                          Address offset: 0xB0-0xBC */
#else
  __IO uint32_t SECBBR1;          /*!< FLASH secure block-based bank register 1,           Address offset: 0x80 */
  __IO uint32_t SECBBR2;          /*!< FLASH secure block-based bank register 2,           Address offset: 0x84 */
  __IO uint32_t SECBBR3;          /*!< FLASH secure block-based bank register 3,           Address offset: 0x88 */
  __IO uint32_t SECBBR4;          /*!< FLASH secure block-based bank register 4,           Address offset: 0x8C */
       uint32_t RESERVED4[12];    /*!< Reserved4,                                          Address offset: 0x90-0xBC */
#endif
  __IO uint32_t SECHDPCR;         /*!< FLASH secure HDP control register,                  Address offset: 0xC0 */
  __IO uint32_t PRIVCFGR;         /*!< FLASH privilege configuration register,             Address offset: 0xC4 */
#if $WBA_DUAL_BANK$
       uint32_t RESERVED4[2];     /*!< Reserved4,                                          Address offset: 0xC8-0xCC */
  __IO uint32_t PRIVBB1R1;        /*!< FLASH bank 1 privilege block-based bank register 1, Address offset: 0xD0 */
  __IO uint32_t PRIVBB1R2;        /*!< FLASH bank 1 privilege block-based bank register 2, Address offset: 0xD4 */
  __IO uint32_t PRIVBB1R3;        /*!< FLASH bank 1 privilege block-based bank register 3, Address offset: 0xD8 */
  __IO uint32_t PRIVBB1R4;        /*!< FLASH bank 1 privilege block-based bank register 4, Address offset: 0xDC */
       uint32_t RESERVED5[4];     /*!< Reserved5,                                          Address offset: 0xE0-0xEC */
  __IO uint32_t PRIVBB2R1;        /*!< FLASH bank 2 privilege block-based bank register 1, Address offset: 0xF0 */
  __IO uint32_t PRIVBB2R2;        /*!< FLASH bank 2 privilege block-based bank register 2, Address offset: 0xF4 */
  __IO uint32_t PRIVBB2R3;        /*!< FLASH bank 2 privilege block-based bank register 3, Address offset: 0xF8 */
  __IO uint32_t PRIVBB2R4;        /*!< FLASH bank 2 privilege block-based bank register 4, Address offset: 0xFC */
#else
#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
  __IO uint32_t SECHDPEXTR;       /*!< FLASH secure HDP extension register,                Address offset: 0xC8 */
       uint32_t RESERVED6;        /*!< Reserved6,                                          Address offset: 0xCC */
#else /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
       uint32_t RESERVED5[2];     /*!< Reserved5,                                          Address offset: 0xC8-0xCC */
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
  __IO uint32_t PRIVBBR1;         /*!< FLASH privilege block-based bank register 1,        Address offset: 0xD0 */
  __IO uint32_t PRIVBBR2;         /*!< FLASH privilege block-based bank register 2,        Address offset: 0xD4 */
  __IO uint32_t PRIVBBR3;         /*!< FLASH privilege block-based bank register 3,        Address offset: 0xD8 */
  __IO uint32_t PRIVBBR4;         /*!< FLASH privilege block-based bank register 4,        Address offset: 0xDC */
#endif
#endif
#if defined (STM32WBA20xx)
       uint32_t RESERVED10[36];   /*!< Reserved10,                                         Address offset: 0x80 - 0x10C */
#endif
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
       uint32_t RESERVED7[12];    /*!< Reserved7,                                          Address offset: 0xE0 - 0x10C */
#endif
#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
  __IO uint32_t OEM1KEYR1;        /*!< FLASH OEM1 key register 1,                          Address offset: 0x110 */
  __IO uint32_t OEM1KEYR2;        /*!< FLASH OEM1 key register 2,                          Address offset: 0x114 */
  __IO uint32_t OEM1KEYR3;        /*!< FLASH OEM1 key register 3,                          Address offset: 0x118 */
  __IO uint32_t OEM1KEYR4;        /*!< FLASH OEM1 key register 4,                          Address offset: 0x11C */
  __IO uint32_t OEM2KEYR1;        /*!< FLASH OEM2 key register 1,                          Address offset: 0x120 */
  __IO uint32_t OEM2KEYR2;        /*!< FLASH OEM2 key register 2,                          Address offset: 0x124 */
  __IO uint32_t OEM2KEYR3;        /*!< FLASH OEM2 key register 3,                          Address offset: 0x128 */
  __IO uint32_t OEM2KEYR4;        /*!< FLASH OEM2 key register 4,                          Address offset: 0x12C */
  __IO uint32_t OEMKEYSR;         /*!< FLASH OEM key status register,                      Address offset: 0x130 */
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
} FLASH_TypeDef;

/**
  * @brief General Purpose I/O
  */
typedef struct
{
  __IO uint32_t MODER;       /*!< GPIO port mode register,               Address offset: 0x00      */
  __IO uint32_t OTYPER;      /*!< GPIO port output type register,        Address offset: 0x04      */
  __IO uint32_t OSPEEDR;     /*!< GPIO port output speed register,       Address offset: 0x08      */
  __IO uint32_t PUPDR;       /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
  __IO uint32_t IDR;         /*!< GPIO port input data register,         Address offset: 0x10      */
  __IO uint32_t ODR;         /*!< GPIO port output data register,        Address offset: 0x14      */
  __IO uint32_t BSRR;        /*!< GPIO port bit set/reset  register,     Address offset: 0x18      */
  __IO uint32_t LCKR;        /*!< GPIO port configuration lock register, Address offset: 0x1C      */
  __IO uint32_t AFR[2];      /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
  __IO uint32_t BRR;         /*!< GPIO Bit Reset register,               Address offset: 0x28      */
#if defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
  __IO uint32_t HSLVR;       /*!< GPIO high-speed low voltage register,  Address offset: 0x2C      */
#else
       uint32_t RESERVED1;   /*!< RESERVED1,                             Address offset: 0x2C      */
#endif  /* defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx) */
#if $WBA_SECURITY$
  __IO uint32_t SECCFGR;     /*!< GPIO secure configuration register,    Address offset: 0x30      */
#endif
} GPIO_TypeDef;

