STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/*!< APB2 Non secure peripherals */
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define TIM1_BASE_NS                    (APB2PERIPH_BASE_NS + 0x2C00UL)
#endif
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define SPI1_BASE_NS                    (APB2PERIPH_BASE_NS + 0x3000UL)
#endif
#define USART1_BASE_NS                  (APB2PERIPH_BASE_NS + 0x3800UL)
#define TIM16_BASE_NS                   (APB2PERIPH_BASE_NS + 0x4400UL)
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define TIM17_BASE_NS                   (APB2PERIPH_BASE_NS + 0x4800UL)
#endif
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define SAI1_BASE_NS                    (APB2PERIPH_BASE_NS + 0x5400UL)
#define SAI1_Block_A_BASE_NS            (SAI1_BASE_NS + 0x004UL)
#define SAI1_Block_B_BASE_NS            (SAI1_BASE_NS + 0x024UL)
#endif
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define USB_DRD_BASE_NS                 (APB2PERIPH_BASE_NS + 0x6000UL)
#define USB_DRD_SRAM_BASE_NS            (APB2PERIPH_BASE_NS + 0x6400UL)
#endif

/*!< AHB1 Non secure peripherals */
#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define LPDMA1_BASE_NS                  AHB1PERIPH_BASE_NS
#else
#define GPDMA1_BASE_NS                  AHB1PERIPH_BASE_NS
#endif
#define FLASH_R_BASE_NS                 (AHB1PERIPH_BASE_NS + 0x02000UL)
#define CRC_BASE_NS                     (AHB1PERIPH_BASE_NS + 0x03000UL)
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define TSC_BASE_NS                     (AHB1PERIPH_BASE_NS + 0x04000UL)
#endif
#define RAMCFG_BASE_NS                  (AHB1PERIPH_BASE_NS + 0x06000UL)
#define ICACHE_BASE_NS                  (AHB1PERIPH_BASE_NS + 0x10400UL)
#if $WBA_SECURITY$
#define GTZC_TZSC_BASE_NS               (AHB1PERIPH_BASE_NS + 0x12400UL)
#define GTZC_MPCBB1_BASE_NS             (AHB1PERIPH_BASE_NS + 0x12C00UL)
#define GTZC_MPCBB2_BASE_NS             (AHB1PERIPH_BASE_NS + 0x13000UL)
#if !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_MPCBB6_BASE_NS             (AHB1PERIPH_BASE_NS + 0x14000UL)
#endif
#endif

#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define LPDMA1_Channel0_BASE_NS         (LPDMA1_BASE_NS + 0x0050UL)
#define LPDMA1_Channel1_BASE_NS         (LPDMA1_BASE_NS + 0x00D0UL)
#define LPDMA1_Channel2_BASE_NS         (LPDMA1_BASE_NS + 0x0150UL)
#define LPDMA1_Channel3_BASE_NS         (LPDMA1_BASE_NS + 0x01D0UL)
#define LPDMA1_Channel4_BASE_NS         (LPDMA1_BASE_NS + 0x0250UL)
#define LPDMA1_Channel5_BASE_NS         (LPDMA1_BASE_NS + 0x02D0UL)
#define LPDMA1_Channel6_BASE_NS         (LPDMA1_BASE_NS + 0x0350UL)
#define LPDMA1_Channel7_BASE_NS         (LPDMA1_BASE_NS + 0x03D0UL)
#else
#define GPDMA1_Channel0_BASE_NS         (GPDMA1_BASE_NS + 0x0050UL)
#define GPDMA1_Channel1_BASE_NS         (GPDMA1_BASE_NS + 0x00D0UL)
#define GPDMA1_Channel2_BASE_NS         (GPDMA1_BASE_NS + 0x0150UL)
#define GPDMA1_Channel3_BASE_NS         (GPDMA1_BASE_NS + 0x01D0UL)
#define GPDMA1_Channel4_BASE_NS         (GPDMA1_BASE_NS + 0x0250UL)
#define GPDMA1_Channel5_BASE_NS         (GPDMA1_BASE_NS + 0x02D0UL)
#define GPDMA1_Channel6_BASE_NS         (GPDMA1_BASE_NS + 0x0350UL)
#define GPDMA1_Channel7_BASE_NS         (GPDMA1_BASE_NS + 0x03D0UL)
#endif

#define RAMCFG_SRAM1_BASE_NS            (RAMCFG_BASE_NS)
#define RAMCFG_SRAM2_BASE_NS            (RAMCFG_BASE_NS + 0x0040UL)
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define RAMCFG_SRAM6_BASE_NS            (RAMCFG_BASE_NS + 0x0140UL)
#endif

/*!< AHB2 Non secure peripherals */
#define GPIOA_BASE_NS                   AHB2PERIPH_BASE_NS
#define GPIOB_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00400UL)
#define GPIOC_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00800UL)
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GPIOD_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00C00UL)
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GPIOE_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x01000UL)
#define GPIOG_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x01800UL)
#endif
#define GPIOH_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x01C00UL)
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define USB_OTG_HS_BASE_NS              (AHB2PERIPH_BASE_NS + 0x20000UL)
#endif
#if $WBA_CRYPTO$
#define AES_BASE_NS                     (AHB2PERIPH_BASE_NS + 0xA0000UL)
#endif /* WBA_CRYPTO */
#define HASH_BASE_NS                    (AHB2PERIPH_BASE_NS + 0xA0400UL)
#define HASH_DIGEST_BASE_NS             (AHB2PERIPH_BASE_NS + 0xA0710UL)
#define RNG_BASE_NS                     (AHB2PERIPH_BASE_NS + 0xA0800UL)
#if $WBA_CRYPTO$
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define SAES_BASE_NS                    (AHB2PERIPH_BASE_NS + 0xA0C00UL)
#endif
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define HSEM_BASE_NS                    (AHB2PERIPH_BASE_NS + 0xA1C00UL)
#endif
#define PKA_BASE_NS                     (AHB2PERIPH_BASE_NS + 0xA2000UL)
#define PKA_RAM_BASE_NS                 (AHB2PERIPH_BASE_NS + 0xA2400UL)
#endif /* WBA_CRYPTO */
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define OTFDEC1_BASE_NS                 (AHB2PERIPH_BASE_NS + 0xA5000UL)
#define OTFDEC1_REGION1_BASE_NS         (OTFDEC1_BASE_NS + 0x20UL)
#define OTFDEC1_REGION2_BASE_NS         (OTFDEC1_BASE_NS + 0x50UL)
#define OTFDEC1_REGION3_BASE_NS         (OTFDEC1_BASE_NS + 0x80UL)
#define OTFDEC1_REGION4_BASE_NS         (OTFDEC1_BASE_NS + 0xB0UL)
#define DLYB1_BASE_NS                   (AHB2PERIPH_BASE_NS + 0xAF000UL)
#define XSPI1_BASE_NS                   (AHB2PERIPH_BASE_NS + 0xB1400UL)
#endif

