STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/*!< APB7 Non secure peripherals */
#define SYSCFG_BASE_NS                  (APB7PERIPH_BASE_NS + 0x0400UL)
#define SPI3_BASE_NS                    (APB7PERIPH_BASE_NS + 0x2000UL)
#define LPUART1_BASE_NS                 (APB7PERIPH_BASE_NS + 0x2400UL)
#define I2C3_BASE_NS                    (APB7PERIPH_BASE_NS + 0x2800UL)
#define LPTIM1_BASE_NS                  (APB7PERIPH_BASE_NS + 0x4400UL)
#if defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define COMP12_BASE_NS                  (APB7PERIPH_BASE_NS + 0x5400UL)
#define COMP1_BASE_NS                   (COMP12_BASE_NS)
#define COMP2_BASE_NS                   (COMP12_BASE_NS + 0x04UL)
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define VREFBUF_BASE_NS                 (APB7PERIPH_BASE_NS + 0x7400UL)
#endif
#define RTC_BASE_NS                     (APB7PERIPH_BASE_NS + 0x7800UL)
#define TAMP_BASE_NS                    (APB7PERIPH_BASE_NS + 0x7C00UL)

/*!< AHB4 Non secure peripherals */
#define PWR_BASE_NS                     (AHB4PERIPH_BASE_NS + 0x0800UL)
#define RCC_BASE_NS                     (AHB4PERIPH_BASE_NS + 0x0C00UL)
#define ADC4_BASE_NS                    (AHB4PERIPH_BASE_NS + 0x1000UL)
#define ADC4_COMMON_BASE_NS             (AHB4PERIPH_BASE_NS + 0x1308UL)
#define EXTI_BASE_NS                    (AHB4PERIPH_BASE_NS + 0x2000UL)

/*!< AHB5 Non secure peripherals */
#define RADIO_BASE_NS                   AHB5PERIPH_BASE_NS
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define PTACONV_BASE_NS                 (AHB5PERIPH_BASE_NS + 0x18000UL)
#endif


#if $WBA_SECURITY$
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/* Flash, Peripheral and internal SRAMs base addresses - Secure */
#define FLASH_BASE_S                    0x0C000000UL  /*!< FLASH secure base address                          */
#define SYSTEM_FLASH_BASE_S             0x0FF80000UL  /*!< System FLASH non-secure base address               */
#define SRAM1_BASE_S                    0x30000000UL  /*!< SRAM1 secure base address                          */
#if defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define SRAM2_BASE_S                    0x30070000UL  /*!< SRAM2 secure base address                          */
#else
#define SRAM2_BASE_S                    0x30010000UL  /*!< SRAM2 secure base address                          */
#endif
#define SRAM6_BASE_S                    0x58028000UL  /*!< 2.4 GHz RADIO TXRX SRAM secure base address        */
#define SEQSRAM_BASE_S                  0x58021000UL  /*!< SRAM Sequence / retention non-secure base address  */
#define PERIPH_BASE_S                   0x50000000UL  /*!< Peripheral secure base address                     */

/* Peripheral memory map - Secure */
#define APB1PERIPH_BASE_S               PERIPH_BASE_S
#define APB2PERIPH_BASE_S               (PERIPH_BASE_S + 0x00010000UL)
#define AHB1PERIPH_BASE_S               (PERIPH_BASE_S + 0x00020000UL)
#define AHB2PERIPH_BASE_S               (PERIPH_BASE_S + 0x02020000UL)
#define APB7PERIPH_BASE_S               (PERIPH_BASE_S + 0x06000000UL)
#define AHB4PERIPH_BASE_S               (PERIPH_BASE_S + 0x06020000UL)
#define AHB5PERIPH_BASE_S               (PERIPH_BASE_S + 0x08020000UL)

/*!< APB1 Secure peripherals */
#define TIM2_BASE_S                      APB1PERIPH_BASE_S
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define TIM3_BASE_S                     (APB1PERIPH_BASE_S + 0x0400UL)
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define TIM4_BASE_S                     (APB1PERIPH_BASE_S + 0x0800UL)
#endif
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define WWDG_BASE_S                     (APB1PERIPH_BASE_S + 0x2C00UL)
#endif
#define IWDG_BASE_S                     (APB1PERIPH_BASE_S + 0x3000UL)
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define SPI2_BASE_S                     (APB1PERIPH_BASE_S + 0x3800UL)
#endif
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define USART2_BASE_S                   (APB1PERIPH_BASE_S + 0x4400UL)
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define USART3_BASE_S                   (APB1PERIPH_BASE_S + 0x4800UL)
#endif
#define I2C1_BASE_S                     (APB1PERIPH_BASE_S + 0x5400UL)
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define I2C2_BASE_S                     (APB1PERIPH_BASE_S + 0x5800UL)
#define I2C4_BASE_S                     (APB1PERIPH_BASE_S + 0x8400UL)
#endif
#define LPTIM2_BASE_S                   (APB1PERIPH_BASE_S + 0x9400UL)
#endif
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define I2C1_BASE_S                     (APB1PERIPH_BASE_S + 0x5400UL)
#define LPTIM2_BASE_S                   (APB1PERIPH_BASE_S + 0x9400UL)
#endif

/*!< APB2 Secure peripherals */
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define TIM1_BASE_S                     (APB2PERIPH_BASE_S + 0x2C00UL)
#endif
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define SPI1_BASE_S                     (APB2PERIPH_BASE_S + 0x3000UL)
#endif
#define USART1_BASE_S                   (APB2PERIPH_BASE_S + 0x3800UL)
#define TIM16_BASE_S                    (APB2PERIPH_BASE_S + 0x4400UL)
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define TIM17_BASE_S                    (APB2PERIPH_BASE_S + 0x4800UL)
#endif
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define SAI1_BASE_S                     (APB2PERIPH_BASE_S + 0x5400UL)
#define SAI1_Block_A_BASE_S             (SAI1_BASE_S + 0x004UL)
#define SAI1_Block_B_BASE_S             (SAI1_BASE_S + 0x024UL)
#endif
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define USB_DRD_BASE_S                  (APB2PERIPH_BASE_S + 0x6000UL)
#define USB_DRD_SRAM_BASE_S             (APB2PERIPH_BASE_S + 0x6400UL)
#endif

/*!< AHB1 Secure peripherals */
#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define LPDMA1_BASE_S                   AHB1PERIPH_BASE_S
#else
#define GPDMA1_BASE_S                   AHB1PERIPH_BASE_S
#endif
#define FLASH_R_BASE_S                  (AHB1PERIPH_BASE_S + 0x02000UL)
#define CRC_BASE_S                      (AHB1PERIPH_BASE_S + 0x03000UL)
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define TSC_BASE_S                      (AHB1PERIPH_BASE_S + 0x04000UL)
#endif
#define RAMCFG_BASE_S                   (AHB1PERIPH_BASE_S + 0x06000UL)
#define ICACHE_BASE_S                   (AHB1PERIPH_BASE_S + 0x10400UL)
#define GTZC_TZSC_BASE_S                (AHB1PERIPH_BASE_S + 0x12400UL)
#define GTZC_TZIC_BASE_S                (AHB1PERIPH_BASE_S + 0x12800UL)
#define GTZC_MPCBB1_BASE_S              (AHB1PERIPH_BASE_S + 0x12C00UL)
#define GTZC_MPCBB2_BASE_S              (AHB1PERIPH_BASE_S + 0x13000UL)
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_MPCBB6_BASE_S              (AHB1PERIPH_BASE_S + 0x14000UL)
#endif

#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define LPDMA1_Channel0_BASE_S          (LPDMA1_BASE_S + 0x0050UL)
#define LPDMA1_Channel1_BASE_S          (LPDMA1_BASE_S + 0x00D0UL)
#define LPDMA1_Channel2_BASE_S          (LPDMA1_BASE_S + 0x0150UL)
#define LPDMA1_Channel3_BASE_S          (LPDMA1_BASE_S + 0x01D0UL)
#define LPDMA1_Channel4_BASE_S          (LPDMA1_BASE_S + 0x0250UL)
#define LPDMA1_Channel5_BASE_S          (LPDMA1_BASE_S + 0x02D0UL)
#define LPDMA1_Channel6_BASE_S          (LPDMA1_BASE_S + 0x0350UL)
#define LPDMA1_Channel7_BASE_S          (LPDMA1_BASE_S + 0x03D0UL)
#else
#define GPDMA1_Channel0_BASE_S          (GPDMA1_BASE_S + 0x0050UL)
#define GPDMA1_Channel1_BASE_S          (GPDMA1_BASE_S + 0x00D0UL)
#define GPDMA1_Channel2_BASE_S          (GPDMA1_BASE_S + 0x0150UL)
#define GPDMA1_Channel3_BASE_S          (GPDMA1_BASE_S + 0x01D0UL)
#define GPDMA1_Channel4_BASE_S          (GPDMA1_BASE_S + 0x0250UL)
#define GPDMA1_Channel5_BASE_S          (GPDMA1_BASE_S + 0x02D0UL)
#define GPDMA1_Channel6_BASE_S          (GPDMA1_BASE_S + 0x0350UL)
#define GPDMA1_Channel7_BASE_S          (GPDMA1_BASE_S + 0x03D0UL)
#endif

#define RAMCFG_SRAM1_BASE_S             (RAMCFG_BASE_S)
#define RAMCFG_SRAM2_BASE_S             (RAMCFG_BASE_S + 0x0040UL)
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define RAMCFG_SRAM6_BASE_S             (RAMCFG_BASE_S + 0x0140UL)
#endif

/*!< AHB2 Secure peripherals */
#define GPIOA_BASE_S                    AHB2PERIPH_BASE_S
#define GPIOB_BASE_S                    (AHB2PERIPH_BASE_S + 0x00400UL)
#define GPIOC_BASE_S                    (AHB2PERIPH_BASE_S + 0x00800UL)
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GPIOD_BASE_S                    (AHB2PERIPH_BASE_S + 0x00C00UL)
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GPIOE_BASE_S                    (AHB2PERIPH_BASE_S + 0x01000UL)
#define GPIOG_BASE_S                    (AHB2PERIPH_BASE_S + 0x01800UL)
#endif
#define GPIOH_BASE_S                    (AHB2PERIPH_BASE_S + 0x01C00UL)
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define USB_OTG_HS_BASE_S               (AHB2PERIPH_BASE_S + 0x20000UL)
#endif
#if $WBA_CRYPTO$
#define AES_BASE_S                      (AHB2PERIPH_BASE_S + 0xA0000UL)
#endif /* WBA_CRYPTO */
#define HASH_BASE_S                     (AHB2PERIPH_BASE_S + 0xA0400UL)
#define HASH_DIGEST_BASE_S              (AHB2PERIPH_BASE_S + 0xA0710UL)
#define RNG_BASE_S                      (AHB2PERIPH_BASE_S + 0xA0800UL)
#if $WBA_CRYPTO$
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define SAES_BASE_S                     (AHB2PERIPH_BASE_S + 0xA0C00UL)
#endif
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define HSEM_BASE_S                     (AHB2PERIPH_BASE_S + 0xA1C00UL)
#endif
#define PKA_BASE_S                      (AHB2PERIPH_BASE_S + 0xA2000UL)
#define PKA_RAM_BASE_S                  (AHB2PERIPH_BASE_S + 0xA2400UL)
#endif /* WBA_CRYPTO */
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define OTFDEC1_BASE_S                  (AHB2PERIPH_BASE_S + 0xA5000UL)
#define OTFDEC1_REGION1_BASE_S          (OTFDEC1_BASE_S + 0x20UL)
#define OTFDEC1_REGION2_BASE_S          (OTFDEC1_BASE_S + 0x50UL)
#define OTFDEC1_REGION3_BASE_S          (OTFDEC1_BASE_S + 0x80UL)
#define OTFDEC1_REGION4_BASE_S          (OTFDEC1_BASE_S + 0xB0UL)
#define DLYB1_BASE_S                    (AHB2PERIPH_BASE_S + 0xAF000UL)
#define XSPI1_BASE_S                    (AHB2PERIPH_BASE_S + 0xB1400UL)
#endif

