STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/*!< Instance aliases and base addresses for Secure peripherals */
#define ADC4                            ADC4_S
#define ADC4_BASE                       ADC4_BASE_S
#define ADC4_COMMON                     ADC4_COMMON_S
#define ADC4_COMMON_BASE                ADC4_COMMON_BASE_S
#if $WBA_CRYPTO$
#define AES                             AES_S
#define AES_BASE                        AES_BASE_S
#endif /* WBA_CRYPTO */
#if defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define COMP1                           COMP1_S
#define COMP1_BASE                      COMP1_BASE_S
#define COMP2                           COMP2_S
#define COMP2_BASE                      COMP2_BASE_S
#define COMP12_COMMON                   COMP12_COMMON_S
#endif
#define CRC                             CRC_S
#define CRC_BASE                        CRC_BASE_S
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define DLYB1                           DLYB1_S
#define DLYB1_BASE                      DLYB1_BASE_S
#define DLYB_XSPI1                      DLYB1
#endif
#define EXTI                            EXTI_S
#define EXTI_BASE                       EXTI_BASE_S
#define FLASH                           FLASH_S
#define FLASH_R_BASE                    FLASH_R_BASE_S
#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define LPDMA1                          LPDMA1_S
#define LPDMA1_BASE                     LPDMA1_BASE_S
#define LPDMA1_Channel0                 LPDMA1_Channel0_S
#define LPDMA1_Channel0_BASE            LPDMA1_Channel0_BASE_S
#define LPDMA1_Channel1                 LPDMA1_Channel1_S
#define LPDMA1_Channel1_BASE            LPDMA1_Channel1_BASE_S
#define LPDMA1_Channel2                 LPDMA1_Channel2_S
#define LPDMA1_Channel2_BASE            LPDMA1_Channel2_BASE_S
#define LPDMA1_Channel3                 LPDMA1_Channel3_S
#define LPDMA1_Channel3_BASE            LPDMA1_Channel3_BASE_S
#define LPDMA1_Channel4                 LPDMA1_Channel4_S
#define LPDMA1_Channel4_BASE            LPDMA1_Channel4_BASE_S
#define LPDMA1_Channel5                 LPDMA1_Channel5_S
#define LPDMA1_Channel5_BASE            LPDMA1_Channel5_BASE_S
#define LPDMA1_Channel6                 LPDMA1_Channel6_S
#define LPDMA1_Channel6_BASE            LPDMA1_Channel6_BASE_S
#define LPDMA1_Channel7                 LPDMA1_Channel7_S
#define LPDMA1_Channel7_BASE            LPDMA1_Channel7_BASE_S
#else
#define GPDMA1                          GPDMA1_S
#define GPDMA1_BASE                     GPDMA1_BASE_S
#define GPDMA1_Channel0                 GPDMA1_Channel0_S
#define GPDMA1_Channel0_BASE            GPDMA1_Channel0_BASE_S
#define GPDMA1_Channel1                 GPDMA1_Channel1_S
#define GPDMA1_Channel1_BASE            GPDMA1_Channel1_BASE_S
#define GPDMA1_Channel2                 GPDMA1_Channel2_S
#define GPDMA1_Channel2_BASE            GPDMA1_Channel2_BASE_S
#define GPDMA1_Channel3                 GPDMA1_Channel3_S
#define GPDMA1_Channel3_BASE            GPDMA1_Channel3_BASE_S
#define GPDMA1_Channel4                 GPDMA1_Channel4_S
#define GPDMA1_Channel4_BASE            GPDMA1_Channel4_BASE_S
#define GPDMA1_Channel5                 GPDMA1_Channel5_S
#define GPDMA1_Channel5_BASE            GPDMA1_Channel5_BASE_S
#define GPDMA1_Channel6                 GPDMA1_Channel6_S
#define GPDMA1_Channel6_BASE            GPDMA1_Channel6_BASE_S
#define GPDMA1_Channel7                 GPDMA1_Channel7_S
#define GPDMA1_Channel7_BASE            GPDMA1_Channel7_BASE_S
#endif
#define GPIOA                           GPIOA_S
#define GPIOA_BASE                      GPIOA_BASE_S
#define GPIOB                           GPIOB_S
#define GPIOB_BASE                      GPIOB_BASE_S
#define GPIOC                           GPIOC_S
#define GPIOC_BASE                      GPIOC_BASE_S
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GPIOD                           GPIOD_S
#define GPIOD_BASE                      GPIOD_BASE_S
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GPIOE                           GPIOE_S
#define GPIOE_BASE                      GPIOE_BASE_S
#define GPIOG                           GPIOG_S
#define GPIOG_BASE                      GPIOG_BASE_S
#endif
#define GPIOH                           GPIOH_S
#define GPIOH_BASE                      GPIOH_BASE_S
#define GTZC_MPCBB1                     GTZC_MPCBB1_S
#define GTZC_MPCBB1_BASE                GTZC_MPCBB1_BASE_S
#define GTZC_MPCBB2                     GTZC_MPCBB2_S
#define GTZC_MPCBB2_BASE                GTZC_MPCBB2_BASE_S
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_MPCBB6                     GTZC_MPCBB6_S
#define GTZC_MPCBB6_BASE                GTZC_MPCBB6_BASE_S
#endif
#define GTZC_TZIC                       GTZC_TZIC_S
#define GTZC_TZIC_BASE                  GTZC_TZIC_BASE_S
#define GTZC_TZSC                       GTZC_TZSC_S
#define GTZC_TZSC_BASE                  GTZC_TZSC_BASE_S
#define HASH                            HASH_S
#define HASH_BASE                       HASH_BASE_S
#define HASH_DIGEST                     HASH_DIGEST_S
#define HASH_DIGEST_BASE                HASH_DIGEST_BASE_S
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define HSEM                            HSEM_S
#define HSEM_BASE                       HSEM_BASE_S
#define HSEM_COMMON                     HSEM_COMMON_S
#endif
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define I2C1                            I2C1_S
#define I2C1_BASE                       I2C1_BASE_S
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define I2C2                            I2C2_S
#define I2C2_BASE                       I2C2_BASE_S
#endif
#define I2C3                            I2C3_S
#define I2C3_BASE                       I2C3_BASE_S
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define I2C4                            I2C4_S
#define I2C4_BASE                       I2C4_BASE_S
#endif
#define ICACHE                          ICACHE_S
#define ICACHE_BASE                     ICACHE_BASE_S
#define IWDG                            IWDG_S
#define IWDG_BASE                       IWDG_BASE_S
#define LPTIM1                          LPTIM1_S
#define LPTIM1_BASE                     LPTIM1_BASE_S
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define LPTIM2                          LPTIM2_S
#define LPTIM2_BASE                     LPTIM2_BASE_S
#endif
#define LPUART1                         LPUART1_S
#define LPUART1_BASE                    LPUART1_BASE_S
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define OTFDEC1                         OTFDEC1_S
#define OTFDEC1_REGION1                 OTFDEC1_REGION1_S
#define OTFDEC1_REGION2                 OTFDEC1_REGION2_S
#define OTFDEC1_REGION3                 OTFDEC1_REGION3_S
#define OTFDEC1_REGION4                 OTFDEC1_REGION4_S
#define OTFDEC1_BASE                    OTFDEC1_BASE_S
#define OTFDEC1_REGION1_BASE            OTFDEC1_REGION1_BASE_S
#define OTFDEC1_REGION2_BASE            OTFDEC1_REGION2_BASE_S
#define OTFDEC1_REGION3_BASE            OTFDEC1_REGION3_BASE_S
#define OTFDEC1_REGION4_BASE            OTFDEC1_REGION4_BASE_S
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define USB_OTG_HS                      USB_OTG_HS_S
#define USB_OTG_HS_BASE                 USB_OTG_HS_BASE_S
#endif
#if $WBA_CRYPTO$
#define PKA                             PKA_S
#define PKA_BASE                        PKA_BASE_S
#define PKA_RAM_BASE                    PKA_RAM_BASE_S
#endif /* WBA_CRYPTO */
#if defined (STM32WBA23xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define PTACONV_BASE                    PTACONV_BASE_S
#define PTACONV                         PTACONV_S
#endif
#define PWR                             PWR_S
#define PWR_BASE                        PWR_BASE_S
#define RADIO_BASE                      RADIO_BASE_S
#define RAMCFG_SRAM1                    RAMCFG_SRAM1_S
#define RAMCFG_SRAM1_BASE               RAMCFG_SRAM1_BASE_S
#define RAMCFG_SRAM2                    RAMCFG_SRAM2_S
#define RAMCFG_SRAM2_BASE               RAMCFG_SRAM2_BASE_S
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define RAMCFG_SRAM6                    RAMCFG_SRAM6_S
#define RAMCFG_SRAM6_BASE               RAMCFG_SRAM6_BASE_S
#endif
#define RCC                             RCC_S
#define RCC_BASE                        RCC_BASE_S
#define RNG                             RNG_S
#define RNG_BASE                        RNG_BASE_S
#define RTC                             RTC_S
#define RTC_BASE                        RTC_BASE_S
#if $WBA_CRYPTO$
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define SAES                            SAES_S
#define SAES_BASE                       SAES_BASE_S
#endif
#endif /* WBA_CRYPTO */
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define SAI1                            SAI1_S
#define SAI1_BASE                       SAI1_BASE_S
#define SAI1_Block_A                    SAI1_Block_A_S
#define SAI1_Block_A_BASE               SAI1_Block_A_BASE_S
#define SAI1_Block_B                    SAI1_Block_B_S
#define SAI1_Block_B_BASE               SAI1_Block_B_BASE_S
#endif
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define SPI1                            SPI1_S
#define SPI1_BASE                       SPI1_BASE_S
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define SPI2                            SPI2_S
#define SPI2_BASE                       SPI2_BASE_S
#endif
#define SPI3                            SPI3_S
#define SPI3_BASE                       SPI3_BASE_S
#define SYSCFG                          SYSCFG_S
#define SYSCFG_BASE                     SYSCFG_BASE_S
#define TAMP                            TAMP_S
#define TAMP_BASE                       TAMP_BASE_S
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define TIM1                            TIM1_S
#define TIM1_BASE                       TIM1_BASE_S
#endif
#define TIM2                            TIM2_S
#define TIM2_BASE                       TIM2_BASE_S
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define TIM3                            TIM3_S
#define TIM3_BASE                       TIM3_BASE_S
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define TIM4                            TIM4_S
#define TIM4_BASE                       TIM4_BASE_S
#endif
#define TIM16                           TIM16_S
#define TIM16_BASE                      TIM16_BASE_S
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define TIM17                           TIM17_S
#define TIM17_BASE                      TIM17_BASE_S
#endif
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define TSC                             TSC_S
#define TSC_BASE                        TSC_BASE_S
#endif
#define USART1                          USART1_S
#define USART1_BASE                     USART1_BASE_S
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define USART2                          USART2_S
#define USART2_BASE                     USART2_BASE_S
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define USART3                          USART3_S
#define USART3_BASE                     USART3_BASE_S
#endif
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define USB_DRD_FS                      USB_DRD_FS_S
#define USB_DRD_BASE                    USB_DRD_BASE_S
#define USB_DRD_PMAADDR                 USB_DRD_SRAM_BASE_S
#define USB_DRD_PMA_BUFF                USB_DRD_PMA_BUFF_S
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define VREFBUF                         VREFBUF_S
#define VREFBUF_BASE                    VREFBUF_BASE_S
#endif
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define WWDG                            WWDG_S
#define WWDG_BASE                       WWDG_BASE_S
#endif
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define XSPI1                           XSPI1_S
#define XSPI1_BASE                      XSPI1_BASE_S
#endif

#else
/*!< Memory base addresses for Non secure peripherals */
#define FLASH_BASE                     FLASH_BASE_NS
#define SRAM1_BASE                     SRAM1_BASE_NS
#define SRAM2_BASE                     SRAM2_BASE_NS
#define SRAM6_BASE                     SRAM6_BASE_NS
#define SEQSRAM_BASE                   SEQSRAM_BASE_NS

