STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/*!< Instance aliases and base addresses for Non secure peripherals */
#define ADC4                            ADC4_NS
#define ADC4_BASE                       ADC4_BASE_NS
#define ADC4_COMMON                     ADC4_COMMON_NS
#define ADC4_COMMON_BASE                ADC4_COMMON_BASE_NS
#if $WBA_CRYPTO$
#define AES                             AES_NS
#define AES_BASE                        AES_BASE_NS
#endif /* WBA_CRYPTO */
#if defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define COMP1                           COMP1_NS
#define COMP1_BASE                      COMP1_BASE_NS
#define COMP2                           COMP2_NS
#define COMP2_BASE                      COMP2_BASE_NS
#define COMP12_COMMON                   COMP12_COMMON_NS
#endif
#define CRC                             CRC_NS
#define CRC_BASE                        CRC_BASE_NS
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define DLYB1                           DLYB1_NS
#define DLYB1_BASE                      DLYB1_BASE_NS
#define DLYB_XSPI1                      DLYB1
#endif
#define EXTI                            EXTI_NS
#define EXTI_BASE                       EXTI_BASE_NS
#define FLASH                           FLASH_NS
#define FLASH_R_BASE                    FLASH_R_BASE_NS
#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define LPDMA1                          LPDMA1_NS
#define LPDMA1_BASE                     LPDMA1_BASE_NS
#define LPDMA1_Channel0                 LPDMA1_Channel0_NS
#define LPDMA1_Channel0_BASE            LPDMA1_Channel0_BASE_NS
#define LPDMA1_Channel1                 LPDMA1_Channel1_NS
#define LPDMA1_Channel1_BASE            LPDMA1_Channel1_BASE_NS
#define LPDMA1_Channel2                 LPDMA1_Channel2_NS
#define LPDMA1_Channel2_BASE            LPDMA1_Channel2_BASE_NS
#define LPDMA1_Channel3                 LPDMA1_Channel3_NS
#define LPDMA1_Channel3_BASE            LPDMA1_Channel3_BASE_NS
#define LPDMA1_Channel4                 LPDMA1_Channel4_NS
#define LPDMA1_Channel4_BASE            LPDMA1_Channel4_BASE_NS
#define LPDMA1_Channel5                 LPDMA1_Channel5_NS
#define LPDMA1_Channel5_BASE            LPDMA1_Channel5_BASE_NS
#define LPDMA1_Channel6                 LPDMA1_Channel6_NS
#define LPDMA1_Channel6_BASE            LPDMA1_Channel6_BASE_NS
#define LPDMA1_Channel7                 LPDMA1_Channel7_NS
#define LPDMA1_Channel7_BASE            LPDMA1_Channel7_BASE_NS
#else
#define GPDMA1                          GPDMA1_NS
#define GPDMA1_BASE                     GPDMA1_BASE_NS
#define GPDMA1_Channel0                 GPDMA1_Channel0_NS
#define GPDMA1_Channel0_BASE            GPDMA1_Channel0_BASE_NS
#define GPDMA1_Channel1                 GPDMA1_Channel1_NS
#define GPDMA1_Channel1_BASE            GPDMA1_Channel1_BASE_NS
#define GPDMA1_Channel2                 GPDMA1_Channel2_NS
#define GPDMA1_Channel2_BASE            GPDMA1_Channel2_BASE_NS
#define GPDMA1_Channel3                 GPDMA1_Channel3_NS
#define GPDMA1_Channel3_BASE            GPDMA1_Channel3_BASE_NS
#define GPDMA1_Channel4                 GPDMA1_Channel4_NS
#define GPDMA1_Channel4_BASE            GPDMA1_Channel4_BASE_NS
#define GPDMA1_Channel5                 GPDMA1_Channel5_NS
#define GPDMA1_Channel5_BASE            GPDMA1_Channel5_BASE_NS
#define GPDMA1_Channel6                 GPDMA1_Channel6_NS
#define GPDMA1_Channel6_BASE            GPDMA1_Channel6_BASE_NS
#define GPDMA1_Channel7                 GPDMA1_Channel7_NS
#define GPDMA1_Channel7_BASE            GPDMA1_Channel7_BASE_NS
#endif
#define GPIOA                           GPIOA_NS
#define GPIOA_BASE                      GPIOA_BASE_NS
#define GPIOB                           GPIOB_NS
#define GPIOB_BASE                      GPIOB_BASE_NS
#define GPIOC                           GPIOC_NS
#define GPIOC_BASE                      GPIOC_BASE_NS
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GPIOD                           GPIOD_NS
#define GPIOD_BASE                      GPIOD_BASE_NS
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GPIOE                           GPIOE_NS
#define GPIOE_BASE                      GPIOE_BASE_NS
#define GPIOG                           GPIOG_NS
#define GPIOG_BASE                      GPIOG_BASE_NS
#endif
#define GPIOH                           GPIOH_NS
#define GPIOH_BASE                      GPIOH_BASE_NS
#if $WBA_SECURITY$
#define GTZC_MPCBB1                     GTZC_MPCBB1_NS
#define GTZC_MPCBB1_BASE                GTZC_MPCBB1_BASE_NS
#define GTZC_MPCBB2                     GTZC_MPCBB2_NS
#define GTZC_MPCBB2_BASE                GTZC_MPCBB2_BASE_NS
#if !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_MPCBB6                     GTZC_MPCBB6_NS
#define GTZC_MPCBB6_BASE                GTZC_MPCBB6_BASE_NS
#endif
#define GTZC_TZSC                       GTZC_TZSC_NS
#define GTZC_TZSC_BASE                  GTZC_TZSC_BASE_NS
#endif
#define HASH                            HASH_NS
#define HASH_BASE                       HASH_BASE_NS
#define HASH_DIGEST                     HASH_DIGEST_NS
#define HASH_DIGEST_BASE                HASH_DIGEST_BASE_NS
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define HSEM                            HSEM_NS
#define HSEM_BASE                       HSEM_BASE_NS
#define HSEM_COMMON                     HSEM_COMMON_NS
#endif
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define I2C1                            I2C1_NS
#define I2C1_BASE                       I2C1_BASE_NS
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define I2C2                            I2C2_NS
#define I2C2_BASE                       I2C2_BASE_NS
#endif
#define I2C3                            I2C3_NS
#define I2C3_BASE                       I2C3_BASE_NS
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define I2C4                            I2C4_NS
#define I2C4_BASE                       I2C4_BASE_NS
#endif
#define ICACHE                          ICACHE_NS
#define ICACHE_BASE                     ICACHE_BASE_NS
#define IWDG                            IWDG_NS
#define IWDG_BASE                       IWDG_BASE_NS
#define LPTIM1                          LPTIM1_NS
#define LPTIM1_BASE                     LPTIM1_BASE_NS
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define LPTIM2                          LPTIM2_NS
#define LPTIM2_BASE                     LPTIM2_BASE_NS
#endif
#define LPUART1                         LPUART1_NS
#define LPUART1_BASE                    LPUART1_BASE_NS
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define OTFDEC1                         OTFDEC1_NS
#define OTFDEC1_REGION1                 OTFDEC1_REGION1_NS
#define OTFDEC1_REGION2                 OTFDEC1_REGION2_NS
#define OTFDEC1_REGION3                 OTFDEC1_REGION3_NS
#define OTFDEC1_REGION4                 OTFDEC1_REGION4_NS
#define OTFDEC1_BASE                    OTFDEC1_BASE_NS
#define OTFDEC1_REGION1_BASE            OTFDEC1_REGION1_BASE_NS
#define OTFDEC1_REGION2_BASE            OTFDEC1_REGION2_BASE_NS
#define OTFDEC1_REGION3_BASE            OTFDEC1_REGION3_BASE_NS
#define OTFDEC1_REGION4_BASE            OTFDEC1_REGION4_BASE_NS
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define USB_OTG_HS                      USB_OTG_HS_NS
#define USB_OTG_HS_BASE                 USB_OTG_HS_BASE_NS
#endif
#if $WBA_CRYPTO$
#define PKA                             PKA_NS
#define PKA_BASE                        PKA_BASE_NS
#define PKA_RAM_BASE                    PKA_RAM_BASE_NS
#endif /* WBA_CRYPTO */
#if defined (STM32WBA23xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define PTACONV_BASE                    PTACONV_BASE_NS
#define PTACONV                         PTACONV_NS
#endif
#define PWR                             PWR_NS
#define PWR_BASE                        PWR_BASE_NS
#define RADIO_BASE                      RADIO_BASE_NS
#define RAMCFG_SRAM1                    RAMCFG_SRAM1_NS
#define RAMCFG_SRAM1_BASE               RAMCFG_SRAM1_BASE_NS
#define RAMCFG_SRAM2                    RAMCFG_SRAM2_NS
#define RAMCFG_SRAM2_BASE               RAMCFG_SRAM2_BASE_NS
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define RAMCFG_SRAM6                    RAMCFG_SRAM6_NS
#define RAMCFG_SRAM6_BASE               RAMCFG_SRAM6_BASE_NS
#endif
#define RCC                             RCC_NS
#define RCC_BASE                        RCC_BASE_NS
#define RNG                             RNG_NS
#define RNG_BASE                        RNG_BASE_NS
#define RTC                             RTC_NS
#define RTC_BASE                        RTC_BASE_NS
#if $WBA_CRYPTO$
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define SAES                            SAES_NS
#define SAES_BASE                       SAES_BASE_NS
#endif
#endif /* WBA_CRYPTO */
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define SAI1                            SAI1_NS
#define SAI1_BASE                       SAI1_BASE_NS
#define SAI1_Block_A                    SAI1_Block_A_NS
#define SAI1_Block_A_BASE               SAI1_Block_A_BASE_NS
#define SAI1_Block_B                    SAI1_Block_B_NS
#define SAI1_Block_B_BASE               SAI1_Block_B_BASE_NS
#endif
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define SPI1                            SPI1_NS
#define SPI1_BASE                       SPI1_BASE_NS
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define SPI2                            SPI2_NS
#define SPI2_BASE                       SPI2_BASE_NS
#endif
#define SPI3                            SPI3_NS
#define SPI3_BASE                       SPI3_BASE_NS
#define SYSCFG                          SYSCFG_NS
#define SYSCFG_BASE                     SYSCFG_BASE_NS
#define TAMP                            TAMP_NS
#define TAMP_BASE                       TAMP_BASE_NS
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define TIM1                            TIM1_NS
#define TIM1_BASE                       TIM1_BASE_NS
#endif
#define TIM2                            TIM2_NS
#define TIM2_BASE                       TIM2_BASE_NS
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define TIM3                            TIM3_NS
#define TIM3_BASE                       TIM3_BASE_NS
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define TIM4                            TIM4_NS
#define TIM4_BASE                       TIM4_BASE_NS
#endif
#define TIM16                           TIM16_NS
#define TIM16_BASE                      TIM16_BASE_NS
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define TIM17                           TIM17_NS
#define TIM17_BASE                      TIM17_BASE_NS
#endif
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define TSC                             TSC_NS
#define TSC_BASE                        TSC_BASE_NS
#endif
#define USART1                          USART1_NS
#define USART1_BASE                     USART1_BASE_NS
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define USART2                          USART2_NS
#define USART2_BASE                     USART2_BASE_NS
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define USART3                          USART3_NS
#define USART3_BASE                     USART3_BASE_NS
#endif
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define USB_DRD_FS                      USB_DRD_FS_NS
#define USB_DRD_BASE                    USB_DRD_BASE_NS
#define USB_DRD_PMAADDR                 USB_DRD_SRAM_BASE_NS
#define USB_DRD_PMA_BUFF                USB_DRD_PMA_BUFF_NS
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define VREFBUF                         VREFBUF_NS
#define VREFBUF_BASE                    VREFBUF_BASE_NS
#endif
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define WWDG                            WWDG_NS
#define WWDG_BASE                       WWDG_BASE_NS
#endif
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define XSPI1                           XSPI1_NS
#define XSPI1_BASE                      XSPI1_BASE_NS
#endif
#endif

