STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/********************  Bit definition for DBGMCU_APB1LFZR register  ***********/
#define DBGMCU_APB1LFZR_DBG_TIM2_STOP_Pos   (0UL)
#define DBGMCU_APB1LFZR_DBG_TIM2_STOP_Msk   (0x1UL << DBGMCU_APB1LFZR_DBG_TIM2_STOP_Pos)
#define DBGMCU_APB1LFZR_DBG_TIM2_STOP       DBGMCU_APB1LFZR_DBG_TIM2_STOP_Msk
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define DBGMCU_APB1LFZR_DBG_TIM3_STOP_Pos   (1UL)
#define DBGMCU_APB1LFZR_DBG_TIM3_STOP_Msk   (0x1UL << DBGMCU_APB1LFZR_DBG_TIM3_STOP_Pos)
#define DBGMCU_APB1LFZR_DBG_TIM3_STOP       DBGMCU_APB1LFZR_DBG_TIM3_STOP_Msk
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define DBGMCU_APB1LFZR_DBG_TIM4_STOP_Pos   (2UL)
#define DBGMCU_APB1LFZR_DBG_TIM4_STOP_Msk   (0x1UL << DBGMCU_APB1LFZR_DBG_TIM4_STOP_Pos)
#define DBGMCU_APB1LFZR_DBG_TIM4_STOP       DBGMCU_APB1LFZR_DBG_TIM4_STOP_Msk
#endif
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define DBGMCU_APB1LFZR_DBG_WWDG_STOP_Pos   (11UL)
#define DBGMCU_APB1LFZR_DBG_WWDG_STOP_Msk   (0x1UL << DBGMCU_APB1LFZR_DBG_WWDG_STOP_Pos)
#define DBGMCU_APB1LFZR_DBG_WWDG_STOP       DBGMCU_APB1LFZR_DBG_WWDG_STOP_Msk
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define DBGMCU_APB1LFZR_DBG_IWDG_STOP_Pos   (12UL)
#define DBGMCU_APB1LFZR_DBG_IWDG_STOP_Msk   (0x1UL << DBGMCU_APB1LFZR_DBG_IWDG_STOP_Pos)
#define DBGMCU_APB1LFZR_DBG_IWDG_STOP       DBGMCU_APB1LFZR_DBG_IWDG_STOP_Msk
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define DBGMCU_APB1LFZR_DBG_I2C1_STOP_Pos   (21UL)
#define DBGMCU_APB1LFZR_DBG_I2C1_STOP_Msk   (0x1UL << DBGMCU_APB1LFZR_DBG_I2C1_STOP_Pos)
#define DBGMCU_APB1LFZR_DBG_I2C1_STOP       DBGMCU_APB1LFZR_DBG_I2C1_STOP_Msk
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define DBGMCU_APB1LFZR_DBG_I2C2_STOP_Pos   (22UL)
#define DBGMCU_APB1LFZR_DBG_I2C2_STOP_Msk   (0x1UL << DBGMCU_APB1LFZR_DBG_I2C2_STOP_Pos)
#define DBGMCU_APB1LFZR_DBG_I2C2_STOP       DBGMCU_APB1LFZR_DBG_I2C2_STOP_Msk
#endif
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)

/********************  Bit definition for DBGMCU_APB1HFZR register  ***********/
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define DBGMCU_APB1HFZR_DBG_I2C4_STOP_Pos   (1UL)
#define DBGMCU_APB1HFZR_DBG_I2C4_STOP_Msk   (0x1UL << DBGMCU_APB1HFZR_DBG_I2C4_STOP_Pos)
#define DBGMCU_APB1HFZR_DBG_I2C4_STOP       DBGMCU_APB1HFZR_DBG_I2C4_STOP_Msk
#endif
#define DBGMCU_APB1HFZR_DBG_LPTIM2_STOP_Pos (5UL)
#define DBGMCU_APB1HFZR_DBG_LPTIM2_STOP_Msk (0x1UL << DBGMCU_APB1HFZR_DBG_LPTIM2_STOP_Pos)
#define DBGMCU_APB1HFZR_DBG_LPTIM2_STOP     DBGMCU_APB1HFZR_DBG_LPTIM2_STOP_Msk
#endif

/********************  Bit definition for DBGMCU_APB2FZR register  ***********/
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define DBGMCU_APB2FZR_DBG_TIM1_STOP_Pos    (11UL)
#define DBGMCU_APB2FZR_DBG_TIM1_STOP_Msk    (0x1UL << DBGMCU_APB2FZR_DBG_TIM1_STOP_Pos)
#define DBGMCU_APB2FZR_DBG_TIM1_STOP        DBGMCU_APB2FZR_DBG_TIM1_STOP_Msk
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define DBGMCU_APB2FZR_DBG_TIM16_STOP_Pos   (17UL)
#define DBGMCU_APB2FZR_DBG_TIM16_STOP_Msk   (0x1UL << DBGMCU_APB2FZR_DBG_TIM16_STOP_Pos)
#define DBGMCU_APB2FZR_DBG_TIM16_STOP       DBGMCU_APB2FZR_DBG_TIM16_STOP_Msk
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define DBGMCU_APB2FZR_DBG_TIM17_STOP_Pos   (18UL)
#define DBGMCU_APB2FZR_DBG_TIM17_STOP_Msk   (0x1UL << DBGMCU_APB2FZR_DBG_TIM17_STOP_Pos)
#define DBGMCU_APB2FZR_DBG_TIM17_STOP       DBGMCU_APB2FZR_DBG_TIM17_STOP_Msk
#endif

/********************  Bit definition for DBGMCU_APB7FZR register  ***********/
#define DBGMCU_APB7FZR_DBG_I2C3_STOP_Pos    (10UL)
#define DBGMCU_APB7FZR_DBG_I2C3_STOP_Msk    (0x1UL << DBGMCU_APB7FZR_DBG_I2C3_STOP_Pos)
#define DBGMCU_APB7FZR_DBG_I2C3_STOP        DBGMCU_APB7FZR_DBG_I2C3_STOP_Msk
#define DBGMCU_APB7FZR_DBG_LPTIM1_STOP_Pos  (17UL)
#define DBGMCU_APB7FZR_DBG_LPTIM1_STOP_Msk  (0x1UL << DBGMCU_APB7FZR_DBG_LPTIM1_STOP_Pos)
#define DBGMCU_APB7FZR_DBG_LPTIM1_STOP      DBGMCU_APB7FZR_DBG_LPTIM1_STOP_Msk
#define DBGMCU_APB7FZR_DBG_RTC_STOP_Pos     (30UL)
#define DBGMCU_APB7FZR_DBG_RTC_STOP_Msk     (0x1UL << DBGMCU_APB7FZR_DBG_RTC_STOP_Pos)
#define DBGMCU_APB7FZR_DBG_RTC_STOP         DBGMCU_APB7FZR_DBG_RTC_STOP_Msk

/********************  Bit definition for DBGMCU_AHB1FZR register  ***********/
#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH0_STOP_Pos (0UL)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH0_STOP_Msk (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_CH0_STOP_Pos) /*!< 0x00000001 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH0_STOP     DBGMCU_AHB1FZR_DBG_LPDMA1_CH0_STOP_Msk            /*!< DBG_LPDMA1_CH0_STOP (LPDMA 1 channel 0 stop in CPU debug) */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH1_STOP_Pos (1UL)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH1_STOP_Msk (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_CH1_STOP_Pos) /*!< 0x00000002 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH1_STOP     DBGMCU_AHB1FZR_DBG_LPDMA1_CH1_STOP_Msk            /*!< DBG_LPDMA1_CH1_STOP (LPDMA 1 channel 1 stop in CPU debug) */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH2_STOP_Pos (2UL)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH2_STOP_Msk (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_CH2_STOP_Pos) /*!< 0x00000004 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH2_STOP     DBGMCU_AHB1FZR_DBG_LPDMA1_CH2_STOP_Msk            /*!< DBG_LPDMA1_CH2_STOP (LPDMA 1 channel 2 stop in CPU debug) */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH3_STOP_Pos (3UL)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH3_STOP_Msk (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_CH3_STOP_Pos) /*!< 0x00000008 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH3_STOP     DBGMCU_AHB1FZR_DBG_LPDMA1_CH3_STOP_Msk            /*!< DBG_LPDMA1_CH3_STOP (LPDMA 1 channel 3 stop in CPU debug) */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH4_STOP_Pos (4UL)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH4_STOP_Msk (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_CH4_STOP_Pos) /*!< 0x00000010 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH4_STOP     DBGMCU_AHB1FZR_DBG_LPDMA1_CH4_STOP_Msk            /*!< DBG_LPDMA1_CH4_STOP (LPDMA 1 channel 4 stop in CPU debug) */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH5_STOP_Pos (5UL)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH5_STOP_Msk (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_CH5_STOP_Pos) /*!< 0x00000020 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH5_STOP     DBGMCU_AHB1FZR_DBG_LPDMA1_CH5_STOP_Msk            /*!< DBG_LPDMA1_CH5_STOP (LPDMA 1 channel 5 stop in CPU debug) */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH6_STOP_Pos (6UL)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH6_STOP_Msk (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_CH6_STOP_Pos) /*!< 0x00000040 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH6_STOP     DBGMCU_AHB1FZR_DBG_LPDMA1_CH6_STOP_Msk            /*!< DBG_LPDMA1_CH6_STOP (LPDMA 1 channel 6 stop in CPU debug) */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH7_STOP_Pos (7UL)
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH7_STOP_Msk (0x1UL << DBGMCU_AHB1FZR_DBG_LPDMA1_CH7_STOP_Pos) /*!< 0x00000080 */
#define DBGMCU_AHB1FZR_DBG_LPDMA1_CH7_STOP     DBGMCU_AHB1FZR_DBG_LPDMA1_CH7_STOP_Msk            /*!< DBG_LPDMA1_CH7_STOP (LPDMA 1 channel 7 stop in CPU debug) */
#else /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH0_STOP_Pos  (0UL)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH0_STOP_Msk  (0x1UL << DBGMCU_AHB1FZR_DBG_GPDMA1_CH0_STOP_Pos)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH0_STOP      DBGMCU_AHB1FZR_DBG_GPDMA1_CH0_STOP_Msk
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH1_STOP_Pos  (1UL)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH1_STOP_Msk  (0x1UL << DBGMCU_AHB1FZR_DBG_GPDMA1_CH1_STOP_Pos)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH1_STOP      DBGMCU_AHB1FZR_DBG_GPDMA1_CH1_STOP_Msk
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH2_STOP_Pos  (2UL)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH2_STOP_Msk  (0x1UL << DBGMCU_AHB1FZR_DBG_GPDMA1_CH2_STOP_Pos)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH2_STOP      DBGMCU_AHB1FZR_DBG_GPDMA1_CH2_STOP_Msk
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH3_STOP_Pos  (3UL)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH3_STOP_Msk  (0x1UL << DBGMCU_AHB1FZR_DBG_GPDMA1_CH3_STOP_Pos)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH3_STOP      DBGMCU_AHB1FZR_DBG_GPDMA1_CH3_STOP_Msk
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH4_STOP_Pos  (4UL)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH4_STOP_Msk  (0x1UL << DBGMCU_AHB1FZR_DBG_GPDMA1_CH4_STOP_Pos)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH4_STOP      DBGMCU_AHB1FZR_DBG_GPDMA1_CH4_STOP_Msk
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH5_STOP_Pos  (5UL)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH5_STOP_Msk  (0x1UL << DBGMCU_AHB1FZR_DBG_GPDMA1_CH5_STOP_Pos)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH5_STOP      DBGMCU_AHB1FZR_DBG_GPDMA1_CH5_STOP_Msk
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH6_STOP_Pos  (6UL)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH6_STOP_Msk  (0x1UL << DBGMCU_AHB1FZR_DBG_GPDMA1_CH6_STOP_Pos)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH6_STOP      DBGMCU_AHB1FZR_DBG_GPDMA1_CH6_STOP_Msk
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH7_STOP_Pos  (7UL)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH7_STOP_Msk  (0x1UL << DBGMCU_AHB1FZR_DBG_GPDMA1_CH7_STOP_Pos)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_CH7_STOP      DBGMCU_AHB1FZR_DBG_GPDMA1_CH7_STOP_Msk
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */

#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
/********************  Bit definition for DBGMCU_SR register  ********************/
#define DBGMCU_SR_AP_PRESENT_Pos (0UL)
#define DBGMCU_SR_AP_PRESENT_Msk (0xFFFFUL << DBGMCU_SR_AP_PRESENT_Pos) /*!< 0x0000FFFF */
#define DBGMCU_SR_AP_PRESENT     DBGMCU_SR_AP_PRESENT_Msk               /*!< AP_PRESENT[15:0] bits (Bit n identifies whether access port APn is present in device) */
#define DBGMCU_SR_AP_ENABLED_Pos (16UL)
#define DBGMCU_SR_AP_ENABLED_Msk (0xFFFFUL << DBGMCU_SR_AP_ENABLED_Pos) /*!< 0xFFFF0000 */
#define DBGMCU_SR_AP_ENABLED     DBGMCU_SR_AP_ENABLED_Msk               /*!< AP_ENABLED[15:0] bits (Bit n identifies whether access port APn is open (can be accessed via the debug port) or locked (debug access to the APn is blocked, except for DBGMCU access)) */

/********************  Bit definition for DBGMCU_DBG_AUTH_HOST register  ********************/
#define DBGMCU_DBG_AUTH_HOST_AUTH_KEY_Pos (0UL)
#define DBGMCU_DBG_AUTH_HOST_AUTH_KEY_Msk (0xFFFFFFFFUL << DBGMCU_DBG_AUTH_HOST_AUTH_KEY_Pos) /*!< 0xFFFFFFFF */
#define DBGMCU_DBG_AUTH_HOST_AUTH_KEY     DBGMCU_DBG_AUTH_HOST_AUTH_KEY_Msk                   /*!< AUTH_KEY[31:0] bits (Device authentication key) */

