STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/********************  Bit definition for DBGMCU_DBG_AUTH_DEVICE register  ********************/
#define DBGMCU_DBG_AUTH_DEVICE_AUTH_ID_Pos (0UL)
#define DBGMCU_DBG_AUTH_DEVICE_AUTH_ID_Msk (0xFFFFFFFFUL << DBGMCU_DBG_AUTH_DEVICE_AUTH_ID_Pos) /*!< 0xFFFFFFFF */
#define DBGMCU_DBG_AUTH_DEVICE_AUTH_ID     DBGMCU_DBG_AUTH_DEVICE_AUTH_ID_Msk                   /*!< AUTH_ID[31:0] bits (Device specific ID) */

#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */

#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
/******************************************************************************/
/*                                                                            */
/*                                   (DLYB)                                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for DLYB_CR register  ********************/
#define DLYB_CR_DEN_Pos       (0UL)
#define DLYB_CR_DEN_Msk       (0x1U << DLYB_CR_DEN_Pos)      /*!< 0x00000001 */
#define DLYB_CR_DEN           DLYB_CR_DEN_Msk                /*!< Delay block enable bit */
#define DLYB_CR_SEN_Pos       (1UL)
#define DLYB_CR_SEN_Msk       (0x1U << DLYB_CR_SEN_Pos)      /*!< 0x00000002 */
#define DLYB_CR_SEN           DLYB_CR_SEN_Msk                /*!< Sampler length enable bit */

/******************  Bit definition for DLYB_CFGR register  *******************/
#define DLYB_CFGR_SEL_Pos     (0UL)
#define DLYB_CFGR_SEL_Msk     (0xFU << DLYB_CFGR_SEL_Pos)    /*!< 0x0000000F */
#define DLYB_CFGR_SEL         DLYB_CFGR_SEL_Msk              /*!< Phase for the output clock */
#define DLYB_CFGR_SEL_0       (0x1UL << DLYB_CFGR_SEL_Pos)   /*!< 0x00000001 */
#define DLYB_CFGR_SEL_1       (0x2UL << DLYB_CFGR_SEL_Pos)   /*!< 0x00000002 */
#define DLYB_CFGR_SEL_2       (0x3UL << DLYB_CFGR_SEL_Pos)   /*!< 0x00000003 */
#define DLYB_CFGR_SEL_3       (0x8UL << DLYB_CFGR_SEL_Pos)   /*!< 0x00000008 */

#define DLYB_CFGR_UNIT_Pos    (8UL)
#define DLYB_CFGR_UNIT_Msk    (0x7FU << DLYB_CFGR_UNIT_Pos)  /*!< 0x00007F00 */
#define DLYB_CFGR_UNIT        DLYB_CFGR_UNIT_Msk             /*!< Delay of a unit delay cell */
#define DLYB_CFGR_UNIT_0      (0x01UL << DLYB_CFGR_UNIT_Pos) /*!< 0x00000100 */
#define DLYB_CFGR_UNIT_1      (0x02UL << DLYB_CFGR_UNIT_Pos) /*!< 0x00000200 */
#define DLYB_CFGR_UNIT_2      (0x04UL << DLYB_CFGR_UNIT_Pos) /*!< 0x00000400 */
#define DLYB_CFGR_UNIT_3      (0x08UL << DLYB_CFGR_UNIT_Pos) /*!< 0x00000800 */
#define DLYB_CFGR_UNIT_4      (0x10UL << DLYB_CFGR_UNIT_Pos) /*!< 0x00001000 */
#define DLYB_CFGR_UNIT_5      (0x20UL << DLYB_CFGR_UNIT_Pos) /*!< 0x00002000 */
#define DLYB_CFGR_UNIT_6      (0x40UL << DLYB_CFGR_UNIT_Pos) /*!< 0x00004000 */

#define DLYB_CFGR_LNG_Pos     (16UL)
#define DLYB_CFGR_LNG_Msk     (0xFFFU << DLYB_CFGR_LNG_Pos)  /*!< 0x0FFF0000 */
#define DLYB_CFGR_LNG         DLYB_CFGR_LNG_Msk              /*!< Delay line length value */
#define DLYB_CFGR_LNG_0       (0x001UL << DLYB_CFGR_LNG_Pos) /*!< 0x00010000 */
#define DLYB_CFGR_LNG_1       (0x002UL << DLYB_CFGR_LNG_Pos) /*!< 0x00020000 */
#define DLYB_CFGR_LNG_2       (0x004UL << DLYB_CFGR_LNG_Pos) /*!< 0x00040000 */
#define DLYB_CFGR_LNG_3       (0x008UL << DLYB_CFGR_LNG_Pos) /*!< 0x00080000 */
#define DLYB_CFGR_LNG_4       (0x010UL << DLYB_CFGR_LNG_Pos) /*!< 0x00100000 */
#define DLYB_CFGR_LNG_5       (0x020UL << DLYB_CFGR_LNG_Pos) /*!< 0x00200000 */
#define DLYB_CFGR_LNG_6       (0x040UL << DLYB_CFGR_LNG_Pos) /*!< 0x00400000 */
#define DLYB_CFGR_LNG_7       (0x080UL << DLYB_CFGR_LNG_Pos) /*!< 0x00800000 */
#define DLYB_CFGR_LNG_8       (0x100UL << DLYB_CFGR_LNG_Pos) /*!< 0x01000000 */
#define DLYB_CFGR_LNG_9       (0x200UL << DLYB_CFGR_LNG_Pos) /*!< 0x02000000 */
#define DLYB_CFGR_LNG_10      (0x400UL << DLYB_CFGR_LNG_Pos) /*!< 0x04000000 */
#define DLYB_CFGR_LNG_11      (0x800UL << DLYB_CFGR_LNG_Pos) /*!< 0x08000000 */

#define DLYB_CFGR_LNGF_Pos    (31UL)
#define DLYB_CFGR_LNGF_Msk    (0x1U << DLYB_CFGR_LNGF_Pos)   /*!< 0x80000000 */
#define DLYB_CFGR_LNGF        DLYB_CFGR_LNGF_Msk             /*!< Length valid flag */

#endif
/******************************************************************************/
/*                                                                            */
/*                           DMA Controller (DMA)                             */
/*                                                                            */
/******************************************************************************/
#if $WBA_SECURITY$

/*******************  Bit definition for DMA_SECCFGR register  ****************/
#define DMA_SECCFGR_SEC0_Pos                (0UL)
#define DMA_SECCFGR_SEC0_Msk                (0x1UL << DMA_SECCFGR_SEC0_Pos)         /*!< 0x00000001 */
#define DMA_SECCFGR_SEC0                    DMA_SECCFGR_SEC0_Msk                    /*!< Secure State of Channel 0 */
#define DMA_SECCFGR_SEC1_Pos                (1UL)
#define DMA_SECCFGR_SEC1_Msk                (0x1UL << DMA_SECCFGR_SEC1_Pos)         /*!< 0x00000002 */
#define DMA_SECCFGR_SEC1                    DMA_SECCFGR_SEC1_Msk                    /*!< Secure State of Channel 1 */
#define DMA_SECCFGR_SEC2_Pos                (2UL)
#define DMA_SECCFGR_SEC2_Msk                (0x1UL << DMA_SECCFGR_SEC2_Pos)         /*!< 0x00000004 */
#define DMA_SECCFGR_SEC2                    DMA_SECCFGR_SEC2_Msk                    /*!< Secure State of Channel 2 */
#define DMA_SECCFGR_SEC3_Pos                (3UL)
#define DMA_SECCFGR_SEC3_Msk                (0x1UL << DMA_SECCFGR_SEC3_Pos)         /*!< 0x00000008 */
#define DMA_SECCFGR_SEC3                    DMA_SECCFGR_SEC3_Msk                    /*!< Secure State of Channel 3 */
#define DMA_SECCFGR_SEC4_Pos                (4UL)
#define DMA_SECCFGR_SEC4_Msk                (0x1UL << DMA_SECCFGR_SEC4_Pos)         /*!< 0x00000010 */
#define DMA_SECCFGR_SEC4                    DMA_SECCFGR_SEC4_Msk                    /*!< Secure State of Channel 4 */
#define DMA_SECCFGR_SEC5_Pos                (5UL)
#define DMA_SECCFGR_SEC5_Msk                (0x1UL << DMA_SECCFGR_SEC5_Pos)         /*!< 0x00000020 */
#define DMA_SECCFGR_SEC5                    DMA_SECCFGR_SEC5_Msk                    /*!< Secure State of Channel 5 */
#define DMA_SECCFGR_SEC6_Pos                (6UL)
#define DMA_SECCFGR_SEC6_Msk                (0x1UL << DMA_SECCFGR_SEC6_Pos)         /*!< 0x00000040 */
#define DMA_SECCFGR_SEC6                    DMA_SECCFGR_SEC6_Msk                    /*!< Secure State of Channel 6 */
#define DMA_SECCFGR_SEC7_Pos                (7UL)
#define DMA_SECCFGR_SEC7_Msk                (0x1UL << DMA_SECCFGR_SEC7_Pos)         /*!< 0x00000080 */
#define DMA_SECCFGR_SEC7                    DMA_SECCFGR_SEC7_Msk                    /*!< Secure State of Channel 7 */

