STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
#if $WBA_SECURITY$
/******************  Bits definition for FLASH_SECCR1 register  ****************/
#define FLASH_SECCR1_PG_Pos                 (0UL)
#define FLASH_SECCR1_PG_Msk                 (0x1UL << FLASH_SECCR1_PG_Pos)           /*!< 0x00000001 */
#define FLASH_SECCR1_PG                     FLASH_SECCR1_PG_Msk                      /*!< Secure Programming */
#define FLASH_SECCR1_PER_Pos                (1UL)
#define FLASH_SECCR1_PER_Msk                (0x1UL << FLASH_SECCR1_PER_Pos)          /*!< 0x00000002 */
#define FLASH_SECCR1_PER                    FLASH_SECCR1_PER_Msk                     /*!< Secure Page Erase */
#if $WBA_DUAL_BANK$
#define FLASH_SECCR1_MER1_Pos               (2UL)
#define FLASH_SECCR1_MER1_Msk               (0x1UL << FLASH_SECCR1_MER1_Pos)         /*!< 0x00000004 */
#define FLASH_SECCR1_MER1                   FLASH_SECCR1_MER1_Msk                    /*!< Secure Flash Bank 1 Erase */
#else
#define FLASH_SECCR1_MER_Pos                (2UL)
#define FLASH_SECCR1_MER_Msk                (0x1UL << FLASH_SECCR1_MER_Pos)          /*!< 0x00000004 */
#define FLASH_SECCR1_MER                    FLASH_SECCR1_MER_Msk                     /*!< Secure Bank 1 Mass Erase */
#endif
#define FLASH_SECCR1_PNB_Pos                (3UL)
#define FLASH_SECCR1_PNB_Msk                (0x7FUL << FLASH_SECCR1_PNB_Pos)         /*!< 0x000003F8 */
#define FLASH_SECCR1_PNB                    FLASH_SECCR1_PNB_Msk                     /*!< Secure Page Number selection */
#if $WBA_DUAL_BANK$
#define FLASH_SECCR1_BKER_Pos               (11UL)
#define FLASH_SECCR1_BKER_Msk               (0x1UL << FLASH_SECCR1_BKER_Pos)         /*!< 0x00000800 */
#define FLASH_SECCR1_BKER                   FLASH_SECCR1_BKER_Msk                    /*!< Secure Bank Selection for Page Erase */
#endif
#define FLASH_SECCR1_BWR_Pos                (14UL)
#define FLASH_SECCR1_BWR_Msk                (0x1UL << FLASH_SECCR1_BWR_Pos)          /*!< 0x00004000 */
#define FLASH_SECCR1_BWR                    FLASH_SECCR1_BWR_Msk                     /*!< Secure Burst Write programming mode */
#if $WBA_DUAL_BANK$
#define FLASH_SECCR1_MER2_Pos               (15UL)
#define FLASH_SECCR1_MER2_Msk               (0x1UL << FLASH_SECCR1_MER2_Pos)         /*!< 0x00008000 */
#define FLASH_SECCR1_MER2                   FLASH_SECCR1_MER2_Msk                    /*!< Secure Flash Bank 2 Erase */
#endif
#define FLASH_SECCR1_STRT_Pos               (16UL)
#define FLASH_SECCR1_STRT_Msk               (0x1UL << FLASH_SECCR1_STRT_Pos)         /*!< 0x00010000 */
#define FLASH_SECCR1_STRT                   FLASH_SECCR1_STRT_Msk                    /*!< Secure Start */
#define FLASH_SECCR1_EOPIE_Pos              (24UL)
#define FLASH_SECCR1_EOPIE_Msk              (0x1UL << FLASH_SECCR1_EOPIE_Pos)        /*!< 0x01000000 */
#define FLASH_SECCR1_EOPIE                  FLASH_SECCR1_EOPIE_Msk                   /*!< Secure end of operation interrupt enable */
#define FLASH_SECCR1_ERRIE_Pos              (25UL)
#define FLASH_SECCR1_ERRIE_Msk              (0x1UL << FLASH_SECCR1_ERRIE_Pos)        /*!< 0x02000000 */
#define FLASH_SECCR1_ERRIE                  FLASH_SECCR1_ERRIE_Msk                   /*!< Secure error interrupt enable */
#define FLASH_SECCR1_INV_Pos                (29UL)
#define FLASH_SECCR1_INV_Msk                (0x1UL << FLASH_SECCR1_INV_Pos)          /*!< 0x20000000 */
#define FLASH_SECCR1_INV                    FLASH_SECCR1_INV_Msk                     /*!< Flash Security State Invert */
#define FLASH_SECCR1_LOCK_Pos               (31UL)
#define FLASH_SECCR1_LOCK_Msk               (0x1UL << FLASH_SECCR1_LOCK_Pos)         /*!< 0x80000000 */
#define FLASH_SECCR1_LOCK                   FLASH_SECCR1_LOCK_Msk                    /*!< Secure Lock */
#endif

/*******************  Bits definition for FLASH_ECCR register  ***************/
#define FLASH_ECCR_ADDR_ECC_Pos             (0UL)
#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA50xx)
#define FLASH_ECCR_ADDR_ECC_Msk             (0x7FFFFUL << FLASH_ECCR_ADDR_ECC_Pos)  /*!< 0x0007FFFF */
#else
#define FLASH_ECCR_ADDR_ECC_Msk             (0xFFFFFUL << FLASH_ECCR_ADDR_ECC_Pos)  /*!< 0x000FFFFF */
#endif
#define FLASH_ECCR_ADDR_ECC                 FLASH_ECCR_ADDR_ECC_Msk                 /*!< ECC fail address */
#if $WBA_DUAL_BANK$
#define FLASH_ECCR_BK_ECC_Pos               (21UL)
#define FLASH_ECCR_BK_ECC_Msk               (0x1UL << FLASH_ECCR_BK_ECC_Pos)        /*!< 0x00200000 */
#define FLASH_ECCR_BK_ECC                   FLASH_ECCR_BK_ECC_Msk                   /*!< Bank ECC fail */
#endif
#define FLASH_ECCR_SYSF_ECC_Pos             (22UL)
#define FLASH_ECCR_SYSF_ECC_Msk             (0x1UL << FLASH_ECCR_SYSF_ECC_Pos)      /*!< 0x00400000 */
#define FLASH_ECCR_SYSF_ECC                 FLASH_ECCR_SYSF_ECC_Msk                 /*!< System Flash ECC fail */
#define FLASH_ECCR_ECCIE_Pos                (24UL)
#define FLASH_ECCR_ECCIE_Msk                (0x1UL << FLASH_ECCR_ECCIE_Pos)         /*!< 0x01000000 */
#define FLASH_ECCR_ECCIE                    FLASH_ECCR_ECCIE_Msk                    /*!< ECC correction interrupt enable */
#define FLASH_ECCR_ECCC_Pos                 (30UL)
#define FLASH_ECCR_ECCC_Msk                 (0x1UL << FLASH_ECCR_ECCC_Pos)          /*!< 0x40000000 */
#define FLASH_ECCR_ECCC                     FLASH_ECCR_ECCC_Msk                     /*!< ECC correction */
#define FLASH_ECCR_ECCD_Pos                 (31UL)
#define FLASH_ECCR_ECCD_Msk                 (0x1UL << FLASH_ECCR_ECCD_Pos)          /*!< 0x80000000 */
#define FLASH_ECCR_ECCD                     FLASH_ECCR_ECCD_Msk                     /*!< ECC detection */

/*******************  Bits definition for FLASH_OPSR register  ***************/
#define FLASH_OPSR_ADDR_OP_Pos              (0UL)
#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA50xx)
#define FLASH_OPSR_ADDR_OP_Msk              (0x7FFFFUL << FLASH_OPSR_ADDR_OP_Pos)   /*!< 0x0007FFFF */
#else
#define FLASH_OPSR_ADDR_OP_Msk              (0xFFFFFUL << FLASH_OPSR_ADDR_OP_Pos)   /*!< 0x000FFFFF */
#endif
#define FLASH_OPSR_ADDR_OP                  FLASH_OPSR_ADDR_OP_Msk                  /*!< Interrupted operation address */
#if $WBA_DUAL_BANK$
#define FLASH_OPSR_BK_OP_Pos                (21UL)
#define FLASH_OPSR_BK_OP_Msk                (0x1UL << FLASH_OPSR_BK_OP_Pos)         /*!< 0x00200000 */
#define FLASH_OPSR_BK_OP                    FLASH_OPSR_BK_OP_Msk                    /*!< Operation in bank interrupted */
#endif
#define FLASH_OPSR_SYSF_OP_Pos              (22UL)
#define FLASH_OPSR_SYSF_OP_Msk              (0x1UL << FLASH_OPSR_SYSF_OP_Pos)       /*!< 0x00400000 */
#define FLASH_OPSR_SYSF_OP                  FLASH_OPSR_SYSF_OP_Msk                  /*!< Operation in system Flash memory interrupted */
#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define FLASH_OPSR_ET_OP_Pos                (23UL)
#define FLASH_OPSR_ET_OP_Msk                (0x3FU << FLASH_OPSR_ET_OP_Pos)         /*!< 0x1F800000 */
#define FLASH_OPSR_ET_OP                    FLASH_OPSR_ET_OP_Msk                    /*!< Elapsed erase time before interruption */
#endif
#define FLASH_OPSR_CODE_OP_Pos              (29UL)
#define FLASH_OPSR_CODE_OP_Msk              (0x7UL << FLASH_OPSR_CODE_OP_Pos)       /*!< 0x07000000 */
#define FLASH_OPSR_CODE_OP                  FLASH_OPSR_CODE_OP_Msk                  /*!<  Flash memory operation code */
#define FLASH_OPSR_CODE_OP_0                (0x1UL << FLASH_OPSR_CODE_OP_Pos)       /*!< 0x01000000 */
#define FLASH_OPSR_CODE_OP_1                (0x2UL << FLASH_OPSR_CODE_OP_Pos)       /*!< 0x02000000 */
#define FLASH_OPSR_CODE_OP_2                (0x4UL << FLASH_OPSR_CODE_OP_Pos)       /*!< 0x04000000 */

/*******************  Bits definition for FLASH_NSCR2 register  ***************/
#if $WBA_DUAL_BANK$
#define FLASH_NSCR2_PS1_Pos                 (0UL)
#define FLASH_NSCR2_PS1_Msk                 (0x1UL << FLASH_NSCR2_PS1_Pos)          /*!< 0x00000001 */
#define FLASH_NSCR2_PS1                     FLASH_NSCR2_PS1_Msk                     /*!< Bank 1 non-secure program suspend request */
#define FLASH_NSCR2_ES1_Pos                 (1UL)
#define FLASH_NSCR2_ES1_Msk                 (0x1UL << FLASH_NSCR2_ES1_Pos)          /*!< 0x00000002 */
#define FLASH_NSCR2_ES1                     FLASH_NSCR2_ES1_Msk                     /*!< Bank 1 non-secure erase suspend request */
#define FLASH_NSCR2_PS2_Pos                 (16UL)
#define FLASH_NSCR2_PS2_Msk                 (0x1UL << FLASH_NSCR2_PS2_Pos)          /*!< 0x00010000 */
#define FLASH_NSCR2_PS2                     FLASH_NSCR2_PS2_Msk                     /*!< Bank 2 non-secure program suspend request */
#define FLASH_NSCR2_ES2_Pos                 (17UL)
#define FLASH_NSCR2_ES2_Msk                 (0x1UL << FLASH_NSCR2_ES2_Pos)          /*!< 0x00020000 */
#define FLASH_NSCR2_ES2                     FLASH_NSCR2_ES2_Msk                     /*!< Bank 2 non-secure erase suspend request */
#else
#define FLASH_NSCR2_PS_Pos                  (0UL)
#define FLASH_NSCR2_PS_Msk                  (0x1UL << FLASH_NSCR2_PS_Pos)           /*!< 0x00000001 */
#define FLASH_NSCR2_PS                      FLASH_NSCR2_PS_Msk                      /*!< Program suspend request */
#define FLASH_NSCR2_ES_Pos                  (1UL)
#define FLASH_NSCR2_ES_Msk                  (0x1UL << FLASH_NSCR2_ES_Pos)           /*!< 0x00000002 */
#define FLASH_NSCR2_ES                      FLASH_NSCR2_ES_Msk                      /*!< Erase suspend request */
#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define FLASH_NSCR2_OPA_Pos                 (8UL)
#define FLASH_NSCR2_OPA_Msk                 (0x1U << FLASH_NSCR2_OPA_Pos)           /*!< 0x00000100 */
#define FLASH_NSCR2_OPA                     FLASH_NSCR2_OPA_Msk                     /*!< Flash operation abort */
#endif
#endif

