STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/********************  Bit definition for FLASH_OEM2KEYR4 register  ********************/
#define FLASH_OEM2KEYR4_OEM2KEY_Pos         (0UL)
#define FLASH_OEM2KEYR4_OEM2KEY_Msk         (0xFFFFFFFFUL << FLASH_OEM2KEYR4_OEM2KEY_Pos)  /*!< 0xFFFFFFFF */
#define FLASH_OEM2KEYR4_OEM2KEY             FLASH_OEM2KEYR4_OEM2KEY_Msk                    /*!< OEM2KEY[31:0] bits (OEM2 key most significant bytes) */

/********************  Bit definition for FLASH_OEMKEYSR register  ********************/
#define FLASH_OEMKEYSR_OEM1KEYCRC_Pos       (0UL)
#define FLASH_OEMKEYSR_OEM1KEYCRC_Msk       (0xFFUL << FLASH_OEMKEYSR_OEM1KEYCRC_Pos)      /*!< 0x000000FF */
#define FLASH_OEMKEYSR_OEM1KEYCRC           FLASH_OEMKEYSR_OEM1KEYCRC_Msk                  /*!< OEM1KEYCRC[7:0] bits (OEM1 key CRC value) */
#define FLASH_OEMKEYSR_OEM2KEYCRC_Pos       (16UL)
#define FLASH_OEMKEYSR_OEM2KEYCRC_Msk       (0xFFUL << FLASH_OEMKEYSR_OEM2KEYCRC_Pos)      /*!< 0x00FF0000 */
#define FLASH_OEMKEYSR_OEM2KEYCRC           FLASH_OEMKEYSR_OEM2KEYCRC_Msk                  /*!< OEM2KEYCRC[7:0] bits (OEM2 key CRC value) */

#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#if $WBA_SECURITY$
#if $WBA_DUAL_BANK$
/*******************  Bit definition for FLASH_SECBB1R1 register  ******************/
#define FLASH_SECBB1R1_SECBB0_Pos                   (0UL)
#define FLASH_SECBB1R1_SECBB0_Msk                   (0x1UL << FLASH_SECBB1R1_SECBB0_Pos)            /*!< 0x00000001 */
#define FLASH_SECBB1R1_SECBB0                       FLASH_SECBB1R1_SECBB0_Msk                       /*!< Page 0 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB1_Pos                   (1UL)
#define FLASH_SECBB1R1_SECBB1_Msk                   (0x1UL << FLASH_SECBB1R1_SECBB1_Pos)            /*!< 0x00000002 */
#define FLASH_SECBB1R1_SECBB1                       FLASH_SECBB1R1_SECBB1_Msk                       /*!< Page 1 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB2_Pos                   (2UL)
#define FLASH_SECBB1R1_SECBB2_Msk                   (0x1UL << FLASH_SECBB1R1_SECBB2_Pos)            /*!< 0x00000004 */
#define FLASH_SECBB1R1_SECBB2                       FLASH_SECBB1R1_SECBB2_Msk                       /*!< Page 2 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB3_Pos                   (3UL)
#define FLASH_SECBB1R1_SECBB3_Msk                   (0x1UL << FLASH_SECBB1R1_SECBB3_Pos)            /*!< 0x00000008 */
#define FLASH_SECBB1R1_SECBB3                       FLASH_SECBB1R1_SECBB3_Msk                       /*!< Page 3 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB4_Pos                   (4UL)
#define FLASH_SECBB1R1_SECBB4_Msk                   (0x1UL << FLASH_SECBB1R1_SECBB4_Pos)            /*!< 0x00000010 */
#define FLASH_SECBB1R1_SECBB4                       FLASH_SECBB1R1_SECBB4_Msk                       /*!< Page 4 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB5_Pos                   (5UL)
#define FLASH_SECBB1R1_SECBB5_Msk                   (0x1UL << FLASH_SECBB1R1_SECBB5_Pos)            /*!< 0x00000020 */
#define FLASH_SECBB1R1_SECBB5                       FLASH_SECBB1R1_SECBB5_Msk                       /*!< Page 5 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB6_Pos                   (6UL)
#define FLASH_SECBB1R1_SECBB6_Msk                   (0x1UL << FLASH_SECBB1R1_SECBB6_Pos)            /*!< 0x00000040 */
#define FLASH_SECBB1R1_SECBB6                       FLASH_SECBB1R1_SECBB6_Msk                       /*!< Page 6 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB7_Pos                   (7UL)
#define FLASH_SECBB1R1_SECBB7_Msk                   (0x1UL << FLASH_SECBB1R1_SECBB7_Pos)            /*!< 0x00000080 */
#define FLASH_SECBB1R1_SECBB7                       FLASH_SECBB1R1_SECBB7_Msk                       /*!< Page 7 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB8_Pos                   (8UL)
#define FLASH_SECBB1R1_SECBB8_Msk                   (0x1UL << FLASH_SECBB1R1_SECBB8_Pos)            /*!< 0x00000100 */
#define FLASH_SECBB1R1_SECBB8                       FLASH_SECBB1R1_SECBB8_Msk                       /*!< Page 8 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB9_Pos                   (9UL)
#define FLASH_SECBB1R1_SECBB9_Msk                   (0x1UL << FLASH_SECBB1R1_SECBB9_Pos)            /*!< 0x00000200 */
#define FLASH_SECBB1R1_SECBB9                       FLASH_SECBB1R1_SECBB9_Msk                       /*!< Page 9 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB10_Pos                  (10UL)
#define FLASH_SECBB1R1_SECBB10_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB10_Pos)           /*!< 0x00000400 */
#define FLASH_SECBB1R1_SECBB10                      FLASH_SECBB1R1_SECBB10_Msk                      /*!< Page 10 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB11_Pos                  (11UL)
#define FLASH_SECBB1R1_SECBB11_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB11_Pos)           /*!< 0x00000800 */
#define FLASH_SECBB1R1_SECBB11                      FLASH_SECBB1R1_SECBB11_Msk                      /*!< Page 11 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB12_Pos                  (12UL)
#define FLASH_SECBB1R1_SECBB12_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB12_Pos)           /*!< 0x00001000 */
#define FLASH_SECBB1R1_SECBB12                      FLASH_SECBB1R1_SECBB12_Msk                      /*!< Page 12 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB13_Pos                  (13UL)
#define FLASH_SECBB1R1_SECBB13_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB13_Pos)           /*!< 0x00002000 */
#define FLASH_SECBB1R1_SECBB13                      FLASH_SECBB1R1_SECBB13_Msk                      /*!< Page 13 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB14_Pos                  (14UL)
#define FLASH_SECBB1R1_SECBB14_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB14_Pos)           /*!< 0x00004000 */
#define FLASH_SECBB1R1_SECBB14                      FLASH_SECBB1R1_SECBB14_Msk                      /*!< Page 14 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB15_Pos                  (15UL)
#define FLASH_SECBB1R1_SECBB15_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB15_Pos)           /*!< 0x00008000 */
#define FLASH_SECBB1R1_SECBB15                      FLASH_SECBB1R1_SECBB15_Msk                      /*!< Page 15 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB16_Pos                  (16UL)
#define FLASH_SECBB1R1_SECBB16_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB16_Pos)           /*!< 0x00010000 */
#define FLASH_SECBB1R1_SECBB16                      FLASH_SECBB1R1_SECBB16_Msk                      /*!< Page 16 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB17_Pos                  (17UL)
#define FLASH_SECBB1R1_SECBB17_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB17_Pos)           /*!< 0x00020000 */
#define FLASH_SECBB1R1_SECBB17                      FLASH_SECBB1R1_SECBB17_Msk                      /*!< Page 17 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB18_Pos                  (18UL)
#define FLASH_SECBB1R1_SECBB18_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB18_Pos)           /*!< 0x00040000 */
#define FLASH_SECBB1R1_SECBB18                      FLASH_SECBB1R1_SECBB18_Msk                      /*!< Page 18 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB19_Pos                  (19UL)
#define FLASH_SECBB1R1_SECBB19_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB19_Pos)           /*!< 0x00080000 */
#define FLASH_SECBB1R1_SECBB19                      FLASH_SECBB1R1_SECBB19_Msk                      /*!< Page 19 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB20_Pos                  (20UL)
#define FLASH_SECBB1R1_SECBB20_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB20_Pos)           /*!< 0x00100000 */
#define FLASH_SECBB1R1_SECBB20                      FLASH_SECBB1R1_SECBB20_Msk                      /*!< Page 20 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB21_Pos                  (21UL)
#define FLASH_SECBB1R1_SECBB21_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB21_Pos)           /*!< 0x00200000 */
#define FLASH_SECBB1R1_SECBB21                      FLASH_SECBB1R1_SECBB21_Msk                      /*!< Page 21 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB22_Pos                  (22UL)
#define FLASH_SECBB1R1_SECBB22_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB22_Pos)           /*!< 0x00400000 */
#define FLASH_SECBB1R1_SECBB22                      FLASH_SECBB1R1_SECBB22_Msk                      /*!< Page 22 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB23_Pos                  (23UL)
#define FLASH_SECBB1R1_SECBB23_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB23_Pos)           /*!< 0x00800000 */
#define FLASH_SECBB1R1_SECBB23                      FLASH_SECBB1R1_SECBB23_Msk                      /*!< Page 23 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB24_Pos                  (24UL)
#define FLASH_SECBB1R1_SECBB24_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB24_Pos)           /*!< 0x01000000 */
#define FLASH_SECBB1R1_SECBB24                      FLASH_SECBB1R1_SECBB24_Msk                      /*!< Page 24 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB25_Pos                  (25UL)
#define FLASH_SECBB1R1_SECBB25_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB25_Pos)           /*!< 0x02000000 */
#define FLASH_SECBB1R1_SECBB25                      FLASH_SECBB1R1_SECBB25_Msk                      /*!< Page 25 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB26_Pos                  (26UL)
#define FLASH_SECBB1R1_SECBB26_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB26_Pos)           /*!< 0x04000000 */
#define FLASH_SECBB1R1_SECBB26                      FLASH_SECBB1R1_SECBB26_Msk                      /*!< Page 26 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB27_Pos                  (27UL)
#define FLASH_SECBB1R1_SECBB27_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB27_Pos)           /*!< 0x08000000 */
#define FLASH_SECBB1R1_SECBB27                      FLASH_SECBB1R1_SECBB27_Msk                      /*!< Page 27 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB28_Pos                  (28UL)
#define FLASH_SECBB1R1_SECBB28_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB28_Pos)           /*!< 0x10000000 */
#define FLASH_SECBB1R1_SECBB28                      FLASH_SECBB1R1_SECBB28_Msk                      /*!< Page 28 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB29_Pos                  (29UL)
#define FLASH_SECBB1R1_SECBB29_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB29_Pos)           /*!< 0x20000000 */
#define FLASH_SECBB1R1_SECBB29                      FLASH_SECBB1R1_SECBB29_Msk                      /*!< Page 29 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB30_Pos                  (30UL)
#define FLASH_SECBB1R1_SECBB30_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB30_Pos)           /*!< 0x40000000 */
#define FLASH_SECBB1R1_SECBB30                      FLASH_SECBB1R1_SECBB30_Msk                      /*!< Page 30 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R1_SECBB31_Pos                  (31UL)
#define FLASH_SECBB1R1_SECBB31_Msk                  (0x1UL << FLASH_SECBB1R1_SECBB31_Pos)           /*!< 0x80000000 */
#define FLASH_SECBB1R1_SECBB31                      FLASH_SECBB1R1_SECBB31_Msk                      /*!< Page 31 in Flash bank 1 block-based secure */

/*******************  Bit definition for FLASH_SECBB1R2 register  ******************/
#define FLASH_SECBB1R2_SECBB0_Pos                   (0UL)
#define FLASH_SECBB1R2_SECBB0_Msk                   (0x1UL << FLASH_SECBB1R2_SECBB0_Pos)            /*!< 0x00000001 */
#define FLASH_SECBB1R2_SECBB0                       FLASH_SECBB1R2_SECBB0_Msk                       /*!< Page 32 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB1_Pos                   (1UL)
#define FLASH_SECBB1R2_SECBB1_Msk                   (0x1UL << FLASH_SECBB1R2_SECBB1_Pos)            /*!< 0x00000002 */
#define FLASH_SECBB1R2_SECBB1                       FLASH_SECBB1R2_SECBB1_Msk                       /*!< Page 33 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB2_Pos                   (2UL)
#define FLASH_SECBB1R2_SECBB2_Msk                   (0x1UL << FLASH_SECBB1R2_SECBB2_Pos)            /*!< 0x00000004 */
#define FLASH_SECBB1R2_SECBB2                       FLASH_SECBB1R2_SECBB2_Msk                       /*!< Page 34 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB3_Pos                   (3UL)
#define FLASH_SECBB1R2_SECBB3_Msk                   (0x1UL << FLASH_SECBB1R2_SECBB3_Pos)            /*!< 0x00000008 */
#define FLASH_SECBB1R2_SECBB3                       FLASH_SECBB1R2_SECBB3_Msk                       /*!< Page 35 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB4_Pos                   (4UL)
#define FLASH_SECBB1R2_SECBB4_Msk                   (0x1UL << FLASH_SECBB1R2_SECBB4_Pos)            /*!< 0x00000010 */
#define FLASH_SECBB1R2_SECBB4                       FLASH_SECBB1R2_SECBB4_Msk                       /*!< Page 36 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB5_Pos                   (5UL)
#define FLASH_SECBB1R2_SECBB5_Msk                   (0x1UL << FLASH_SECBB1R2_SECBB5_Pos)            /*!< 0x00000020 */
#define FLASH_SECBB1R2_SECBB5                       FLASH_SECBB1R2_SECBB5_Msk                       /*!< Page 37 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB6_Pos                   (6UL)
#define FLASH_SECBB1R2_SECBB6_Msk                   (0x1UL << FLASH_SECBB1R2_SECBB6_Pos)            /*!< 0x00000040 */
#define FLASH_SECBB1R2_SECBB6                       FLASH_SECBB1R2_SECBB6_Msk                       /*!< Page 38 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB7_Pos                   (7UL)
#define FLASH_SECBB1R2_SECBB7_Msk                   (0x1UL << FLASH_SECBB1R2_SECBB7_Pos)            /*!< 0x00000080 */
#define FLASH_SECBB1R2_SECBB7                       FLASH_SECBB1R2_SECBB7_Msk                       /*!< Page 39 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB8_Pos                   (8UL)
#define FLASH_SECBB1R2_SECBB8_Msk                   (0x1UL << FLASH_SECBB1R2_SECBB8_Pos)            /*!< 0x00000100 */
#define FLASH_SECBB1R2_SECBB8                       FLASH_SECBB1R2_SECBB8_Msk                       /*!< Page 40 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB9_Pos                   (9UL)
#define FLASH_SECBB1R2_SECBB9_Msk                   (0x1UL << FLASH_SECBB1R2_SECBB9_Pos)            /*!< 0x00000200 */
#define FLASH_SECBB1R2_SECBB9                       FLASH_SECBB1R2_SECBB9_Msk                       /*!< Page 41 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB10_Pos                  (10UL)
#define FLASH_SECBB1R2_SECBB10_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB10_Pos)           /*!< 0x00000400 */
#define FLASH_SECBB1R2_SECBB10                      FLASH_SECBB1R2_SECBB10_Msk                      /*!< Page 42 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB11_Pos                  (11UL)
#define FLASH_SECBB1R2_SECBB11_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB11_Pos)           /*!< 0x00000800 */
#define FLASH_SECBB1R2_SECBB11                      FLASH_SECBB1R2_SECBB11_Msk                      /*!< Page 43 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB12_Pos                  (12UL)
#define FLASH_SECBB1R2_SECBB12_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB12_Pos)           /*!< 0x00001000 */
#define FLASH_SECBB1R2_SECBB12                      FLASH_SECBB1R2_SECBB12_Msk                      /*!< Page 44 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB13_Pos                  (13UL)
#define FLASH_SECBB1R2_SECBB13_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB13_Pos)           /*!< 0x00002000 */
#define FLASH_SECBB1R2_SECBB13                      FLASH_SECBB1R2_SECBB13_Msk                      /*!< Page 45 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB14_Pos                  (14UL)
#define FLASH_SECBB1R2_SECBB14_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB14_Pos)           /*!< 0x00004000 */
#define FLASH_SECBB1R2_SECBB14                      FLASH_SECBB1R2_SECBB14_Msk                      /*!< Page 46 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB15_Pos                  (15UL)
#define FLASH_SECBB1R2_SECBB15_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB15_Pos)           /*!< 0x00008000 */
#define FLASH_SECBB1R2_SECBB15                      FLASH_SECBB1R2_SECBB15_Msk                      /*!< Page 47 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB16_Pos                  (16UL)
#define FLASH_SECBB1R2_SECBB16_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB16_Pos)           /*!< 0x00010000 */
#define FLASH_SECBB1R2_SECBB16                      FLASH_SECBB1R2_SECBB16_Msk                      /*!< Page 48 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB17_Pos                  (17UL)
#define FLASH_SECBB1R2_SECBB17_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB17_Pos)           /*!< 0x00020000 */
#define FLASH_SECBB1R2_SECBB17                      FLASH_SECBB1R2_SECBB17_Msk                      /*!< Page 49 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB18_Pos                  (18UL)
#define FLASH_SECBB1R2_SECBB18_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB18_Pos)           /*!< 0x00040000 */
#define FLASH_SECBB1R2_SECBB18                      FLASH_SECBB1R2_SECBB18_Msk                      /*!< Page 50 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB19_Pos                  (19UL)
#define FLASH_SECBB1R2_SECBB19_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB19_Pos)           /*!< 0x00080000 */
#define FLASH_SECBB1R2_SECBB19                      FLASH_SECBB1R2_SECBB19_Msk                      /*!< Page 51 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB20_Pos                  (20UL)
#define FLASH_SECBB1R2_SECBB20_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB20_Pos)           /*!< 0x00100000 */
#define FLASH_SECBB1R2_SECBB20                      FLASH_SECBB1R2_SECBB20_Msk                      /*!< Page 52 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB21_Pos                  (21UL)
#define FLASH_SECBB1R2_SECBB21_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB21_Pos)           /*!< 0x00200000 */
#define FLASH_SECBB1R2_SECBB21                      FLASH_SECBB1R2_SECBB21_Msk                      /*!< Page 53 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB22_Pos                  (22UL)
#define FLASH_SECBB1R2_SECBB22_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB22_Pos)           /*!< 0x00400000 */
#define FLASH_SECBB1R2_SECBB22                      FLASH_SECBB1R2_SECBB22_Msk                      /*!< Page 54 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB23_Pos                  (23UL)
#define FLASH_SECBB1R2_SECBB23_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB23_Pos)           /*!< 0x00800000 */
#define FLASH_SECBB1R2_SECBB23                      FLASH_SECBB1R2_SECBB23_Msk                      /*!< Page 55 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB24_Pos                  (24UL)
#define FLASH_SECBB1R2_SECBB24_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB24_Pos)           /*!< 0x01000000 */
#define FLASH_SECBB1R2_SECBB24                      FLASH_SECBB1R2_SECBB24_Msk                      /*!< Page 56 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB25_Pos                  (25UL)
#define FLASH_SECBB1R2_SECBB25_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB25_Pos)           /*!< 0x02000000 */
#define FLASH_SECBB1R2_SECBB25                      FLASH_SECBB1R2_SECBB25_Msk                      /*!< Page 57 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB26_Pos                  (26UL)
#define FLASH_SECBB1R2_SECBB26_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB26_Pos)           /*!< 0x04000000 */
#define FLASH_SECBB1R2_SECBB26                      FLASH_SECBB1R2_SECBB26_Msk                      /*!< Page 58 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB27_Pos                  (27UL)
#define FLASH_SECBB1R2_SECBB27_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB27_Pos)           /*!< 0x08000000 */
#define FLASH_SECBB1R2_SECBB27                      FLASH_SECBB1R2_SECBB27_Msk                      /*!< Page 59 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB28_Pos                  (28UL)
#define FLASH_SECBB1R2_SECBB28_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB28_Pos)           /*!< 0x10000000 */
#define FLASH_SECBB1R2_SECBB28                      FLASH_SECBB1R2_SECBB28_Msk                      /*!< Page 60 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB29_Pos                  (29UL)
#define FLASH_SECBB1R2_SECBB29_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB29_Pos)           /*!< 0x20000000 */
#define FLASH_SECBB1R2_SECBB29                      FLASH_SECBB1R2_SECBB29_Msk                      /*!< Page 61 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB30_Pos                  (30UL)
#define FLASH_SECBB1R2_SECBB30_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB30_Pos)           /*!< 0x40000000 */
#define FLASH_SECBB1R2_SECBB30                      FLASH_SECBB1R2_SECBB30_Msk                      /*!< Page 62 in Flash bank 1 block-based secure */
#define FLASH_SECBB1R2_SECBB31_Pos                  (31UL)
#define FLASH_SECBB1R2_SECBB31_Msk                  (0x1UL << FLASH_SECBB1R2_SECBB31_Pos)           /*!< 0x80000000 */
#define FLASH_SECBB1R2_SECBB31                      FLASH_SECBB1R2_SECBB31_Msk                      /*!< Page 63 in Flash bank 1 block-based secure */

