STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/*******************  Bit definition for FLASH_SECBB2R2 register  ******************/
#define FLASH_SECBB2R2_SECBB0_Pos                   (0UL)
#define FLASH_SECBB2R2_SECBB0_Msk                   (0x1UL << FLASH_SECBB2R2_SECBB0_Pos)            /*!< 0x00000001 */
#define FLASH_SECBB2R2_SECBB0                       FLASH_SECBB2R2_SECBB0_Msk                       /*!< Page 32 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB1_Pos                   (1UL)
#define FLASH_SECBB2R2_SECBB1_Msk                   (0x1UL << FLASH_SECBB2R2_SECBB1_Pos)            /*!< 0x00000002 */
#define FLASH_SECBB2R2_SECBB1                       FLASH_SECBB2R2_SECBB1_Msk                       /*!< Page 33 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB2_Pos                   (2UL)
#define FLASH_SECBB2R2_SECBB2_Msk                   (0x1UL << FLASH_SECBB2R2_SECBB2_Pos)            /*!< 0x00000004 */
#define FLASH_SECBB2R2_SECBB2                       FLASH_SECBB2R2_SECBB2_Msk                       /*!< Page 34 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB3_Pos                   (3UL)
#define FLASH_SECBB2R2_SECBB3_Msk                   (0x1UL << FLASH_SECBB2R2_SECBB3_Pos)            /*!< 0x00000008 */
#define FLASH_SECBB2R2_SECBB3                       FLASH_SECBB2R2_SECBB3_Msk                       /*!< Page 35 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB4_Pos                   (4UL)
#define FLASH_SECBB2R2_SECBB4_Msk                   (0x1UL << FLASH_SECBB2R2_SECBB4_Pos)            /*!< 0x00000010 */
#define FLASH_SECBB2R2_SECBB4                       FLASH_SECBB2R2_SECBB4_Msk                       /*!< Page 36 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB5_Pos                   (5UL)
#define FLASH_SECBB2R2_SECBB5_Msk                   (0x1UL << FLASH_SECBB2R2_SECBB5_Pos)            /*!< 0x00000020 */
#define FLASH_SECBB2R2_SECBB5                       FLASH_SECBB2R2_SECBB5_Msk                       /*!< Page 37 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB6_Pos                   (6UL)
#define FLASH_SECBB2R2_SECBB6_Msk                   (0x1UL << FLASH_SECBB2R2_SECBB6_Pos)            /*!< 0x00000040 */
#define FLASH_SECBB2R2_SECBB6                       FLASH_SECBB2R2_SECBB6_Msk                       /*!< Page 38 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB7_Pos                   (7UL)
#define FLASH_SECBB2R2_SECBB7_Msk                   (0x1UL << FLASH_SECBB2R2_SECBB7_Pos)            /*!< 0x00000080 */
#define FLASH_SECBB2R2_SECBB7                       FLASH_SECBB2R2_SECBB7_Msk                       /*!< Page 39 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB8_Pos                   (8UL)
#define FLASH_SECBB2R2_SECBB8_Msk                   (0x1UL << FLASH_SECBB2R2_SECBB8_Pos)            /*!< 0x00000100 */
#define FLASH_SECBB2R2_SECBB8                       FLASH_SECBB2R2_SECBB8_Msk                       /*!< Page 40 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB9_Pos                   (9UL)
#define FLASH_SECBB2R2_SECBB9_Msk                   (0x1UL << FLASH_SECBB2R2_SECBB9_Pos)            /*!< 0x00000200 */
#define FLASH_SECBB2R2_SECBB9                       FLASH_SECBB2R2_SECBB9_Msk                       /*!< Page 41 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB10_Pos                  (10UL)
#define FLASH_SECBB2R2_SECBB10_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB10_Pos)           /*!< 0x00000400 */
#define FLASH_SECBB2R2_SECBB10                      FLASH_SECBB2R2_SECBB10_Msk                      /*!< Page 42 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB11_Pos                  (11UL)
#define FLASH_SECBB2R2_SECBB11_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB11_Pos)           /*!< 0x00000800 */
#define FLASH_SECBB2R2_SECBB11                      FLASH_SECBB2R2_SECBB11_Msk                      /*!< Page 43 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB12_Pos                  (12UL)
#define FLASH_SECBB2R2_SECBB12_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB12_Pos)           /*!< 0x00001000 */
#define FLASH_SECBB2R2_SECBB12                      FLASH_SECBB2R2_SECBB12_Msk                      /*!< Page 44 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB13_Pos                  (13UL)
#define FLASH_SECBB2R2_SECBB13_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB13_Pos)           /*!< 0x00002000 */
#define FLASH_SECBB2R2_SECBB13                      FLASH_SECBB2R2_SECBB13_Msk                      /*!< Page 45 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB14_Pos                  (14UL)
#define FLASH_SECBB2R2_SECBB14_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB14_Pos)           /*!< 0x00004000 */
#define FLASH_SECBB2R2_SECBB14                      FLASH_SECBB2R2_SECBB14_Msk                      /*!< Page 46 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB15_Pos                  (15UL)
#define FLASH_SECBB2R2_SECBB15_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB15_Pos)           /*!< 0x00008000 */
#define FLASH_SECBB2R2_SECBB15                      FLASH_SECBB2R2_SECBB15_Msk                      /*!< Page 47 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB16_Pos                  (16UL)
#define FLASH_SECBB2R2_SECBB16_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB16_Pos)           /*!< 0x00010000 */
#define FLASH_SECBB2R2_SECBB16                      FLASH_SECBB2R2_SECBB16_Msk                      /*!< Page 48 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB17_Pos                  (17UL)
#define FLASH_SECBB2R2_SECBB17_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB17_Pos)           /*!< 0x00020000 */
#define FLASH_SECBB2R2_SECBB17                      FLASH_SECBB2R2_SECBB17_Msk                      /*!< Page 49 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB18_Pos                  (18UL)
#define FLASH_SECBB2R2_SECBB18_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB18_Pos)           /*!< 0x00040000 */
#define FLASH_SECBB2R2_SECBB18                      FLASH_SECBB2R2_SECBB18_Msk                      /*!< Page 50 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB19_Pos                  (19UL)
#define FLASH_SECBB2R2_SECBB19_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB19_Pos)           /*!< 0x00080000 */
#define FLASH_SECBB2R2_SECBB19                      FLASH_SECBB2R2_SECBB19_Msk                      /*!< Page 51 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB20_Pos                  (20UL)
#define FLASH_SECBB2R2_SECBB20_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB20_Pos)           /*!< 0x00100000 */
#define FLASH_SECBB2R2_SECBB20                      FLASH_SECBB2R2_SECBB20_Msk                      /*!< Page 52 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB21_Pos                  (21UL)
#define FLASH_SECBB2R2_SECBB21_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB21_Pos)           /*!< 0x00200000 */
#define FLASH_SECBB2R2_SECBB21                      FLASH_SECBB2R2_SECBB21_Msk                      /*!< Page 53 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB22_Pos                  (22UL)
#define FLASH_SECBB2R2_SECBB22_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB22_Pos)           /*!< 0x00400000 */
#define FLASH_SECBB2R2_SECBB22                      FLASH_SECBB2R2_SECBB22_Msk                      /*!< Page 54 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB23_Pos                  (23UL)
#define FLASH_SECBB2R2_SECBB23_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB23_Pos)           /*!< 0x00800000 */
#define FLASH_SECBB2R2_SECBB23                      FLASH_SECBB2R2_SECBB23_Msk                      /*!< Page 55 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB24_Pos                  (24UL)
#define FLASH_SECBB2R2_SECBB24_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB24_Pos)           /*!< 0x01000000 */
#define FLASH_SECBB2R2_SECBB24                      FLASH_SECBB2R2_SECBB24_Msk                      /*!< Page 56 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB25_Pos                  (25UL)
#define FLASH_SECBB2R2_SECBB25_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB25_Pos)           /*!< 0x02000000 */
#define FLASH_SECBB2R2_SECBB25                      FLASH_SECBB2R2_SECBB25_Msk                      /*!< Page 57 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB26_Pos                  (26UL)
#define FLASH_SECBB2R2_SECBB26_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB26_Pos)           /*!< 0x04000000 */
#define FLASH_SECBB2R2_SECBB26                      FLASH_SECBB2R2_SECBB26_Msk                      /*!< Page 58 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB27_Pos                  (27UL)
#define FLASH_SECBB2R2_SECBB27_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB27_Pos)           /*!< 0x08000000 */
#define FLASH_SECBB2R2_SECBB27                      FLASH_SECBB2R2_SECBB27_Msk                      /*!< Page 59 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB28_Pos                  (28UL)
#define FLASH_SECBB2R2_SECBB28_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB28_Pos)           /*!< 0x10000000 */
#define FLASH_SECBB2R2_SECBB28                      FLASH_SECBB2R2_SECBB28_Msk                      /*!< Page 60 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB29_Pos                  (29UL)
#define FLASH_SECBB2R2_SECBB29_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB29_Pos)           /*!< 0x20000000 */
#define FLASH_SECBB2R2_SECBB29                      FLASH_SECBB2R2_SECBB29_Msk                      /*!< Page 61 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB30_Pos                  (30UL)
#define FLASH_SECBB2R2_SECBB30_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB30_Pos)           /*!< 0x40000000 */
#define FLASH_SECBB2R2_SECBB30                      FLASH_SECBB2R2_SECBB30_Msk                      /*!< Page 62 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R2_SECBB31_Pos                  (31UL)
#define FLASH_SECBB2R2_SECBB31_Msk                  (0x1UL << FLASH_SECBB2R2_SECBB31_Pos)           /*!< 0x80000000 */
#define FLASH_SECBB2R2_SECBB31                      FLASH_SECBB2R2_SECBB31_Msk                      /*!< Page 63 in Flash bank 2 block-based secure */

/*******************  Bit definition for FLASH_SECBB2R3 register  ******************/
#define FLASH_SECBB2R3_SECBB0_Pos                   (0UL)
#define FLASH_SECBB2R3_SECBB0_Msk                   (0x1UL << FLASH_SECBB2R3_SECBB0_Pos)            /*!< 0x00000001 */
#define FLASH_SECBB2R3_SECBB0                       FLASH_SECBB2R3_SECBB0_Msk                       /*!< Page 64 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB1_Pos                   (1UL)
#define FLASH_SECBB2R3_SECBB1_Msk                   (0x1UL << FLASH_SECBB2R3_SECBB1_Pos)            /*!< 0x00000002 */
#define FLASH_SECBB2R3_SECBB1                       FLASH_SECBB2R3_SECBB1_Msk                       /*!< Page 65 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB2_Pos                   (2UL)
#define FLASH_SECBB2R3_SECBB2_Msk                   (0x1UL << FLASH_SECBB2R3_SECBB2_Pos)            /*!< 0x00000004 */
#define FLASH_SECBB2R3_SECBB2                       FLASH_SECBB2R3_SECBB2_Msk                       /*!< Page 66 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB3_Pos                   (3UL)
#define FLASH_SECBB2R3_SECBB3_Msk                   (0x1UL << FLASH_SECBB2R3_SECBB3_Pos)            /*!< 0x00000008 */
#define FLASH_SECBB2R3_SECBB3                       FLASH_SECBB2R3_SECBB3_Msk                       /*!< Page 67 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB4_Pos                   (4UL)
#define FLASH_SECBB2R3_SECBB4_Msk                   (0x1UL << FLASH_SECBB2R3_SECBB4_Pos)            /*!< 0x00000010 */
#define FLASH_SECBB2R3_SECBB4                       FLASH_SECBB2R3_SECBB4_Msk                       /*!< Page 68 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB5_Pos                   (5UL)
#define FLASH_SECBB2R3_SECBB5_Msk                   (0x1UL << FLASH_SECBB2R3_SECBB5_Pos)            /*!< 0x00000020 */
#define FLASH_SECBB2R3_SECBB5                       FLASH_SECBB2R3_SECBB5_Msk                       /*!< Page 69 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB6_Pos                   (6UL)
#define FLASH_SECBB2R3_SECBB6_Msk                   (0x1UL << FLASH_SECBB2R3_SECBB6_Pos)            /*!< 0x00000040 */
#define FLASH_SECBB2R3_SECBB6                       FLASH_SECBB2R3_SECBB6_Msk                       /*!< Page 70 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB7_Pos                   (7UL)
#define FLASH_SECBB2R3_SECBB7_Msk                   (0x1UL << FLASH_SECBB2R3_SECBB7_Pos)            /*!< 0x00000080 */
#define FLASH_SECBB2R3_SECBB7                       FLASH_SECBB2R3_SECBB7_Msk                       /*!< Page 71 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB8_Pos                   (8UL)
#define FLASH_SECBB2R3_SECBB8_Msk                   (0x1UL << FLASH_SECBB2R3_SECBB8_Pos)            /*!< 0x00000100 */
#define FLASH_SECBB2R3_SECBB8                       FLASH_SECBB2R3_SECBB8_Msk                       /*!< Page 72 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB9_Pos                   (9UL)
#define FLASH_SECBB2R3_SECBB9_Msk                   (0x1UL << FLASH_SECBB2R3_SECBB9_Pos)            /*!< 0x00000200 */
#define FLASH_SECBB2R3_SECBB9                       FLASH_SECBB2R3_SECBB9_Msk                       /*!< Page 73 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB10_Pos                  (10UL)
#define FLASH_SECBB2R3_SECBB10_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB10_Pos)           /*!< 0x00000400 */
#define FLASH_SECBB2R3_SECBB10                      FLASH_SECBB2R3_SECBB10_Msk                      /*!< Page 74 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB11_Pos                  (11UL)
#define FLASH_SECBB2R3_SECBB11_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB11_Pos)           /*!< 0x00000800 */
#define FLASH_SECBB2R3_SECBB11                      FLASH_SECBB2R3_SECBB11_Msk                      /*!< Page 75 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB12_Pos                  (12UL)
#define FLASH_SECBB2R3_SECBB12_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB12_Pos)           /*!< 0x00001000 */
#define FLASH_SECBB2R3_SECBB12                      FLASH_SECBB2R3_SECBB12_Msk                      /*!< Page 76 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB13_Pos                  (13UL)
#define FLASH_SECBB2R3_SECBB13_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB13_Pos)           /*!< 0x00002000 */
#define FLASH_SECBB2R3_SECBB13                      FLASH_SECBB2R3_SECBB13_Msk                      /*!< Page 77 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB14_Pos                  (14UL)
#define FLASH_SECBB2R3_SECBB14_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB14_Pos)           /*!< 0x00004000 */
#define FLASH_SECBB2R3_SECBB14                      FLASH_SECBB2R3_SECBB14_Msk                      /*!< Page 78 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB15_Pos                  (15UL)
#define FLASH_SECBB2R3_SECBB15_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB15_Pos)           /*!< 0x00008000 */
#define FLASH_SECBB2R3_SECBB15                      FLASH_SECBB2R3_SECBB15_Msk                      /*!< Page 79 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB16_Pos                  (16UL)
#define FLASH_SECBB2R3_SECBB16_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB16_Pos)           /*!< 0x00010000 */
#define FLASH_SECBB2R3_SECBB16                      FLASH_SECBB2R3_SECBB16_Msk                      /*!< Page 80 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB17_Pos                  (17UL)
#define FLASH_SECBB2R3_SECBB17_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB17_Pos)           /*!< 0x00020000 */
#define FLASH_SECBB2R3_SECBB17                      FLASH_SECBB2R3_SECBB17_Msk                      /*!< Page 81 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB18_Pos                  (18UL)
#define FLASH_SECBB2R3_SECBB18_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB18_Pos)           /*!< 0x00040000 */
#define FLASH_SECBB2R3_SECBB18                      FLASH_SECBB2R3_SECBB18_Msk                      /*!< Page 82 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB19_Pos                  (19UL)
#define FLASH_SECBB2R3_SECBB19_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB19_Pos)           /*!< 0x00080000 */
#define FLASH_SECBB2R3_SECBB19                      FLASH_SECBB2R3_SECBB19_Msk                      /*!< Page 83 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB20_Pos                  (20UL)
#define FLASH_SECBB2R3_SECBB20_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB20_Pos)           /*!< 0x00100000 */
#define FLASH_SECBB2R3_SECBB20                      FLASH_SECBB2R3_SECBB20_Msk                      /*!< Page 84 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB21_Pos                  (21UL)
#define FLASH_SECBB2R3_SECBB21_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB21_Pos)           /*!< 0x00200000 */
#define FLASH_SECBB2R3_SECBB21                      FLASH_SECBB2R3_SECBB21_Msk                      /*!< Page 85 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB22_Pos                  (22UL)
#define FLASH_SECBB2R3_SECBB22_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB22_Pos)           /*!< 0x00400000 */
#define FLASH_SECBB2R3_SECBB22                      FLASH_SECBB2R3_SECBB22_Msk                      /*!< Page 86 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB23_Pos                  (23UL)
#define FLASH_SECBB2R3_SECBB23_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB23_Pos)           /*!< 0x00800000 */
#define FLASH_SECBB2R3_SECBB23                      FLASH_SECBB2R3_SECBB23_Msk                      /*!< Page 87 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB24_Pos                  (24UL)
#define FLASH_SECBB2R3_SECBB24_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB24_Pos)           /*!< 0x01000000 */
#define FLASH_SECBB2R3_SECBB24                      FLASH_SECBB2R3_SECBB24_Msk                      /*!< Page 88 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB25_Pos                  (25UL)
#define FLASH_SECBB2R3_SECBB25_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB25_Pos)           /*!< 0x02000000 */
#define FLASH_SECBB2R3_SECBB25                      FLASH_SECBB2R3_SECBB25_Msk                      /*!< Page 89 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB26_Pos                  (26UL)
#define FLASH_SECBB2R3_SECBB26_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB26_Pos)           /*!< 0x04000000 */
#define FLASH_SECBB2R3_SECBB26                      FLASH_SECBB2R3_SECBB26_Msk                      /*!< Page 90 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB27_Pos                  (27UL)
#define FLASH_SECBB2R3_SECBB27_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB27_Pos)           /*!< 0x08000000 */
#define FLASH_SECBB2R3_SECBB27                      FLASH_SECBB2R3_SECBB27_Msk                      /*!< Page 91 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB28_Pos                  (28UL)
#define FLASH_SECBB2R3_SECBB28_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB28_Pos)           /*!< 0x10000000 */
#define FLASH_SECBB2R3_SECBB28                      FLASH_SECBB2R3_SECBB28_Msk                      /*!< Page 92 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB29_Pos                  (29UL)
#define FLASH_SECBB2R3_SECBB29_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB29_Pos)           /*!< 0x20000000 */
#define FLASH_SECBB2R3_SECBB29                      FLASH_SECBB2R3_SECBB29_Msk                      /*!< Page 93 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB30_Pos                  (30UL)
#define FLASH_SECBB2R3_SECBB30_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB30_Pos)           /*!< 0x40000000 */
#define FLASH_SECBB2R3_SECBB30                      FLASH_SECBB2R3_SECBB30_Msk                      /*!< Page 94 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R3_SECBB31_Pos                  (31UL)
#define FLASH_SECBB2R3_SECBB31_Msk                  (0x1UL << FLASH_SECBB2R3_SECBB31_Pos)           /*!< 0x80000000 */
#define FLASH_SECBB2R3_SECBB31                      FLASH_SECBB2R3_SECBB31_Msk                      /*!< Page 95 in Flash bank 2 block-based secure */

