STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/*******************  Bit definition for FLASH_SECBB2R4 register  ******************/
#define FLASH_SECBB2R4_SECBB0_Pos                   (0UL)
#define FLASH_SECBB2R4_SECBB0_Msk                   (0x1UL << FLASH_SECBB2R4_SECBB0_Pos)            /*!< 0x00000001 */
#define FLASH_SECBB2R4_SECBB0                       FLASH_SECBB2R4_SECBB0_Msk                       /*!< Page 96 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB1_Pos                   (1UL)
#define FLASH_SECBB2R4_SECBB1_Msk                   (0x1UL << FLASH_SECBB2R4_SECBB1_Pos)            /*!< 0x00000002 */
#define FLASH_SECBB2R4_SECBB1                       FLASH_SECBB2R4_SECBB1_Msk                       /*!< Page 97 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB2_Pos                   (2UL)
#define FLASH_SECBB2R4_SECBB2_Msk                   (0x1UL << FLASH_SECBB2R4_SECBB2_Pos)            /*!< 0x00000004 */
#define FLASH_SECBB2R4_SECBB2                       FLASH_SECBB2R4_SECBB2_Msk                       /*!< Page 98 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB3_Pos                   (3UL)
#define FLASH_SECBB2R4_SECBB3_Msk                   (0x1UL << FLASH_SECBB2R4_SECBB3_Pos)            /*!< 0x00000008 */
#define FLASH_SECBB2R4_SECBB3                       FLASH_SECBB2R4_SECBB3_Msk                       /*!< Page 99 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB4_Pos                   (4UL)
#define FLASH_SECBB2R4_SECBB4_Msk                   (0x1UL << FLASH_SECBB2R4_SECBB4_Pos)            /*!< 0x00000010 */
#define FLASH_SECBB2R4_SECBB4                       FLASH_SECBB2R4_SECBB4_Msk                       /*!< Page 100 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB5_Pos                   (5UL)
#define FLASH_SECBB2R4_SECBB5_Msk                   (0x1UL << FLASH_SECBB2R4_SECBB5_Pos)            /*!< 0x00000020 */
#define FLASH_SECBB2R4_SECBB5                       FLASH_SECBB2R4_SECBB5_Msk                       /*!< Page 101 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB6_Pos                   (6UL)
#define FLASH_SECBB2R4_SECBB6_Msk                   (0x1UL << FLASH_SECBB2R4_SECBB6_Pos)            /*!< 0x00000040 */
#define FLASH_SECBB2R4_SECBB6                       FLASH_SECBB2R4_SECBB6_Msk                       /*!< Page 102 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB7_Pos                   (7UL)
#define FLASH_SECBB2R4_SECBB7_Msk                   (0x1UL << FLASH_SECBB2R4_SECBB7_Pos)            /*!< 0x00000080 */
#define FLASH_SECBB2R4_SECBB7                       FLASH_SECBB2R4_SECBB7_Msk                       /*!< Page 103 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB8_Pos                   (8UL)
#define FLASH_SECBB2R4_SECBB8_Msk                   (0x1UL << FLASH_SECBB2R4_SECBB8_Pos)            /*!< 0x00000100 */
#define FLASH_SECBB2R4_SECBB8                       FLASH_SECBB2R4_SECBB8_Msk                       /*!< Page 104 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB9_Pos                   (9UL)
#define FLASH_SECBB2R4_SECBB9_Msk                   (0x1UL << FLASH_SECBB2R4_SECBB9_Pos)            /*!< 0x00000200 */
#define FLASH_SECBB2R4_SECBB9                       FLASH_SECBB2R4_SECBB9_Msk                       /*!< Page 105 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB10_Pos                  (10UL)
#define FLASH_SECBB2R4_SECBB10_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB10_Pos)           /*!< 0x00000400 */
#define FLASH_SECBB2R4_SECBB10                      FLASH_SECBB2R4_SECBB10_Msk                      /*!< Page 106 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB11_Pos                  (11UL)
#define FLASH_SECBB2R4_SECBB11_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB11_Pos)           /*!< 0x00000800 */
#define FLASH_SECBB2R4_SECBB11                      FLASH_SECBB2R4_SECBB11_Msk                      /*!< Page 107 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB12_Pos                  (12UL)
#define FLASH_SECBB2R4_SECBB12_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB12_Pos)           /*!< 0x00001000 */
#define FLASH_SECBB2R4_SECBB12                      FLASH_SECBB2R4_SECBB12_Msk                      /*!< Page 108 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB13_Pos                  (13UL)
#define FLASH_SECBB2R4_SECBB13_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB13_Pos)           /*!< 0x00002000 */
#define FLASH_SECBB2R4_SECBB13                      FLASH_SECBB2R4_SECBB13_Msk                      /*!< Page 109 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB14_Pos                  (14UL)
#define FLASH_SECBB2R4_SECBB14_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB14_Pos)           /*!< 0x00004000 */
#define FLASH_SECBB2R4_SECBB14                      FLASH_SECBB2R4_SECBB14_Msk                      /*!< Page 110 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB15_Pos                  (15UL)
#define FLASH_SECBB2R4_SECBB15_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB15_Pos)           /*!< 0x00008000 */
#define FLASH_SECBB2R4_SECBB15                      FLASH_SECBB2R4_SECBB15_Msk                      /*!< Page 111 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB16_Pos                  (16UL)
#define FLASH_SECBB2R4_SECBB16_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB16_Pos)           /*!< 0x00010000 */
#define FLASH_SECBB2R4_SECBB16                      FLASH_SECBB2R4_SECBB16_Msk                      /*!< Page 112 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB17_Pos                  (17UL)
#define FLASH_SECBB2R4_SECBB17_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB17_Pos)           /*!< 0x00020000 */
#define FLASH_SECBB2R4_SECBB17                      FLASH_SECBB2R4_SECBB17_Msk                      /*!< Page 113 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB18_Pos                  (18UL)
#define FLASH_SECBB2R4_SECBB18_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB18_Pos)           /*!< 0x00040000 */
#define FLASH_SECBB2R4_SECBB18                      FLASH_SECBB2R4_SECBB18_Msk                      /*!< Page 114 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB19_Pos                  (19UL)
#define FLASH_SECBB2R4_SECBB19_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB19_Pos)           /*!< 0x00080000 */
#define FLASH_SECBB2R4_SECBB19                      FLASH_SECBB2R4_SECBB19_Msk                      /*!< Page 115 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB20_Pos                  (20UL)
#define FLASH_SECBB2R4_SECBB20_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB20_Pos)           /*!< 0x00100000 */
#define FLASH_SECBB2R4_SECBB20                      FLASH_SECBB2R4_SECBB20_Msk                      /*!< Page 116 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB21_Pos                  (21UL)
#define FLASH_SECBB2R4_SECBB21_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB21_Pos)           /*!< 0x00200000 */
#define FLASH_SECBB2R4_SECBB21                      FLASH_SECBB2R4_SECBB21_Msk                      /*!< Page 117 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB22_Pos                  (22UL)
#define FLASH_SECBB2R4_SECBB22_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB22_Pos)           /*!< 0x00400000 */
#define FLASH_SECBB2R4_SECBB22                      FLASH_SECBB2R4_SECBB22_Msk                      /*!< Page 118 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB23_Pos                  (23UL)
#define FLASH_SECBB2R4_SECBB23_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB23_Pos)           /*!< 0x00800000 */
#define FLASH_SECBB2R4_SECBB23                      FLASH_SECBB2R4_SECBB23_Msk                      /*!< Page 119 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB24_Pos                  (24UL)
#define FLASH_SECBB2R4_SECBB24_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB24_Pos)           /*!< 0x01000000 */
#define FLASH_SECBB2R4_SECBB24                      FLASH_SECBB2R4_SECBB24_Msk                      /*!< Page 120 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB25_Pos                  (25UL)
#define FLASH_SECBB2R4_SECBB25_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB25_Pos)           /*!< 0x02000000 */
#define FLASH_SECBB2R4_SECBB25                      FLASH_SECBB2R4_SECBB25_Msk                      /*!< Page 121 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB26_Pos                  (26UL)
#define FLASH_SECBB2R4_SECBB26_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB26_Pos)           /*!< 0x04000000 */
#define FLASH_SECBB2R4_SECBB26                      FLASH_SECBB2R4_SECBB26_Msk                      /*!< Page 122 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB27_Pos                  (27UL)
#define FLASH_SECBB2R4_SECBB27_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB27_Pos)           /*!< 0x08000000 */
#define FLASH_SECBB2R4_SECBB27                      FLASH_SECBB2R4_SECBB27_Msk                      /*!< Page 123 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB28_Pos                  (28UL)
#define FLASH_SECBB2R4_SECBB28_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB28_Pos)           /*!< 0x10000000 */
#define FLASH_SECBB2R4_SECBB28                      FLASH_SECBB2R4_SECBB28_Msk                      /*!< Page 124 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB29_Pos                  (29UL)
#define FLASH_SECBB2R4_SECBB29_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB29_Pos)           /*!< 0x20000000 */
#define FLASH_SECBB2R4_SECBB29                      FLASH_SECBB2R4_SECBB29_Msk                      /*!< Page 125 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB30_Pos                  (30UL)
#define FLASH_SECBB2R4_SECBB30_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB30_Pos)           /*!< 0x40000000 */
#define FLASH_SECBB2R4_SECBB30                      FLASH_SECBB2R4_SECBB30_Msk                      /*!< Page 126 in Flash bank 2 block-based secure */
#define FLASH_SECBB2R4_SECBB31_Pos                  (31UL)
#define FLASH_SECBB2R4_SECBB31_Msk                  (0x1UL << FLASH_SECBB2R4_SECBB31_Pos)           /*!< 0x80000000 */
#define FLASH_SECBB2R4_SECBB31                      FLASH_SECBB2R4_SECBB31_Msk                      /*!< Page 127 in Flash bank 2 block-based secure */
#else
/*******************  Bit definition for FLASH_SECBBR1 register  ******************/
#define FLASH_SECBBR1_SECBB0_Pos                   (0UL)
#define FLASH_SECBBR1_SECBB0_Msk                   (0x1UL << FLASH_SECBBR1_SECBB0_Pos)            /*!< 0x00000001 */
#define FLASH_SECBBR1_SECBB0                       FLASH_SECBBR1_SECBB0_Msk                       /*!< Page 0 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB1_Pos                   (1UL)
#define FLASH_SECBBR1_SECBB1_Msk                   (0x1UL << FLASH_SECBBR1_SECBB1_Pos)            /*!< 0x00000002 */
#define FLASH_SECBBR1_SECBB1                       FLASH_SECBBR1_SECBB1_Msk                       /*!< Page 1 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB2_Pos                   (2UL)
#define FLASH_SECBBR1_SECBB2_Msk                   (0x1UL << FLASH_SECBBR1_SECBB2_Pos)            /*!< 0x00000004 */
#define FLASH_SECBBR1_SECBB2                       FLASH_SECBBR1_SECBB2_Msk                       /*!< Page 2 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB3_Pos                   (3UL)
#define FLASH_SECBBR1_SECBB3_Msk                   (0x1UL << FLASH_SECBBR1_SECBB3_Pos)            /*!< 0x00000008 */
#define FLASH_SECBBR1_SECBB3                       FLASH_SECBBR1_SECBB3_Msk                       /*!< Page 3 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB4_Pos                   (4UL)
#define FLASH_SECBBR1_SECBB4_Msk                   (0x1UL << FLASH_SECBBR1_SECBB4_Pos)            /*!< 0x00000010 */
#define FLASH_SECBBR1_SECBB4                       FLASH_SECBBR1_SECBB4_Msk                       /*!< Page 4 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB5_Pos                   (5UL)
#define FLASH_SECBBR1_SECBB5_Msk                   (0x1UL << FLASH_SECBBR1_SECBB5_Pos)            /*!< 0x00000020 */
#define FLASH_SECBBR1_SECBB5                       FLASH_SECBBR1_SECBB5_Msk                       /*!< Page 5 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB6_Pos                   (6UL)
#define FLASH_SECBBR1_SECBB6_Msk                   (0x1UL << FLASH_SECBBR1_SECBB6_Pos)            /*!< 0x00000040 */
#define FLASH_SECBBR1_SECBB6                       FLASH_SECBBR1_SECBB6_Msk                       /*!< Page 6 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB7_Pos                   (7UL)
#define FLASH_SECBBR1_SECBB7_Msk                   (0x1UL << FLASH_SECBBR1_SECBB7_Pos)            /*!< 0x00000080 */
#define FLASH_SECBBR1_SECBB7                       FLASH_SECBBR1_SECBB7_Msk                       /*!< Page 7 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB8_Pos                   (8UL)
#define FLASH_SECBBR1_SECBB8_Msk                   (0x1UL << FLASH_SECBBR1_SECBB8_Pos)            /*!< 0x00000100 */
#define FLASH_SECBBR1_SECBB8                       FLASH_SECBBR1_SECBB8_Msk                       /*!< Page 8 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB9_Pos                   (9UL)
#define FLASH_SECBBR1_SECBB9_Msk                   (0x1UL << FLASH_SECBBR1_SECBB9_Pos)            /*!< 0x00000200 */
#define FLASH_SECBBR1_SECBB9                       FLASH_SECBBR1_SECBB9_Msk                       /*!< Page 9 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB10_Pos                  (10UL)
#define FLASH_SECBBR1_SECBB10_Msk                  (0x1UL << FLASH_SECBBR1_SECBB10_Pos)           /*!< 0x00000400 */
#define FLASH_SECBBR1_SECBB10                      FLASH_SECBBR1_SECBB10_Msk                      /*!< Page 10 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB11_Pos                  (11UL)
#define FLASH_SECBBR1_SECBB11_Msk                  (0x1UL << FLASH_SECBBR1_SECBB11_Pos)           /*!< 0x00000800 */
#define FLASH_SECBBR1_SECBB11                      FLASH_SECBBR1_SECBB11_Msk                      /*!< Page 11 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB12_Pos                  (12UL)
#define FLASH_SECBBR1_SECBB12_Msk                  (0x1UL << FLASH_SECBBR1_SECBB12_Pos)           /*!< 0x00001000 */
#define FLASH_SECBBR1_SECBB12                      FLASH_SECBBR1_SECBB12_Msk                      /*!< Page 12 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB13_Pos                  (13UL)
#define FLASH_SECBBR1_SECBB13_Msk                  (0x1UL << FLASH_SECBBR1_SECBB13_Pos)           /*!< 0x00002000 */
#define FLASH_SECBBR1_SECBB13                      FLASH_SECBBR1_SECBB13_Msk                      /*!< Page 13 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB14_Pos                  (14UL)
#define FLASH_SECBBR1_SECBB14_Msk                  (0x1UL << FLASH_SECBBR1_SECBB14_Pos)           /*!< 0x00004000 */
#define FLASH_SECBBR1_SECBB14                      FLASH_SECBBR1_SECBB14_Msk                      /*!< Page 14 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB15_Pos                  (15UL)
#define FLASH_SECBBR1_SECBB15_Msk                  (0x1UL << FLASH_SECBBR1_SECBB15_Pos)           /*!< 0x00008000 */
#define FLASH_SECBBR1_SECBB15                      FLASH_SECBBR1_SECBB15_Msk                      /*!< Page 15 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB16_Pos                  (16UL)
#define FLASH_SECBBR1_SECBB16_Msk                  (0x1UL << FLASH_SECBBR1_SECBB16_Pos)           /*!< 0x00010000 */
#define FLASH_SECBBR1_SECBB16                      FLASH_SECBBR1_SECBB16_Msk                      /*!< Page 16 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB17_Pos                  (17UL)
#define FLASH_SECBBR1_SECBB17_Msk                  (0x1UL << FLASH_SECBBR1_SECBB17_Pos)           /*!< 0x00020000 */
#define FLASH_SECBBR1_SECBB17                      FLASH_SECBBR1_SECBB17_Msk                      /*!< Page 17 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB18_Pos                  (18UL)
#define FLASH_SECBBR1_SECBB18_Msk                  (0x1UL << FLASH_SECBBR1_SECBB18_Pos)           /*!< 0x00040000 */
#define FLASH_SECBBR1_SECBB18                      FLASH_SECBBR1_SECBB18_Msk                      /*!< Page 18 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB19_Pos                  (19UL)
#define FLASH_SECBBR1_SECBB19_Msk                  (0x1UL << FLASH_SECBBR1_SECBB19_Pos)           /*!< 0x00080000 */
#define FLASH_SECBBR1_SECBB19                      FLASH_SECBBR1_SECBB19_Msk                      /*!< Page 19 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB20_Pos                  (20UL)
#define FLASH_SECBBR1_SECBB20_Msk                  (0x1UL << FLASH_SECBBR1_SECBB20_Pos)           /*!< 0x00100000 */
#define FLASH_SECBBR1_SECBB20                      FLASH_SECBBR1_SECBB20_Msk                      /*!< Page 20 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB21_Pos                  (21UL)
#define FLASH_SECBBR1_SECBB21_Msk                  (0x1UL << FLASH_SECBBR1_SECBB21_Pos)           /*!< 0x00200000 */
#define FLASH_SECBBR1_SECBB21                      FLASH_SECBBR1_SECBB21_Msk                      /*!< Page 21 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB22_Pos                  (22UL)
#define FLASH_SECBBR1_SECBB22_Msk                  (0x1UL << FLASH_SECBBR1_SECBB22_Pos)           /*!< 0x00400000 */
#define FLASH_SECBBR1_SECBB22                      FLASH_SECBBR1_SECBB22_Msk                      /*!< Page 22 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB23_Pos                  (23UL)
#define FLASH_SECBBR1_SECBB23_Msk                  (0x1UL << FLASH_SECBBR1_SECBB23_Pos)           /*!< 0x00800000 */
#define FLASH_SECBBR1_SECBB23                      FLASH_SECBBR1_SECBB23_Msk                      /*!< Page 23 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB24_Pos                  (24UL)
#define FLASH_SECBBR1_SECBB24_Msk                  (0x1UL << FLASH_SECBBR1_SECBB24_Pos)           /*!< 0x01000000 */
#define FLASH_SECBBR1_SECBB24                      FLASH_SECBBR1_SECBB24_Msk                      /*!< Page 24 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB25_Pos                  (25UL)
#define FLASH_SECBBR1_SECBB25_Msk                  (0x1UL << FLASH_SECBBR1_SECBB25_Pos)           /*!< 0x02000000 */
#define FLASH_SECBBR1_SECBB25                      FLASH_SECBBR1_SECBB25_Msk                      /*!< Page 25 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB26_Pos                  (26UL)
#define FLASH_SECBBR1_SECBB26_Msk                  (0x1UL << FLASH_SECBBR1_SECBB26_Pos)           /*!< 0x04000000 */
#define FLASH_SECBBR1_SECBB26                      FLASH_SECBBR1_SECBB26_Msk                      /*!< Page 26 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB27_Pos                  (27UL)
#define FLASH_SECBBR1_SECBB27_Msk                  (0x1UL << FLASH_SECBBR1_SECBB27_Pos)           /*!< 0x08000000 */
#define FLASH_SECBBR1_SECBB27                      FLASH_SECBBR1_SECBB27_Msk                      /*!< Page 27 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB28_Pos                  (28UL)
#define FLASH_SECBBR1_SECBB28_Msk                  (0x1UL << FLASH_SECBBR1_SECBB28_Pos)           /*!< 0x10000000 */
#define FLASH_SECBBR1_SECBB28                      FLASH_SECBBR1_SECBB28_Msk                      /*!< Page 28 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB29_Pos                  (29UL)
#define FLASH_SECBBR1_SECBB29_Msk                  (0x1UL << FLASH_SECBBR1_SECBB29_Pos)           /*!< 0x20000000 */
#define FLASH_SECBBR1_SECBB29                      FLASH_SECBBR1_SECBB29_Msk                      /*!< Page 29 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB30_Pos                  (30UL)
#define FLASH_SECBBR1_SECBB30_Msk                  (0x1UL << FLASH_SECBBR1_SECBB30_Pos)           /*!< 0x40000000 */
#define FLASH_SECBBR1_SECBB30                      FLASH_SECBBR1_SECBB30_Msk                      /*!< Page 30 in Flash block-based secure */
#define FLASH_SECBBR1_SECBB31_Pos                  (31UL)
#define FLASH_SECBBR1_SECBB31_Msk                  (0x1UL << FLASH_SECBBR1_SECBB31_Pos)           /*!< 0x80000000 */
#define FLASH_SECBBR1_SECBB31                      FLASH_SECBBR1_SECBB31_Msk                      /*!< Page 31 in Flash block-based secure */

