STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/*******************  Bit definition for FLASH_PRIVBB2R2 register  ******************/
#define FLASH_PRIVBB2R2_PRIVBB0_Pos                   (0UL)
#define FLASH_PRIVBB2R2_PRIVBB0_Msk                   (0x1UL << FLASH_PRIVBB2R2_PRIVBB0_Pos)            /*!< 0x00000001 */
#define FLASH_PRIVBB2R2_PRIVBB0                       FLASH_PRIVBB2R2_PRIVBB0_Msk                       /*!< Page 32 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB1_Pos                   (1UL)
#define FLASH_PRIVBB2R2_PRIVBB1_Msk                   (0x1UL << FLASH_PRIVBB2R2_PRIVBB1_Pos)            /*!< 0x00000002 */
#define FLASH_PRIVBB2R2_PRIVBB1                       FLASH_PRIVBB2R2_PRIVBB1_Msk                       /*!< Page 33 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB2_Pos                   (2UL)
#define FLASH_PRIVBB2R2_PRIVBB2_Msk                   (0x1UL << FLASH_PRIVBB2R2_PRIVBB2_Pos)            /*!< 0x00000004 */
#define FLASH_PRIVBB2R2_PRIVBB2                       FLASH_PRIVBB2R2_PRIVBB2_Msk                       /*!< Page 34 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB3_Pos                   (3UL)
#define FLASH_PRIVBB2R2_PRIVBB3_Msk                   (0x1UL << FLASH_PRIVBB2R2_PRIVBB3_Pos)            /*!< 0x00000008 */
#define FLASH_PRIVBB2R2_PRIVBB3                       FLASH_PRIVBB2R2_PRIVBB3_Msk                       /*!< Page 35 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB4_Pos                   (4UL)
#define FLASH_PRIVBB2R2_PRIVBB4_Msk                   (0x1UL << FLASH_PRIVBB2R2_PRIVBB4_Pos)            /*!< 0x00000010 */
#define FLASH_PRIVBB2R2_PRIVBB4                       FLASH_PRIVBB2R2_PRIVBB4_Msk                       /*!< Page 36 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB5_Pos                   (5UL)
#define FLASH_PRIVBB2R2_PRIVBB5_Msk                   (0x1UL << FLASH_PRIVBB2R2_PRIVBB5_Pos)            /*!< 0x00000020 */
#define FLASH_PRIVBB2R2_PRIVBB5                       FLASH_PRIVBB2R2_PRIVBB5_Msk                       /*!< Page 37 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB6_Pos                   (6UL)
#define FLASH_PRIVBB2R2_PRIVBB6_Msk                   (0x1UL << FLASH_PRIVBB2R2_PRIVBB6_Pos)            /*!< 0x00000040 */
#define FLASH_PRIVBB2R2_PRIVBB6                       FLASH_PRIVBB2R2_PRIVBB6_Msk                       /*!< Page 38 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB7_Pos                   (7UL)
#define FLASH_PRIVBB2R2_PRIVBB7_Msk                   (0x1UL << FLASH_PRIVBB2R2_PRIVBB7_Pos)            /*!< 0x00000080 */
#define FLASH_PRIVBB2R2_PRIVBB7                       FLASH_PRIVBB2R2_PRIVBB7_Msk                       /*!< Page 39 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB8_Pos                   (8UL)
#define FLASH_PRIVBB2R2_PRIVBB8_Msk                   (0x1UL << FLASH_PRIVBB2R2_PRIVBB8_Pos)            /*!< 0x00000100 */
#define FLASH_PRIVBB2R2_PRIVBB8                       FLASH_PRIVBB2R2_PRIVBB8_Msk                       /*!< Page 40 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB9_Pos                   (9UL)
#define FLASH_PRIVBB2R2_PRIVBB9_Msk                   (0x1UL << FLASH_PRIVBB2R2_PRIVBB9_Pos)            /*!< 0x00000200 */
#define FLASH_PRIVBB2R2_PRIVBB9                       FLASH_PRIVBB2R2_PRIVBB9_Msk                       /*!< Page 41 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB10_Pos                  (10UL)
#define FLASH_PRIVBB2R2_PRIVBB10_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB10_Pos)           /*!< 0x00000400 */
#define FLASH_PRIVBB2R2_PRIVBB10                      FLASH_PRIVBB2R2_PRIVBB10_Msk                      /*!< Page 42 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB11_Pos                  (11UL)
#define FLASH_PRIVBB2R2_PRIVBB11_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB11_Pos)           /*!< 0x00000800 */
#define FLASH_PRIVBB2R2_PRIVBB11                      FLASH_PRIVBB2R2_PRIVBB11_Msk                      /*!< Page 43 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB12_Pos                  (12UL)
#define FLASH_PRIVBB2R2_PRIVBB12_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB12_Pos)           /*!< 0x00001000 */
#define FLASH_PRIVBB2R2_PRIVBB12                      FLASH_PRIVBB2R2_PRIVBB12_Msk                      /*!< Page 44 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB13_Pos                  (13UL)
#define FLASH_PRIVBB2R2_PRIVBB13_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB13_Pos)           /*!< 0x00002000 */
#define FLASH_PRIVBB2R2_PRIVBB13                      FLASH_PRIVBB2R2_PRIVBB13_Msk                      /*!< Page 45 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB14_Pos                  (14UL)
#define FLASH_PRIVBB2R2_PRIVBB14_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB14_Pos)           /*!< 0x00004000 */
#define FLASH_PRIVBB2R2_PRIVBB14                      FLASH_PRIVBB2R2_PRIVBB14_Msk                      /*!< Page 46 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB15_Pos                  (15UL)
#define FLASH_PRIVBB2R2_PRIVBB15_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB15_Pos)           /*!< 0x00008000 */
#define FLASH_PRIVBB2R2_PRIVBB15                      FLASH_PRIVBB2R2_PRIVBB15_Msk                      /*!< Page 47 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB16_Pos                  (16UL)
#define FLASH_PRIVBB2R2_PRIVBB16_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB16_Pos)           /*!< 0x00010000 */
#define FLASH_PRIVBB2R2_PRIVBB16                      FLASH_PRIVBB2R2_PRIVBB16_Msk                      /*!< Page 48 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB17_Pos                  (17UL)
#define FLASH_PRIVBB2R2_PRIVBB17_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB17_Pos)           /*!< 0x00020000 */
#define FLASH_PRIVBB2R2_PRIVBB17                      FLASH_PRIVBB2R2_PRIVBB17_Msk                      /*!< Page 49 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB18_Pos                  (18UL)
#define FLASH_PRIVBB2R2_PRIVBB18_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB18_Pos)           /*!< 0x00040000 */
#define FLASH_PRIVBB2R2_PRIVBB18                      FLASH_PRIVBB2R2_PRIVBB18_Msk                      /*!< Page 50 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB19_Pos                  (19UL)
#define FLASH_PRIVBB2R2_PRIVBB19_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB19_Pos)           /*!< 0x00080000 */
#define FLASH_PRIVBB2R2_PRIVBB19                      FLASH_PRIVBB2R2_PRIVBB19_Msk                      /*!< Page 51 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB20_Pos                  (20UL)
#define FLASH_PRIVBB2R2_PRIVBB20_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB20_Pos)           /*!< 0x00100000 */
#define FLASH_PRIVBB2R2_PRIVBB20                      FLASH_PRIVBB2R2_PRIVBB20_Msk                      /*!< Page 52 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB21_Pos                  (21UL)
#define FLASH_PRIVBB2R2_PRIVBB21_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB21_Pos)           /*!< 0x00200000 */
#define FLASH_PRIVBB2R2_PRIVBB21                      FLASH_PRIVBB2R2_PRIVBB21_Msk                      /*!< Page 53 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB22_Pos                  (22UL)
#define FLASH_PRIVBB2R2_PRIVBB22_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB22_Pos)           /*!< 0x00400000 */
#define FLASH_PRIVBB2R2_PRIVBB22                      FLASH_PRIVBB2R2_PRIVBB22_Msk                      /*!< Page 54 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB23_Pos                  (23UL)
#define FLASH_PRIVBB2R2_PRIVBB23_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB23_Pos)           /*!< 0x00800000 */
#define FLASH_PRIVBB2R2_PRIVBB23                      FLASH_PRIVBB2R2_PRIVBB23_Msk                      /*!< Page 55 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB24_Pos                  (24UL)
#define FLASH_PRIVBB2R2_PRIVBB24_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB24_Pos)           /*!< 0x01000000 */
#define FLASH_PRIVBB2R2_PRIVBB24                      FLASH_PRIVBB2R2_PRIVBB24_Msk                      /*!< Page 56 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB25_Pos                  (25UL)
#define FLASH_PRIVBB2R2_PRIVBB25_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB25_Pos)           /*!< 0x02000000 */
#define FLASH_PRIVBB2R2_PRIVBB25                      FLASH_PRIVBB2R2_PRIVBB25_Msk                      /*!< Page 57 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB26_Pos                  (26UL)
#define FLASH_PRIVBB2R2_PRIVBB26_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB26_Pos)           /*!< 0x04000000 */
#define FLASH_PRIVBB2R2_PRIVBB26                      FLASH_PRIVBB2R2_PRIVBB26_Msk                      /*!< Page 58 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB27_Pos                  (27UL)
#define FLASH_PRIVBB2R2_PRIVBB27_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB27_Pos)           /*!< 0x08000000 */
#define FLASH_PRIVBB2R2_PRIVBB27                      FLASH_PRIVBB2R2_PRIVBB27_Msk                      /*!< Page 59 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB28_Pos                  (28UL)
#define FLASH_PRIVBB2R2_PRIVBB28_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB28_Pos)           /*!< 0x10000000 */
#define FLASH_PRIVBB2R2_PRIVBB28                      FLASH_PRIVBB2R2_PRIVBB28_Msk                      /*!< Page 60 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB29_Pos                  (29UL)
#define FLASH_PRIVBB2R2_PRIVBB29_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB29_Pos)           /*!< 0x20000000 */
#define FLASH_PRIVBB2R2_PRIVBB29                      FLASH_PRIVBB2R2_PRIVBB29_Msk                      /*!< Page 61 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB30_Pos                  (30UL)
#define FLASH_PRIVBB2R2_PRIVBB30_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB30_Pos)           /*!< 0x40000000 */
#define FLASH_PRIVBB2R2_PRIVBB30                      FLASH_PRIVBB2R2_PRIVBB30_Msk                      /*!< Page 62 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R2_PRIVBB31_Pos                  (31UL)
#define FLASH_PRIVBB2R2_PRIVBB31_Msk                  (0x1UL << FLASH_PRIVBB2R2_PRIVBB31_Pos)           /*!< 0x80000000 */
#define FLASH_PRIVBB2R2_PRIVBB31                      FLASH_PRIVBB2R2_PRIVBB31_Msk                      /*!< Page 63 in Flash bank 2 only accessible by privileged access */

