STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/*******************  Bits definition for GTZC_TZIC_IER4 register  ***************/
#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define GTZC_CFGR4_LPDMA1_Pos               GTZC_TZIC_IER4_LPDMA1IE_Pos
#define GTZC_CFGR4_LPDMA1_Msk               (0x01UL << GTZC_CFGR4_LPDMA1_Pos)
#else /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_CFGR4_GPDMA1_Pos               GTZC_TZIC_IER4_GPDMA1IE_Pos
#define GTZC_CFGR4_GPDMA1_Msk               (0x01UL << GTZC_CFGR4_GPDMA1_Pos)
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_CFGR4_FLASH_Pos                GTZC_TZIC_IER4_FLASHIE_Pos
#define GTZC_CFGR4_FLASH_Msk                (0x01UL << GTZC_CFGR4_FLASH_Pos)
#define GTZC_CFGR4_FLASH_REG_Pos            GTZC_TZIC_IER4_FLASH_REGIE_Pos
#define GTZC_CFGR4_FLASH_REG_Msk            (0x01UL << GTZC_CFGR4_FLASH_REG_Pos)
#define GTZC_CFGR4_TZSC_Pos                 GTZC_TZIC_IER4_TZSCIE_Pos
#define GTZC_CFGR4_TZSC_Msk                 (0x01UL << GTZC_CFGR4_TZSC_Pos)
#define GTZC_CFGR4_TZIC_Pos                 GTZC_TZIC_IER4_TZICIE_Pos
#define GTZC_CFGR4_TZIC_Msk                 (0x01UL << GTZC_CFGR4_TZIC_Pos)
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define GTZC_CFGR4_OTFDEC1_Pos              GTZC_TZIC_IER4_OTFDEC1IE_Pos
#define GTZC_CFGR4_OTFDEC1_Msk              (0x01UL << GTZC_CFGR4_OTFDEC1_Pos)
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_CFGR4_SYSCFG_Pos               GTZC_TZIC_IER4_SYSCFGIE_Pos
#define GTZC_CFGR4_SYSCFG_Msk               (0x01UL << GTZC_CFGR4_SYSCFG_Pos)
#define GTZC_CFGR4_RTC_Pos                  GTZC_TZIC_IER4_RTCIE_Pos
#define GTZC_CFGR4_RTC_Msk                  (0x01UL << GTZC_CFGR4_RTC_Pos)
#define GTZC_CFGR4_TAMP_Pos                 GTZC_TZIC_IER4_TAMPIE_Pos
#define GTZC_CFGR4_TAMP_Msk                 (0x01UL << GTZC_CFGR4_TAMP_Pos)
#define GTZC_CFGR4_PWR_Pos                  GTZC_TZIC_IER4_PWRIE_Pos
#define GTZC_CFGR4_PWR_Msk                  (0x01UL << GTZC_CFGR4_PWR_Pos)
#define GTZC_CFGR4_RCC_Pos                  GTZC_TZIC_IER4_RCCIE_Pos
#define GTZC_CFGR4_RCC_sk                   (0x01UL << GTZC_CFGR4_RCC_Pos)
#define GTZC_CFGR4_EXTI_Pos                 GTZC_TZIC_IER4_EXTIIE_Pos
#define GTZC_CFGR4_EXTI_Msk                 (0x01UL << GTZC_CFGR4_EXTI_Pos)
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define GTZC_CFGR4_MPCWM1_REG_Pos           GTZC_TZIC_IER4_MPCWM1IE_Pos
#define GTZC_CFGR4_MPCWM1_REG_Msk           (0x01UL << GTZC_CFGR4_MPCWM1_REG_Pos)
#endif /* defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_CFGR4_SRAM1_Pos                GTZC_TZIC_IER4_SRAM1IE_Pos
#define GTZC_CFGR4_SRAM1_Msk                (0x01UL << GTZC_CFGR4_SRAM1_Pos)
#define GTZC_CFGR4_MPCBB1_REG_Pos           GTZC_TZIC_IER4_MPCBB1IE_Pos
#define GTZC_CFGR4_MPCBB1_REG_Msk           (0x01UL << GTZC_CFGR4_MPCBB1_REG_Pos)
#define GTZC_CFGR4_SRAM2_Pos                GTZC_TZIC_IER4_SRAM2IE_Pos
#define GTZC_CFGR4_SRAM2_Msk                (0x01UL << GTZC_CFGR4_SRAM2_Pos)
#define GTZC_CFGR4_MPCBB2_REG_Pos           GTZC_TZIC_IER4_MPCBB2IE_Pos
#define GTZC_CFGR4_MPCBB2_REG_Msk           (0x01UL << GTZC_CFGR4_MPCBB2_REG_Pos)
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_CFGR4_SRAM6_Pos                GTZC_TZIC_IER4_SRAM6IE_Pos
#define GTZC_CFGR4_SRAM6_Msk                (0x01UL << GTZC_CFGR4_SRAM6_Pos)
#define GTZC_CFGR4_MPCBB6_REG_Pos           GTZC_TZIC_IER4_MPCBB6IE_Pos
#define GTZC_CFGR4_MPCBB6_REG_Msk           (0x01UL << GTZC_CFGR4_MPCBB6_REG_Pos)
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */

/***************  Bits definition for register x=1 (GTZC_TZSC_SECCFGR1) *************/
#define GTZC_TZSC_SECCFGR1_TIM2SEC_Pos              (0UL)
#define GTZC_TZSC_SECCFGR1_TIM2SEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR1_TIM2SEC_Pos)
#define GTZC_TZSC_SECCFGR1_TIM2SEC                  GTZC_TZSC_SECCFGR1_TIM2SEC_Msk               /*!<  secure access mode for TIM2 */
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZSC_SECCFGR1_TIM3SEC_Pos              (1UL)
#define GTZC_TZSC_SECCFGR1_TIM3SEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR1_TIM3SEC_Pos)
#define GTZC_TZSC_SECCFGR1_TIM3SEC                  GTZC_TZSC_SECCFGR1_TIM3SEC_Msk               /*!<  secure access mode for TIM3 */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZSC_SECCFGR1_TIM4SEC_Pos              (2UL)
#define GTZC_TZSC_SECCFGR1_TIM4SEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR1_TIM4SEC_Pos)
#define GTZC_TZSC_SECCFGR1_TIM4SEC                  GTZC_TZSC_SECCFGR1_TIM4SEC_Msk               /*!<  secure access mode for TIM4 */
#endif
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZSC_SECCFGR1_WWDGSEC_Pos              (6UL)
#define GTZC_TZSC_SECCFGR1_WWDGSEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR1_WWDGSEC_Pos)
#define GTZC_TZSC_SECCFGR1_WWDGSEC                  GTZC_TZSC_SECCFGR1_WWDGSEC_Msk               /*!<  secure access mode for WWDG */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define GTZC_TZSC_SECCFGR1_IWDGSEC_Pos              (7UL)
#define GTZC_TZSC_SECCFGR1_IWDGSEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR1_IWDGSEC_Pos)
#define GTZC_TZSC_SECCFGR1_IWDGSEC                  GTZC_TZSC_SECCFGR1_IWDGSEC_Msk               /*!<  secure access mode for IWDG */
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZSC_SECCFGR1_SPI2SEC_Pos              (8UL)
#define GTZC_TZSC_SECCFGR1_SPI2SEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR1_SPI2SEC_Pos)
#define GTZC_TZSC_SECCFGR1_SPI2SEC                  GTZC_TZSC_SECCFGR1_SPI2SEC_Msk               /*!<  secure access mode for IWDG */
#endif
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZSC_SECCFGR1_USART2SEC_Pos            (9UL)
#define GTZC_TZSC_SECCFGR1_USART2SEC_Msk            (0x01UL << GTZC_TZSC_SECCFGR1_USART2SEC_Pos)
#define GTZC_TZSC_SECCFGR1_USART2SEC                GTZC_TZSC_SECCFGR1_USART2SEC_Msk             /*!<  secure access mode for USART2 */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZSC_SECCFGR1_USART3SEC_Pos            (10UL)
#define GTZC_TZSC_SECCFGR1_USART3SEC_Msk            (0x01UL << GTZC_TZSC_SECCFGR1_USART3SEC_Pos)
#define GTZC_TZSC_SECCFGR1_USART3SEC                GTZC_TZSC_SECCFGR1_USART3SEC_Msk             /*!<  secure access mode for USART3 */
#endif
#define GTZC_TZSC_SECCFGR1_I2C1SEC_Pos              (13UL)
#define GTZC_TZSC_SECCFGR1_I2C1SEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR1_I2C1SEC_Pos)
#define GTZC_TZSC_SECCFGR1_I2C1SEC                  GTZC_TZSC_SECCFGR1_I2C1SEC_Msk               /*!<  secure access mode for I2C1 */
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZSC_SECCFGR1_I2C2SEC_Pos              (14UL)
#define GTZC_TZSC_SECCFGR1_I2C2SEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR1_I2C2SEC_Pos)
#define GTZC_TZSC_SECCFGR1_I2C2SEC                  GTZC_TZSC_SECCFGR1_I2C2SEC_Msk               /*!<  secure access mode for I2C2 */
#define GTZC_TZSC_SECCFGR1_I2C4SEC_Pos              (16UL)
#define GTZC_TZSC_SECCFGR1_I2C4SEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR1_I2C4SEC_Pos)
#define GTZC_TZSC_SECCFGR1_I2C4SEC                  GTZC_TZSC_SECCFGR1_I2C4SEC_Msk               /*!<  secure access mode for I2C4 */
#endif
#if !defined (STM32WBA20xx)
#define GTZC_TZSC_SECCFGR1_LPTIM2SEC_Pos            (17UL)
#define GTZC_TZSC_SECCFGR1_LPTIM2SEC_Msk            (0x01UL << GTZC_TZSC_SECCFGR1_LPTIM2SEC_Pos)
#define GTZC_TZSC_SECCFGR1_LPTIM2SEC                GTZC_TZSC_SECCFGR1_LPTIM2SEC_Msk             /*!<  secure access mode for LPTIM2 */
#endif /* !defined (STM32WBA20xx) */

/***************  Bits definition for register x=2 (GTZC_TZSC_SECCFGR2) *************/
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZSC_SECCFGR2_TIM1SEC_Pos              (0UL)
#define GTZC_TZSC_SECCFGR2_TIM1SEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR2_TIM1SEC_Pos)
#define GTZC_TZSC_SECCFGR2_TIM1SEC                  GTZC_TZSC_SECCFGR2_TIM1SEC_Msk               /*!<  secure access mode for TIM1 */
#define GTZC_TZSC_SECCFGR2_SPI1SEC_Pos              (1UL)
#define GTZC_TZSC_SECCFGR2_SPI1SEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR2_SPI1SEC_Pos)
#define GTZC_TZSC_SECCFGR2_SPI1SEC                  GTZC_TZSC_SECCFGR2_SPI1SEC_Msk               /*!<  secure access mode for SPI1 */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define GTZC_TZSC_SECCFGR2_USART1SEC_Pos            (3UL)
#define GTZC_TZSC_SECCFGR2_USART1SEC_Msk            (0x01UL << GTZC_TZSC_SECCFGR2_USART1SEC_Pos)
#define GTZC_TZSC_SECCFGR2_USART1SEC                GTZC_TZSC_SECCFGR2_USART1SEC_Msk             /*!<  secure access mode for USART1 */
#define GTZC_TZSC_SECCFGR2_TIM16SEC_Pos             (5UL)
#define GTZC_TZSC_SECCFGR2_TIM16SEC_Msk             (0x01UL << GTZC_TZSC_SECCFGR2_TIM16SEC_Pos)
#define GTZC_TZSC_SECCFGR2_TIM16SEC                 GTZC_TZSC_SECCFGR2_TIM16SEC_Msk              /*!<  secure access mode for TIM16 */
#if !defined (STM32WBA20xx)
#define GTZC_TZSC_SECCFGR2_TIM17SEC_Pos             (6UL)
#define GTZC_TZSC_SECCFGR2_TIM17SEC_Msk             (0x01UL << GTZC_TZSC_SECCFGR2_TIM17SEC_Pos)
#define GTZC_TZSC_SECCFGR2_TIM17SEC                 GTZC_TZSC_SECCFGR2_TIM17SEC_Msk              /*!<  secure access mode for TIM17 */
#endif /* !defined (STM32WBA20xx) */
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZSC_SECCFGR2_SAI1SEC_Pos              (7UL)
#define GTZC_TZSC_SECCFGR2_SAI1SEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR2_SAI1SEC_Pos)
#define GTZC_TZSC_SECCFGR2_SAI1SEC                  GTZC_TZSC_SECCFGR2_SAI1SEC_Msk               /*!<  secure access mode for SAI1 */
#endif
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define GTZC_TZSC_SECCFGR2_USB1SEC_Pos              (15UL)
#define GTZC_TZSC_SECCFGR2_USB1SEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR2_USB1SEC_Pos)
#define GTZC_TZSC_SECCFGR2_USB1SEC                  GTZC_TZSC_SECCFGR2_USB1SEC_Msk               /*!<  secure access mode for USB */
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_TZSC_SECCFGR2_SPI3SEC_Pos              (16UL)
#define GTZC_TZSC_SECCFGR2_SPI3SEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR2_SPI3SEC_Pos)
#define GTZC_TZSC_SECCFGR2_SPI3SEC                  GTZC_TZSC_SECCFGR2_SPI3SEC_Msk               /*!<  secure access mode for SPI3 */
#define GTZC_TZSC_SECCFGR2_LPUART1SEC_Pos           (17UL)
#define GTZC_TZSC_SECCFGR2_LPUART1SEC_Msk           (0x01UL << GTZC_TZSC_SECCFGR2_LPUART1SEC_Pos)
#define GTZC_TZSC_SECCFGR2_LPUART1SEC               GTZC_TZSC_SECCFGR2_LPUART1SEC_Msk            /*!<  secure access mode for LPUART1 */
#define GTZC_TZSC_SECCFGR2_I2C3SEC_Pos              (18UL)
#define GTZC_TZSC_SECCFGR2_I2C3SEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR2_I2C3SEC_Pos)
#define GTZC_TZSC_SECCFGR2_I2C3SEC                  GTZC_TZSC_SECCFGR2_I2C3SEC_Msk               /*!<  secure access mode for I2C3 */
#define GTZC_TZSC_SECCFGR2_LPTIM1SEC_Pos            (19UL)
#define GTZC_TZSC_SECCFGR2_LPTIM1SEC_Msk            (0x01UL << GTZC_TZSC_SECCFGR2_LPTIM1SEC_Pos)
#define GTZC_TZSC_SECCFGR2_LPTIM1SEC                GTZC_TZSC_SECCFGR2_LPTIM1SEC_Msk             /*!<  secure access mode for LPTIM1 */
#if defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZSC_SECCFGR2_COMPSEC_Pos              (23UL)
#define GTZC_TZSC_SECCFGR2_COMPSEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR2_COMPSEC_Pos)
#define GTZC_TZSC_SECCFGR2_COMPSEC                  GTZC_TZSC_SECCFGR2_COMPSEC_Msk               /*!<  secure access mode for COMP */
#endif
#define GTZC_TZSC_SECCFGR2_ADC4SEC_Pos              (24UL)
#define GTZC_TZSC_SECCFGR2_ADC4SEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR2_ADC4SEC_Pos)
#define GTZC_TZSC_SECCFGR2_ADC4SEC                  GTZC_TZSC_SECCFGR2_ADC4SEC_Msk               /*!<  secure access mode for ADC4 */
#if defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZSC_SECCFGR2_VREFBUFSEC_Pos           (25UL)
#define GTZC_TZSC_SECCFGR2_VREFBUFSEC_Msk           (0x01UL << GTZC_TZSC_SECCFGR2_VREFBUFSEC_Pos)
#define GTZC_TZSC_SECCFGR2_VREFBUFSEC               GTZC_TZSC_SECCFGR2_VREFBUFSEC_Msk            /*!<  secure access mode for VREFBUF */
#endif

/***************  Bits definition for register x=3 (GTZC_TZSC_SECCFGR3) *************/
#define GTZC_TZSC_SECCFGR3_CRCSEC_Pos               (3UL)
#define GTZC_TZSC_SECCFGR3_CRCSEC_Msk               (0x01UL << GTZC_TZSC_SECCFGR3_CRCSEC_Pos)
#define GTZC_TZSC_SECCFGR3_CRCSEC                   GTZC_TZSC_SECCFGR3_CRCSEC_Msk                /*!<  secure access mode for CRC */
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZSC_SECCFGR3_TSCSEC_Pos               (4UL)
#define GTZC_TZSC_SECCFGR3_TSCSEC_Msk               (0x01UL << GTZC_TZSC_SECCFGR3_TSCSEC_Pos)
#define GTZC_TZSC_SECCFGR3_TSCSEC                   GTZC_TZSC_SECCFGR3_TSCSEC_Msk                /*!<  secure access mode for TSC */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define GTZC_TZSC_SECCFGR3_ICACHE_REGSEC_Pos        (6UL)
#define GTZC_TZSC_SECCFGR3_ICACHE_REGSEC_Msk        (0x01UL << GTZC_TZSC_SECCFGR3_ICACHE_REGSEC_Pos)
#define GTZC_TZSC_SECCFGR3_ICACHE_REGSEC            GTZC_TZSC_SECCFGR3_ICACHE_REGSEC_Msk         /*!<  secure access mode for ICACHE_REG */
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZSC_SECCFGR3_OTGSEC_Pos               (10UL)
#define GTZC_TZSC_SECCFGR3_OTGSEC_Msk               (0x01UL << GTZC_TZSC_SECCFGR3_OTGSEC_Pos)
#define GTZC_TZSC_SECCFGR3_OTGSEC                   GTZC_TZSC_SECCFGR3_OTGSEC_Msk                /*!<  secure access mode for OTG */
#endif
#define GTZC_TZSC_SECCFGR3_AESSEC_Pos               (11UL)
#define GTZC_TZSC_SECCFGR3_AESSEC_Msk               (0x01UL << GTZC_TZSC_SECCFGR3_AESSEC_Pos)
#define GTZC_TZSC_SECCFGR3_AESSEC                   GTZC_TZSC_SECCFGR3_AESSEC_Msk                /*!<  secure access mode for AES */
#define GTZC_TZSC_SECCFGR3_HASHSEC_Pos              (12UL)
#define GTZC_TZSC_SECCFGR3_HASHSEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR3_HASHSEC_Pos)
#define GTZC_TZSC_SECCFGR3_HASHSEC                  GTZC_TZSC_SECCFGR3_HASHSEC_Msk               /*!<  secure access mode for HASH */
#define GTZC_TZSC_SECCFGR3_RNGSEC_Pos               (13UL)
#define GTZC_TZSC_SECCFGR3_RNGSEC_Msk               (0x01UL << GTZC_TZSC_SECCFGR3_RNGSEC_Pos)
#define GTZC_TZSC_SECCFGR3_RNGSEC                   GTZC_TZSC_SECCFGR3_RNGSEC_Msk                /*!<  secure access mode for RNG */
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZSC_SECCFGR3_SAESSEC_Pos              (14UL)
#define GTZC_TZSC_SECCFGR3_SAESSEC_Msk              (0x01UL << GTZC_TZSC_SECCFGR3_SAESSEC_Pos)
#define GTZC_TZSC_SECCFGR3_SAESSEC                  GTZC_TZSC_SECCFGR3_SAESSEC_Msk               /*!<  secure access mode for SAES */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define GTZC_TZSC_SECCFGR3_PKASEC_Pos               (16UL)
#define GTZC_TZSC_SECCFGR3_PKASEC_Msk               (0x01UL << GTZC_TZSC_SECCFGR3_PKASEC_Pos)
#define GTZC_TZSC_SECCFGR3_PKASEC                   GTZC_TZSC_SECCFGR3_PKASEC_Msk                /*!<  secure access mode for PKA */
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define GTZC_TZSC_SECCFGR3_XSPI1SEC_Pos             (20UL)
#define GTZC_TZSC_SECCFGR3_XSPI1SEC_Msk             (0x01UL << GTZC_TZSC_SECCFGR3_XSPI1SEC_Pos)
#define GTZC_TZSC_SECCFGR3_XSPI1SEC                 GTZC_TZSC_SECCFGR3_XSPI1SEC_Msk              /*!<  secure access mode for XSPI1 */
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_TZSC_SECCFGR3_RAMCFGSEC_Pos            (22UL)
#define GTZC_TZSC_SECCFGR3_RAMCFGSEC_Msk            (0x01UL << GTZC_TZSC_SECCFGR3_RAMCFGSEC_Pos)
#define GTZC_TZSC_SECCFGR3_RAMCFGSEC                GTZC_TZSC_SECCFGR3_RAMCFGSEC_Msk             /*!<  secure access mode for RAMCFG */
#define GTZC_TZSC_SECCFGR3_RADIOSEC_Pos             (23UL)
#define GTZC_TZSC_SECCFGR3_RADIOSEC_Msk             (0x01UL << GTZC_TZSC_SECCFGR3_RADIOSEC_Pos)
#define GTZC_TZSC_SECCFGR3_RADIOSEC                 GTZC_TZSC_SECCFGR3_RADIOSEC_Msk              /*!<  secure access mode for 2.4 GHz RADIO */
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZSC_SECCFGR3_PTACONVSEC_Pos           (24UL)
#define GTZC_TZSC_SECCFGR3_PTACONVSEC_Msk           (0x01UL << GTZC_TZSC_SECCFGR3_PTACONVSEC_Pos)
#define GTZC_TZSC_SECCFGR3_PTACONVSEC               GTZC_TZSC_SECCFGR3_PTACONVSEC_Msk            /*!<  secure access mode for PTACONV */
#endif

/*******************  Bits definition for GTZC_TZSC_PRIVCFGR1 register  ***************/
#define GTZC_TZSC_PRIVCFGR1_TIM2PRIV_Pos           (0UL)
#define GTZC_TZSC_PRIVCFGR1_TIM2PRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR1_TIM2PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR1_TIM2PRIV               GTZC_TZSC_PRIVCFGR1_TIM2PRIV_Msk               /*!<  privileged access mode for TIM2 */
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZSC_PRIVCFGR1_TIM3PRIV_Pos           (1UL)
#define GTZC_TZSC_PRIVCFGR1_TIM3PRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR1_TIM3PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR1_TIM3PRIV               GTZC_TZSC_PRIVCFGR1_TIM3PRIV_Msk               /*!<  privileged access mode for TIM3 */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZSC_PRIVCFGR1_TIM4PRIV_Pos           (2UL)
#define GTZC_TZSC_PRIVCFGR1_TIM4PRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR1_TIM4PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR1_TIM4PRIV               GTZC_TZSC_PRIVCFGR1_TIM4PRIV_Msk               /*!<  privileged access mode for TIM4 */
#endif
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZSC_PRIVCFGR1_WWDGPRIV_Pos           (6UL)
#define GTZC_TZSC_PRIVCFGR1_WWDGPRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR1_WWDGPRIV_Pos)
#define GTZC_TZSC_PRIVCFGR1_WWDGPRIV               GTZC_TZSC_PRIVCFGR1_WWDGPRIV_Msk               /*!<  privileged access mode for WWDG */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define GTZC_TZSC_PRIVCFGR1_IWDGPRIV_Pos           (7UL)
#define GTZC_TZSC_PRIVCFGR1_IWDGPRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR1_IWDGPRIV_Pos)
#define GTZC_TZSC_PRIVCFGR1_IWDGPRIV               GTZC_TZSC_PRIVCFGR1_IWDGPRIV_Msk               /*!<  privileged access mode for IWDG */
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZSC_PRIVCFGR1_SPI2PRIV_Pos           (8UL)
#define GTZC_TZSC_PRIVCFGR1_SPI2PRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR1_SPI2PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR1_SPI2PRIV               GTZC_TZSC_PRIVCFGR1_SPI2PRIV_Msk               /*!<  privileged access mode for IWDG */
#endif
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZSC_PRIVCFGR1_USART2PRIV_Pos         (9UL)
#define GTZC_TZSC_PRIVCFGR1_USART2PRIV_Msk         (0x01UL << GTZC_TZSC_PRIVCFGR1_USART2PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR1_USART2PRIV             GTZC_TZSC_PRIVCFGR1_USART2PRIV_Msk             /*!<  privileged access mode for USART2 */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#if defined (STM32WBA62xx) || defined (STM32WBA64xx)|| defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZSC_PRIVCFGR1_USART3PRIV_Pos         (10UL)
#define GTZC_TZSC_PRIVCFGR1_USART3PRIV_Msk         (0x01UL << GTZC_TZSC_PRIVCFGR1_USART3PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR1_USART3PRIV             GTZC_TZSC_PRIVCFGR1_USART3PRIV_Msk             /*!<  privileged access mode for USART3 */
#endif
#define GTZC_TZSC_PRIVCFGR1_I2C1PRIV_Pos           (13UL)
#define GTZC_TZSC_PRIVCFGR1_I2C1PRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR1_I2C1PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR1_I2C1PRIV               GTZC_TZSC_PRIVCFGR1_I2C1PRIV_Msk               /*!<  privileged access mode for I2C1 */
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZSC_PRIVCFGR1_I2C2PRIV_Pos           (14UL)
#define GTZC_TZSC_PRIVCFGR1_I2C2PRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR1_I2C2PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR1_I2C2PRIV               GTZC_TZSC_PRIVCFGR1_I2C2PRIV_Msk               /*!<  privileged access mode for I2C2 */
#define GTZC_TZSC_PRIVCFGR1_I2C4PRIV_Pos           (16UL)
#define GTZC_TZSC_PRIVCFGR1_I2C4PRIV_Msk           (0x01UL << GTZC_TZSC_PRIVCFGR1_I2C4PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR1_I2C4PRIV               GTZC_TZSC_PRIVCFGR1_I2C4PRIV_Msk               /*!<  privileged access mode for I2C4 */
#endif
#if !defined (STM32WBA20xx)
#define GTZC_TZSC_PRIVCFGR1_LPTIM2PRIV_Pos         (17UL)
#define GTZC_TZSC_PRIVCFGR1_LPTIM2PRIV_Msk         (0x01UL << GTZC_TZSC_PRIVCFGR1_LPTIM2PRIV_Pos)
#define GTZC_TZSC_PRIVCFGR1_LPTIM2PRIV             GTZC_TZSC_PRIVCFGR1_LPTIM2PRIV_Msk             /*!<  privileged access mode for LPTIM2 */
#endif /* !defined (STM32WBA20xx) */

