STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/*******************  Bits definition for GTZC_TZIC_SR3 register  **************/
#define GTZC_TZIC_SR3_CRCF_Pos            (3UL)
#define GTZC_TZIC_SR3_CRCF_Msk            (0x01UL << GTZC_TZIC_SR3_CRCF_Pos)
#define GTZC_TZIC_SR3_CRCF                GTZC_TZIC_SR3_CRCF_Msk                  /*!<  illegal access flag for CRC */
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZIC_SR3_TSCF_Pos            (4UL)
#define GTZC_TZIC_SR3_TSCF_Msk            (0x01UL << GTZC_TZIC_SR3_TSCF_Pos)
#define GTZC_TZIC_SR3_TSCF                GTZC_TZIC_SR3_TSCF_Msk                  /*!<  illegal access flag for TSC */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define GTZC_TZIC_SR3_ICACHE_REGF_Pos     (6UL)
#define GTZC_TZIC_SR3_ICACHE_REGF_Msk     (0x01UL << GTZC_TZIC_SR3_ICACHE_REGF_Pos)
#define GTZC_TZIC_SR3_ICACHE_REGF         GTZC_TZIC_SR3_ICACHE_REGF_Msk           /*!<  illegal access flag for ICACHE_REG */
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZIC_SR3_OTGF_Pos            (10UL)
#define GTZC_TZIC_SR3_OTGF_Msk            (0x01UL << GTZC_TZIC_SR3_OTGF_Pos)
#define GTZC_TZIC_SR3_OTGF                GTZC_TZIC_SR3_OTGF_Msk                  /*!<  illegal access flag for OTG */
#endif
#define GTZC_TZIC_SR3_AESF_Pos            (11UL)
#define GTZC_TZIC_SR3_AESF_Msk            (0x01UL << GTZC_TZIC_SR3_AESF_Pos)
#define GTZC_TZIC_SR3_AESF                GTZC_TZIC_SR3_AESF_Msk                  /*!<  illegal access flag for AES */
#define GTZC_TZIC_SR3_HASHF_Pos           (12UL)
#define GTZC_TZIC_SR3_HASHF_Msk           (0x01UL << GTZC_TZIC_SR3_HASHF_Pos)
#define GTZC_TZIC_SR3_HASHF               GTZC_TZIC_SR3_HASHF_Msk                 /*!<  illegal access flag for HASH */
#define GTZC_TZIC_SR3_RNGF_Pos            (13UL)
#define GTZC_TZIC_SR3_RNGF_Msk            (0x01UL << GTZC_TZIC_SR3_RNGF_Pos)
#define GTZC_TZIC_SR3_RNGF                GTZC_TZIC_SR3_RNGF_Msk                  /*!<  illegal access flag for RNG */
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZIC_SR3_SAESF_Pos           (14UL)
#define GTZC_TZIC_SR3_SAESF_Msk           (0x01UL << GTZC_TZIC_SR3_SAESF_Pos)
#define GTZC_TZIC_SR3_SAESF               GTZC_TZIC_SR3_SAESF_Msk                 /*!<  illegal access flag for SAES */
#define GTZC_TZIC_SR3_HSEMF_Pos           (15UL)
#define GTZC_TZIC_SR3_HSEMF_Msk           (0x01UL << GTZC_TZIC_SR3_HSEMF_Pos)
#define GTZC_TZIC_SR3_HSEMF               GTZC_TZIC_SR3_HSEMF_Msk                 /*!<  illegal access flag for HSEM */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define GTZC_TZIC_SR3_PKAF_Pos            (16UL)
#define GTZC_TZIC_SR3_PKAF_Msk            (0x01UL << GTZC_TZIC_SR3_PKAF_Pos)
#define GTZC_TZIC_SR3_PKAF                GTZC_TZIC_SR3_PKAF_Msk                  /*!<  illegal access flag for PKA */
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define GTZC_TZIC_SR3_XSPI1F_Pos          (20UL)
#define GTZC_TZIC_SR3_XSPI1F_Msk          (0x01UL << GTZC_TZIC_SR3_XSPI1F_Pos)
#define GTZC_TZIC_SR3_XSPI1F              GTZC_TZIC_SR3_XSPI1F_Msk              /*!<  illegal access flag for XSPI1 */
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_TZIC_SR3_RAMCFGF_Pos         (22UL)
#define GTZC_TZIC_SR3_RAMCFGF_Msk         (0x01UL << GTZC_TZIC_SR3_RAMCFGF_Pos)
#define GTZC_TZIC_SR3_RAMCFGF             GTZC_TZIC_SR3_RAMCFGF_Msk               /*!<  illegal access flag for RAMCFG */
#define GTZC_TZIC_SR3_RADIOF_Pos          (23UL)
#define GTZC_TZIC_SR3_RADIOF_Msk          (0x01UL << GTZC_TZIC_SR3_RADIOF_Pos)
#define GTZC_TZIC_SR3_RADIOF              GTZC_TZIC_SR3_RADIOF_Msk                /*!<  illegal access flag for 2.4 GHz RADIO */
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZIC_SR3_PTACONVF_Pos        (24UL)
#define GTZC_TZIC_SR3_PTACONVF_Msk        (0x01UL << GTZC_TZIC_SR3_PTACONVF_Pos)
#define GTZC_TZIC_SR3_PTACONVF            GTZC_TZIC_SR3_PTACONVF_Msk              /*!<  illegal access flag for PTACONV */
#endif

/*******************  Bits definition for GTZC_TZIC_SR4 register  ***************/
#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define GTZC_TZIC_SR4_LPDMA1F_Pos         (0UL)
#define GTZC_TZIC_SR4_LPDMA1F_Msk         (0x01UL << GTZC_TZIC_SR4_LPDMA1F_Pos)
#define GTZC_TZIC_SR4_LPDMA1F             GTZC_TZIC_SR4_LPDMA1F_Msk               /*!<  illegal access flag for LPDMA1 */
#else /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_TZIC_SR4_GPDMA1F_Pos         (0UL)
#define GTZC_TZIC_SR4_GPDMA1F_Msk         (0x01UL << GTZC_TZIC_SR4_GPDMA1F_Pos)
#define GTZC_TZIC_SR4_GPDMA1F             GTZC_TZIC_SR4_GPDMA1F_Msk               /*!<  illegal access flag for GPDMA1 */
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_TZIC_SR4_FLASHF_Pos          (1UL)
#define GTZC_TZIC_SR4_FLASHF_Msk          (0x01UL << GTZC_TZIC_SR4_FLASHF_Pos)
#define GTZC_TZIC_SR4_FLASHF              GTZC_TZIC_SR4_FLASHF_Msk                /*!<  illegal access flag for FLASH memory */
#define GTZC_TZIC_SR4_FLASH_REGF_Pos      (2UL)
#define GTZC_TZIC_SR4_FLASH_REGF_Msk      (0x01UL << GTZC_TZIC_SR4_FLASH_REGF_Pos)
#define GTZC_TZIC_SR4_FLASH_REGF          GTZC_TZIC_SR4_FLASH_REGF_Msk            /*!<  illegal access flag for FLASH interface */
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define GTZC_TZIC_SR4_OTFDEC1F_Pos        (3UL)
#define GTZC_TZIC_SR4_OTFDEC1F_Msk        (0x01UL << GTZC_TZIC_SR4_OTFDEC1F_Pos)
#define GTZC_TZIC_SR4_OTFDEC1              GTZC_TZIC_SR4_OTFDEC1F_Msk             /*!<  illegal access flag for OTFDEC interface */
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_TZIC_SR4_SYSCFGF_Pos         (7UL)
#define GTZC_TZIC_SR4_SYSCFGF_Msk         (0x01UL << GTZC_TZIC_SR4_SYSCFGF_Pos)
#define GTZC_TZIC_SR4_SYSCFGF             GTZC_TZIC_SR4_SYSCFGF_Msk               /*!<  illegal access flag for SYSCFG interface */
#define GTZC_TZIC_SR4_RTCF_Pos            (8UL)
#define GTZC_TZIC_SR4_RTCF_Msk            (0x01UL << GTZC_TZIC_SR4_RTCF_Pos)
#define GTZC_TZIC_SR4_RTCF                GTZC_TZIC_SR4_RTCF_Msk                  /*!<  illegal access flag for RTC interface */
#define GTZC_TZIC_SR4_TAMPF_Pos           (9UL)
#define GTZC_TZIC_SR4_TAMPF_Msk           (0x01UL << GTZC_TZIC_SR4_TAMPF_Pos)
#define GTZC_TZIC_SR4_TAMPF               GTZC_TZIC_SR4_TAMPF_Msk                 /*!<  illegal access flag for TAMP interface */
#define GTZC_TZIC_SR4_PWRF_Pos            (10UL)
#define GTZC_TZIC_SR4_PWRF_Msk            (0x01UL << GTZC_TZIC_SR4_PWRF_Pos)
#define GTZC_TZIC_SR4_PWRF                GTZC_TZIC_SR4_PWRF_Msk                  /*!<  illegal access flag for PWR interface */
#define GTZC_TZIC_SR4_RCCF_Pos            (11UL)
#define GTZC_TZIC_SR4_RCCF_Msk            (0x01UL << GTZC_TZIC_SR4_RCCF_Pos)
#define GTZC_TZIC_SR4_RCCF                GTZC_TZIC_SR4_RCCF_Msk                  /*!<  illegal access flag for RCC interface */
#define GTZC_TZIC_SR4_EXTIF_Pos           (13UL)
#define GTZC_TZIC_SR4_EXTIF_Msk           (0x01UL << GTZC_TZIC_SR4_EXTIF_Pos)
#define GTZC_TZIC_SR4_EXTIF               GTZC_TZIC_SR4_EXTIF_Msk                 /*!<  illegal access flag for EXTI interface */
#define GTZC_TZIC_SR4_TZSCF_Pos           (14UL)
#define GTZC_TZIC_SR4_TZSCF_Msk           (0x01UL << GTZC_TZIC_SR4_TZSCF_Pos)
#define GTZC_TZIC_SR4_TZSCF               GTZC_TZIC_SR4_TZSCF_Msk                 /*!<  illegal access flag for GTZC TZSC */
#define GTZC_TZIC_SR4_TZICF_Pos           (15UL)
#define GTZC_TZIC_SR4_TZICF_Msk           (0x01UL << GTZC_TZIC_SR4_TZICF_Pos)
#define GTZC_TZIC_SR4_TZICF               GTZC_TZIC_SR4_TZICF_Msk                 /*!<  illegal access flag for GTZC TZIC */
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define GTZC_TZIC_SR4_MPCWM1F_Pos         (20UL)
#define GTZC_TZIC_SR4_MPCWM1F_Msk         (0x01UL << GTZC_TZIC_SR4_MPCWM1F_Pos)
#define GTZC_TZIC_SR4_MPCWM1F             GTZC_TZIC_SR4_MPCWM1F_Msk             /*!<  illegal access flag for MPCWM1 interface */
#endif /* defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_TZIC_SR4_SRAM1F_Pos          (22UL)
#define GTZC_TZIC_SR4_SRAM1F_Msk          (0x01UL << GTZC_TZIC_SR4_SRAM1F_Pos)
#define GTZC_TZIC_SR4_SRAM1F              GTZC_TZIC_SR4_SRAM1F_Msk                /*!<  illegal access flag for SRAM1 memory */
#define GTZC_TZIC_SR4_MPCBB1F_Pos         (23UL)
#define GTZC_TZIC_SR4_MPCBB1F_Msk         (0x01UL << GTZC_TZIC_SR4_MPCBB1F_Pos)
#define GTZC_TZIC_SR4_MPCBB1F             GTZC_TZIC_SR4_MPCBB1F_Msk               /*!<  illegal access flag for MPCBB1 */
#define GTZC_TZIC_SR4_SRAM2F_Pos          (24UL)
#define GTZC_TZIC_SR4_SRAM2F_Msk          (0x01UL << GTZC_TZIC_SR4_SRAM2F_Pos)
#define GTZC_TZIC_SR4_SRAM2F              GTZC_TZIC_SR4_SRAM2F_Msk                /*!<  illegal access flag for SRAM2 memory */
#define GTZC_TZIC_SR4_MPCBB2F_Pos         (25UL)
#define GTZC_TZIC_SR4_MPCBB2F_Msk         (0x01UL << GTZC_TZIC_SR4_MPCBB2F_Pos)
#define GTZC_TZIC_SR4_MPCBB2F              GTZC_TZIC_SR4_MPCBB2F_Msk              /*!<  illegal access flag for MPCBB2 */
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZIC_SR4_SRAM6F_Pos          (30UL)
#define GTZC_TZIC_SR4_SRAM6F_Msk          (0x01UL << GTZC_TZIC_SR4_SRAM6F_Pos)
#define GTZC_TZIC_SR4_SRAM6F              GTZC_TZIC_SR4_SRAM6F_Msk                /*!<  illegal access flag for 2.4GHz TXRX SRAM memory */
#define GTZC_TZIC_SR4_MPCBB6F_Pos         (31UL)
#define GTZC_TZIC_SR4_MPCBB6F_Msk         (0x01UL << GTZC_TZIC_SR4_MPCBB6F_Pos)
#define GTZC_TZIC_SR4_MPCBB6F             GTZC_TZIC_SR4_MPCBB6F_Msk               /*!<  illegal access flag for MPCBB6 */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */

/******************  Bits definition for GTZC_TZIC_FCR1 register  ****************/
#define GTZC_TZIC_FCR1_CTIM2F_Pos         (0UL)
#define GTZC_TZIC_FCR1_CTIM2F_Msk         (0x01UL << GTZC_TZIC_FCR1_CTIM2F_Pos)
#define GTZC_TZIC_FCR1_CTIM2F             GTZC_TZIC_FCR1_CTIM2F_Msk                 /*!<  clear the illegal access flag for TIM2 */
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZIC_FCR1_CTIM3F_Pos         (1UL)
#define GTZC_TZIC_FCR1_CTIM3F_Msk         (0x01UL << GTZC_TZIC_FCR1_CTIM3F_Pos)
#define GTZC_TZIC_FCR1_CTIM3F             GTZC_TZIC_FCR1_CTIM3F_Msk                 /*!<  clear the illegal access flag for TIM3 */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZIC_FCR1_CTIM4F_Pos         (2UL)
#define GTZC_TZIC_FCR1_CTIM4F_Msk         (0x01UL << GTZC_TZIC_FCR1_CTIM4F_Pos)
#define GTZC_TZIC_FCR1_CTIM4F             GTZC_TZIC_FCR1_CTIM4F_Msk                 /*!<  clear the illegal access flag for TIM4 */
#endif
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZIC_FCR1_CWWDGF_Pos         (6UL)
#define GTZC_TZIC_FCR1_CWWDGF_Msk         (0x01UL << GTZC_TZIC_FCR1_CWWDGF_Pos)
#define GTZC_TZIC_FCR1_CWWDGF             GTZC_TZIC_FCR1_CWWDGF_Msk                 /*!<  clear the illegal access flag for WWDG */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define GTZC_TZIC_FCR1_CIWDGF_Pos         (7UL)
#define GTZC_TZIC_FCR1_CIWDGF_Msk         (0x01UL << GTZC_TZIC_FCR1_CIWDGF_Pos)
#define GTZC_TZIC_FCR1_CIWDGF             GTZC_TZIC_FCR1_CIWDGF_Msk                 /*!<  clear the illegal access flag for IWDG */
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZIC_FCR1_CSPI2F_Pos         (8UL)
#define GTZC_TZIC_FCR1_CSPI2F_Msk         (0x01UL << GTZC_TZIC_FCR1_CSPI2F_Pos)
#define GTZC_TZIC_FCR1_CSPI2F             GTZC_TZIC_FCR1_CSPI2F_Msk                 /*!<  clear the illegal access flag for IWDG */
#endif
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZIC_FCR1_CUSART2F_Pos       (9UL)
#define GTZC_TZIC_FCR1_CUSART2F_Msk       (0x01UL << GTZC_TZIC_FCR1_CUSART2F_Pos)
#define GTZC_TZIC_FCR1_CUSART2F           GTZC_TZIC_FCR1_CUSART2F_Msk               /*!<  clear the illegal access flag for USART2 */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#if defined (STM32WBA62xx) || defined (STM32WBA64xx)|| defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZIC_FCR1_CUSART3F_Pos       (10UL)
#define GTZC_TZIC_FCR1_CUSART3F_Msk       (0x01UL << GTZC_TZIC_FCR1_CUSART3F_Pos)
#define GTZC_TZIC_FCR1_CUSART3F           GTZC_TZIC_FCR1_CUSART3F_Msk               /*!<  clear the illegal access flag for USART3 */
#endif
#define GTZC_TZIC_FCR1_CI2C1F_Pos         (13UL)
#define GTZC_TZIC_FCR1_CI2C1F_Msk         (0x01UL << GTZC_TZIC_FCR1_CI2C1F_Pos)
#define GTZC_TZIC_FCR1_CI2C1F             GTZC_TZIC_FCR1_CI2C1F_Msk                 /*!<  clear the illegal access flag for I2C1 */
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZIC_FCR1_CI2C2F_Pos         (14UL)
#define GTZC_TZIC_FCR1_CI2C2F_Msk         (0x01UL << GTZC_TZIC_FCR1_CI2C2F_Pos)
#define GTZC_TZIC_FCR1_CI2C2F             GTZC_TZIC_FCR1_CI2C2F_Msk                 /*!<  clear the illegal access flag for I2C2 */
#define GTZC_TZIC_FCR1_CI2C4F_Pos         (16UL)
#define GTZC_TZIC_FCR1_CI2C4F_Msk         (0x01UL << GTZC_TZIC_FCR1_CI2C4F_Pos)
#define GTZC_TZIC_FCR1_CI2C4F             GTZC_TZIC_FCR1_CI2C4F_Msk                 /*!<  clear the illegal access flag for I2C4 */
#endif
#if !defined (STM32WBA20xx)
#define GTZC_TZIC_FCR1_CLPTIM2F_Pos       (17UL)
#define GTZC_TZIC_FCR1_CLPTIM2F_Msk       (0x01UL << GTZC_TZIC_FCR1_CLPTIM2F_Pos)
#define GTZC_TZIC_FCR1_CLPTIM2F           GTZC_TZIC_FCR1_CLPTIM2F_Msk               /*!<  clear the illegal access flag for LPTIM2 */
#endif /* !defined (STM32WBA20xx) */

/******************  Bits definition for GTZC_TZIC_FCR2 register  ****************/
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZIC_FCR2_CTIM1F_Pos         (0UL)
#define GTZC_TZIC_FCR2_CTIM1F_Msk         (0x01UL << GTZC_TZIC_FCR2_CTIM1F_Pos)
#define GTZC_TZIC_FCR2_CTIM1F             GTZC_TZIC_FCR2_CTIM1F_Msk                 /*!<  clear the illegal access flag for TIM1 */
#define GTZC_TZIC_FCR2_CSPI1F_Pos         (1UL)
#define GTZC_TZIC_FCR2_CSPI1F_Msk         (0x01UL << GTZC_TZIC_FCR2_CSPI1F_Pos)
#define GTZC_TZIC_FCR2_CSPI1F             GTZC_TZIC_FCR2_CSPI1F_Msk                 /*!<  clear the illegal access flag for SPI1 */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define GTZC_TZIC_FCR2_CUSART1F_Pos       (3UL)
#define GTZC_TZIC_FCR2_CUSART1F_Msk       (0x01UL << GTZC_TZIC_FCR2_CUSART1F_Pos)
#define GTZC_TZIC_FCR2_CUSART1F           GTZC_TZIC_FCR2_CUSART1F_Msk               /*!<  clear the illegal access flag for USART1 */
#define GTZC_TZIC_FCR2_CTIM16F_Pos        (5UL)
#define GTZC_TZIC_FCR2_CTIM16F_Msk        (0x01UL << GTZC_TZIC_FCR2_CTIM16F_Pos)
#define GTZC_TZIC_FCR2_CTIM16F            GTZC_TZIC_FCR2_CTIM16F_Msk                /*!<  clear the illegal access flag for TIM16 */
#if !defined (STM32WBA20xx)
#define GTZC_TZIC_FCR2_CTIM17F_Pos        (6UL)
#define GTZC_TZIC_FCR2_CTIM17F_Msk        (0x01UL << GTZC_TZIC_FCR2_CTIM17F_Pos)
#define GTZC_TZIC_FCR2_CTIM17F            GTZC_TZIC_FCR2_CTIM17F_Msk                /*!<  clear the illegal access flag for TIM17 */
#endif /* !defined (STM32WBA20xx) */
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZIC_FCR2_CSAI1F_Pos         (7UL)
#define GTZC_TZIC_FCR2_CSAI1F_Msk         (0x01UL << GTZC_TZIC_FCR2_CSAI1F_Pos)
#define GTZC_TZIC_FCR2_CSAI1F             GTZC_TZIC_FCR2_CSAI1F_Msk                 /*!<  clear the illegal access flag for SAI1 */
#endif
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define GTZC_TZSC_FCR2_CUSB1F_Pos         (15UL)
#define GTZC_TZSC_FCR2_CUSB1F_Msk         (0x01UL << GTZC_TZSC_FCR2_CUSB1F_Pos)
#define GTZC_TZSC_FCR2_CUSB1F             GTZC_TZSC_FCR2_CUSB1F_Msk                 /*!<  clear the illegal access flag for USB */
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_TZIC_FCR2_CSPI3F_Pos         (16UL)
#define GTZC_TZIC_FCR2_CSPI3F_Msk         (0x01UL << GTZC_TZIC_FCR2_CSPI3F_Pos)
#define GTZC_TZIC_FCR2_CSPI3F             GTZC_TZIC_FCR2_CSPI3F_Msk                 /*!<  clear the illegal access flag for SPI3 */
#define GTZC_TZIC_FCR2_CLPUART1F_Pos      (17UL)
#define GTZC_TZIC_FCR2_CLPUART1F_Msk      (0x01UL << GTZC_TZIC_FCR2_CLPUART1F_Pos)
#define GTZC_TZIC_FCR2_CLPUART1F          GTZC_TZIC_FCR2_CLPUART1F_Msk              /*!<  clear the illegal access flag for LPUART1 */
#define GTZC_TZIC_FCR2_CI2C3F_Pos         (18UL)
#define GTZC_TZIC_FCR2_CI2C3F_Msk         (0x01UL << GTZC_TZIC_FCR2_CI2C3F_Pos)
#define GTZC_TZIC_FCR2_CI2C3F             GTZC_TZIC_FCR2_CI2C3F_Msk                 /*!<  clear the illegal access flag for I2C3 */
#define GTZC_TZIC_FCR2_CLPTIM1F_Pos       (19UL)
#define GTZC_TZIC_FCR2_CLPTIM1F_Msk       (0x01UL << GTZC_TZIC_FCR2_CLPTIM1F_Pos)
#define GTZC_TZIC_FCR2_CLPTIM1F           GTZC_TZIC_FCR2_CLPTIM1F_Msk               /*!<  clear the illegal access flag for LPTIM1 */
#if defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZIC_FCR2_CCOMPF_Pos         (23UL)
#define GTZC_TZIC_FCR2_CCOMPF_Msk         (0x01UL << GTZC_TZIC_FCR2_CCOMPF_Pos)
#define GTZC_TZIC_FCR2_CCOMPF             GTZC_TZIC_FCR2_CCOMPF_Msk                 /*!<  clear the illegal access flag for COMP */
#endif
#define GTZC_TZIC_FCR2_CADC4F_Pos         (24UL)
#define GTZC_TZIC_FCR2_CADC4F_Msk         (0x01UL << GTZC_TZIC_FCR2_CADC4F_Pos)
#define GTZC_TZIC_FCR2_CADC4F             GTZC_TZIC_FCR2_CADC4F_Msk                 /*!<  clear the illegal access flag for ADC4 */
#if defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZIC_FCR2_CVREFBUFF_Pos      (25UL)
#define GTZC_TZIC_FCR2_CVREFBUFF_Msk      (0x01UL << GTZC_FCR2_CVREFBUFF_Pos)
#define GTZC_TZIC_FCR2_CVREFBUFF          GTZC_TZIC_FCR2_CVREFBUFF_Msk              /*!<  clear the illegal access flag for VREFBUF */
#endif

