STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/******************  Bits definition for GTZC_TZIC_FCR3 register  ****************/
#define GTZC_TZIC_FCR3_CCRCF_Pos          (3UL)
#define GTZC_TZIC_FCR3_CCRCF_Msk          (0x01UL << GTZC_TZIC_FCR3_CCRCF_Pos)
#define GTZC_TZIC_FCR3_CCRCF              GTZC_TZIC_FCR3_CCRCF_Msk                  /*!<  clear the illegal access flag enable for CRC */
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZIC_FCR3_CTSCF_Pos          (4UL)
#define GTZC_TZIC_FCR3_CTSCF_Msk          (0x01UL << GTZC_TZIC_FCR3_CTSCF_Pos)
#define GTZC_TZIC_FCR3_CTSCF              GTZC_TZIC_FCR3_CTSCF_Msk                  /*!<  clear the illegal access flag enable for TSC */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define GTZC_TZIC_FCR3_CICACHE_REGF_Pos   (6UL)
#define GTZC_TZIC_FCR3_CICACHE_REGF_Msk   (0x01UL << GTZC_TZIC_FCR3_CICACHE_REGF_Pos)
#define GTZC_TZIC_FCR3_CICACHE_REGF       GTZC_TZIC_FCR3_CICACHE_REGF_Msk           /*!<  clear the illegal access flag enable for ICACHE_REG */
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZIC_FCR3_COTGF_Pos          (10UL)
#define GTZC_TZIC_FCR3_COTGF_Msk          (0x01UL << GTZC_TZIC_FCR3_COTGF_Pos)
#define GTZC_TZIC_FCR3_COTGF              GTZC_TZIC_FCR3_COTGF_Msk                  /*!<  clear the illegal access flag for OTG */
#endif
#define GTZC_TZIC_FCR3_CAESF_Pos          (11UL)
#define GTZC_TZIC_FCR3_CAESF_Msk          (0x01UL << GTZC_TZIC_FCR3_CAESF_Pos)
#define GTZC_TZIC_FCR3_CAESF              GTZC_TZIC_FCR3_CAESF_Msk                  /*!<  clear the illegal access flag enable for AES */
#define GTZC_TZIC_FCR3_CHASHF_Pos         (12UL)
#define GTZC_TZIC_FCR3_CHASHF_Msk         (0x01UL << GTZC_TZIC_FCR3_CHASHF_Pos)
#define GTZC_TZIC_FCR3_CHASHF             GTZC_TZIC_FCR3_CHASHF_Msk                 /*!<  clear the illegal access flag enable for HASH */
#define GTZC_TZIC_FCR3_CRNGF_Pos          (13UL)
#define GTZC_TZIC_FCR3_CRNGF_Msk          (0x01UL << GTZC_TZIC_FCR3_CRNGF_Pos)
#define GTZC_TZIC_FCR3_CRNGF              GTZC_TZIC_FCR3_CRNGF_Msk                  /*!<  clear the illegal access flag enable for RNG */
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZIC_FCR3_CSAESF_Pos         (14UL)
#define GTZC_TZIC_FCR3_CSAESF_Msk         (0x01UL << GTZC_TZIC_FCR3_CSAESF_Pos)
#define GTZC_TZIC_FCR3_CSAESF             GTZC_TZIC_FCR3_CSAESF_Msk                 /*!<  clear the illegal access flag enable for SAES */
#define GTZC_TZIC_FCR3_CHSEMF_Pos         (15UL)
#define GTZC_TZIC_FCR3_CHSEMF_Msk         (0x01UL << GTZC_TZIC_FCR3_CHSEMF_Pos)
#define GTZC_TZIC_FCR3_CHSEMF             GTZC_TZIC_FCR3_CHSEMF_Msk                 /*!<  clear the illegal access flag enable for HSEM */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define GTZC_TZIC_FCR3_CPKAF_Pos          (16UL)
#define GTZC_TZIC_FCR3_CPKAF_Msk          (0x01UL << GTZC_TZIC_FCR3_CPKAF_Pos)
#define GTZC_TZIC_FCR3_CPKAF              GTZC_TZIC_FCR3_CPKAF_Msk                  /*!<  clear the illegal access flag enable for PKA */
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define GTZC_TZIC_FCR3_CXSPI1F_Pos        (20UL)
#define GTZC_TZIC_FCR3_CXSPI1F_Msk        (0x01UL << GTZC_TZIC_FCR3_CXSPI1F_Pos)
#define GTZC_TZIC_FCR3_CXSPI1F            GTZC_TZIC_FCR3_CXSPI1F_Msk                /*!<  clear the illegal access flag for XSPI1 */
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_TZIC_FCR3_CRAMCFGF_Pos       (22UL)
#define GTZC_TZIC_FCR3_CRAMCFGF_Msk       (0x01UL << GTZC_TZIC_FCR3_CRAMCFGF_Pos)
#define GTZC_TZIC_FCR3_CRAMCFGF           GTZC_TZIC_FCR3_CRAMCFGF_Msk               /*!<  clear the illegal access flag enable for RAMCFG */
#define GTZC_TZIC_FCR3_CRADIOF_Pos        (23UL)
#define GTZC_TZIC_FCR3_CRADIOF_Msk        (0x01UL << GTZC_TZIC_FCR3_CRADIOF_Pos)
#define GTZC_TZIC_FCR3_CRADIOF            GTZC_TZIC_FCR3_CRADIOF_Msk                /*!<  clear the illegal access flag enable for 2.4 GHz RADIO */
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define GTZC_TZIC_FCR3_CPTACONVF_Pos      (24UL)
#define GTZC_TZIC_FCR3_CPTACONVF_Msk      (0x01UL << GTZC_TZIC_FCR3_CPTACONVF_Pos)
#define GTZC_TZIC_FCR3_CPTACONVF          GTZC_TZIC_FCR3_CPTACONVF_Msk              /*!<  clear the illegal access flag enable for PTACONV */
#endif

/******************  Bits definition for GTZC_TZIC_FCR4 register  ****************/
#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define GTZC_TZIC_FCR4_CLPDMA1F_Pos       (0UL)
#define GTZC_TZIC_FCR4_CLPDMA1F_Msk       (0x01UL << GTZC_TZIC_FCR4_CLPDMA1F_Pos)
#define GTZC_TZIC_FCR4_CLPDMA1F           GTZC_TZIC_FCR4_CLPDMA1F_Msk               /*!<  clear the illegal access flag enable for LPDMA1 */
#else /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_TZIC_FCR4_CGPDMA1F_Pos       (0UL)
#define GTZC_TZIC_FCR4_CGPDMA1F_Msk       (0x01UL << GTZC_TZIC_FCR4_CGPDMA1F_Pos)
#define GTZC_TZIC_FCR4_CGPDMA1F           GTZC_TZIC_FCR4_CGPDMA1F_Msk               /*!<  clear the illegal access flag enable for GPDMA1 */
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_TZIC_FCR4_CFLASHF_Pos        (1UL)
#define GTZC_TZIC_FCR4_CFLASHF_Msk        (0x01UL << GTZC_TZIC_FCR4_CFLASHF_Pos)
#define GTZC_TZIC_FCR4_CFLASHF            GTZC_TZIC_FCR4_CFLASHF_Msk                /*!<  clear the illegal access flag enable for FLASH memory */
#define GTZC_TZIC_FCR4_CFLASH_REGF_Pos    (2UL)
#define GTZC_TZIC_FCR4_CFLASH_REGF_Msk    (0x01UL << GTZC_TZIC_FCR4_CFLASH_REGF_Pos)
#define GTZC_TZIC_FCR4_CFLASH_REGF        GTZC_TZIC_FCR4_CFLASH_REGF_Msk            /*!<  clear the illegal access flag enable for FLASH interface */
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define GTZC_TZIC_FCR4_COTFDEC1F_Pos      (3UL)
#define GTZC_TZIC_FCR4_COTFDEC1F_Msk      (0x01UL << GTZC_TZIC_FCR4_COTFDEC1F_Pos)
#define GTZC_TZIC_FCR4_COTFDEC1            GTZC_TZIC_FCR4_COTFDEC1F_Msk             /*!<  clear the illegal access flag for OTFDEC interface */
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_TZIC_FCR4_CSYSCFGF_Pos       (7UL)
#define GTZC_TZIC_FCR4_CSYSCFGF_Msk       (0x01UL << GTZC_TZIC_FCR4_CSYSCFGF_Pos)
#define GTZC_TZIC_FCR4_CSYSCFGF           GTZC_TZIC_FCR4_CSYSCFGF_Msk               /*!<  clear the illegal access flag enable for SYSCFG interface */
#define GTZC_TZIC_FCR4_CRTCF_Pos          (8UL)
#define GTZC_TZIC_FCR4_CRTCF_Msk          (0x01UL << GTZC_TZIC_FCR4_CRTCF_Pos)
#define GTZC_TZIC_FCR4_CRTCF              GTZC_TZIC_FCR4_CRTCF_Msk                  /*!<  clear the illegal access flag enable for RTC interface */
#define GTZC_TZIC_FCR4_CTAMPF_Pos         (9UL)
#define GTZC_TZIC_FCR4_CTAMPF_Msk         (0x01UL << GTZC_TZIC_FCR4_CTAMPF_Pos)
#define GTZC_TZIC_FCR4_CTAMPF             GTZC_TZIC_FCR4_CTAMPF_Msk                 /*!<  clear the illegal access flag enable for TAMP interface */
#define GTZC_TZIC_FCR4_CPWRF_Pos          (10UL)
#define GTZC_TZIC_FCR4_CPWRF_Msk          (0x01UL << GTZC_TZIC_FCR4_CPWRF_Pos)
#define GTZC_TZIC_FCR4_CPWRF              GTZC_TZIC_FCR4_CPWRF_Msk                  /*!<  clear the illegal access flag enable for PWR interface */
#define GTZC_TZIC_FCR4_CRCCF_Pos          (11UL)
#define GTZC_TZIC_FCR4_CRCCF_Msk          (0x01UL << GTZC_TZIC_FCR4_CRCCF_Pos)
#define GTZC_TZIC_FCR4_CRCCF              GTZC_TZIC_FCR4_CRCCF_Msk                  /*!<  clear the illegal access flag enable for RCC interface */
#define GTZC_TZIC_FCR4_CEXTIF_Pos         (13UL)
#define GTZC_TZIC_FCR4_CEXTIF_Msk         (0x01UL << GTZC_TZIC_FCR4_CEXTIF_Pos)
#define GTZC_TZIC_FCR4_CEXTIF             GTZC_TZIC_FCR4_CEXTIF_Msk                 /*!<  clear the illegal access flag enable for EXTI interface */
#define GTZC_TZIC_FCR4_CTZSCF_Pos         (14UL)
#define GTZC_TZIC_FCR4_CTZSCF_Msk         (0x01UL << GTZC_TZIC_FCR4_CTZSCF_Pos)
#define GTZC_TZIC_FCR4_CTZSCF             GTZC_TZIC_FCR4_CTZSCF_Msk                 /*!<  clear the illegal access flag enable for GTZC TZSC */
#define GTZC_TZIC_FCR4_CTZICF_Pos         (15UL)
#define GTZC_TZIC_FCR4_CTZICF_Msk         (0x01UL << GTZC_TZIC_FCR4_CTZICF_Pos)
#define GTZC_TZIC_FCR4_CTZICF             GTZC_TZIC_FCR4_CTZICF_Msk                 /*!<  clear the illegal access flag enable for GTZC TZIC */
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define GTZC_TZIC_FCR4_CMPCWM1F_Pos       (20UL)
#define GTZC_TZIC_FCR4_CMPCWM1F_Msk       (0x01UL << GTZC_TZIC_FCR4_CMPCWM1F_Pos)
#define GTZC_TZIC_FCR4_CMPCWM1F           GTZC_TZIC_FCR4_CMPCWM1F_Msk             /*!<  clear the illegal access flag for MPCWM1 interface */
#endif /* defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define GTZC_TZIC_FCR4_CSRAM1F_Pos        (22UL)
#define GTZC_TZIC_FCR4_CSRAM1F_Msk        (0x01UL << GTZC_TZIC_FCR4_CSRAM1F_Pos)
#define GTZC_TZIC_FCR4_CSRAM1F            GTZC_TZIC_FCR4_CSRAM1F_Msk                /*!<  clear the illegal access flag enable for SRAM1 memory */
#define GTZC_TZIC_FCR4_CMPCBB1F_Pos       (23UL)
#define GTZC_TZIC_FCR4_CMPCBB1F_Msk       (0x01UL << GTZC_TZIC_FCR4_CMPCBB1F_Pos)
#define GTZC_TZIC_FCR4_CMPCBB1F           GTZC_TZIC_FCR4_CMPCBB1F_Msk               /*!<  clear the illegal access flag enable for MPCBB1 */
#define GTZC_TZIC_FCR4_CSRAM2F_Pos        (24UL)
#define GTZC_TZIC_FCR4_CSRAM2F_Msk        (0x01UL << GTZC_TZIC_FCR4_CSRAM2F_Pos)
#define GTZC_TZIC_FCR4_CSRAM2F            GTZC_TZIC_FCR4_CSRAM2F_Msk                /*!<  clear the illegal access flag enable for SRAM2 memory */
#define GTZC_TZIC_FCR4_CMPCBB2F_Pos       (25UL)
#define GTZC_TZIC_FCR4_CMPCBB2F_Msk       (0x01UL << GTZC_TZIC_FCR4_CMPCBB2F_Pos)
#define GTZC_TZIC_FCR4_CMPCBB2F            GTZC_TZIC_FCR4_CMPCBB2F_Msk              /*!<  clear the illegal access flag enable for MPCBB2 */
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define GTZC_TZIC_FCR4_CSRAM6F_Pos        (30UL)
#define GTZC_TZIC_FCR4_CSRAM6F_Msk        (0x01UL << GTZC_TZIC_FCR4_CSRAM6F_Pos)
#define GTZC_TZIC_FCR4_CSRAM6F            GTZC_TZIC_FCR4_CSRAM6F_Msk                /*!<  clear the illegal access flag enable for 2.4GHz TXRX SRAM memory */
#define GTZC_TZIC_FCR4_CMPCBB6F_Pos       (31UL)
#define GTZC_TZIC_FCR4_CMPCBB6F_Msk       (0x01UL << GTZC_TZIC_FCR4_CMPCBB6F_Pos)
#define GTZC_TZIC_FCR4_CMPCBB6F           GTZC_TZIC_FCR4_CMPCBB6F_Msk               /*!<  clear the illegal access flag enable for MPCBB6 */
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */

#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
/*******************  Bit definition for GTZC1_TZSC_MPCWM1ACFGR register  ******************/
#define GTZC1_TZSC_MPCWM1ACFGR_SREN_Pos   (0UL)
#define GTZC1_TZSC_MPCWM1ACFGR_SREN_Msk   (0x1UL << GTZC1_TZSC_MPCWM1ACFGR_SREN_Pos)    /*!< 0x00000001 */
#define GTZC1_TZSC_MPCWM1ACFGR_SREN       GTZC1_TZSC_MPCWM1ACFGR_SREN_Msk               /*!< Sub-region A enable */
#define GTZC1_TZSC_MPCWM1ACFGR_SRLOCK_Pos (1UL)
#define GTZC1_TZSC_MPCWM1ACFGR_SRLOCK_Msk (0x1UL << GTZC1_TZSC_MPCWM1ACFGR_SRLOCK_Pos)  /*!< 0x00000002 */
#define GTZC1_TZSC_MPCWM1ACFGR_SRLOCK     GTZC1_TZSC_MPCWM1ACFGR_SRLOCK_Msk             /*!< Sub-region A lock */
#define GTZC1_TZSC_MPCWM1ACFGR_SEC_Pos    (8UL)
#define GTZC1_TZSC_MPCWM1ACFGR_SEC_Msk    (0x1UL << GTZC1_TZSC_MPCWM1ACFGR_SEC_Pos)     /*!< 0x00000100 */
#define GTZC1_TZSC_MPCWM1ACFGR_SEC        GTZC1_TZSC_MPCWM1ACFGR_SEC_Msk                /*!< Secure sub-region A */
#define GTZC1_TZSC_MPCWM1ACFGR_PRIV_Pos   (9UL)
#define GTZC1_TZSC_MPCWM1ACFGR_PRIV_Msk   (0x1UL << GTZC1_TZSC_MPCWM1ACFGR_PRIV_Pos)    /*!< 0x00000200 */
#define GTZC1_TZSC_MPCWM1ACFGR_PRIV       GTZC1_TZSC_MPCWM1ACFGR_PRIV_Msk               /*!< Privileged sub-region A */

/********************  Bit definition for GTZC1_TZSC_MPCWM1AR register  ********************/
#define GTZC1_TZSC_MPCWM1AR_SUBA_START_Pos  (0UL)
#define GTZC1_TZSC_MPCWM1AR_SUBA_START_Msk  (0x7FFUL << GTZC1_TZSC_MPCWM1AR_SUBA_START_Pos)  /*!< 0x000007FF */
#define GTZC1_TZSC_MPCWM1AR_SUBA_START      GTZC1_TZSC_MPCWM1AR_SUBA_START_Msk               /*!< SUBA_START[10:0] bits (Start of sub-region A) */
#define GTZC1_TZSC_MPCWM1AR_SUBA_LENGTH_Pos (16UL)
#define GTZC1_TZSC_MPCWM1AR_SUBA_LENGTH_Msk (0xFFFUL << GTZC1_TZSC_MPCWM1AR_SUBA_LENGTH_Pos) /*!< 0x0FFF0000 */
#define GTZC1_TZSC_MPCWM1AR_SUBA_LENGTH     GTZC1_TZSC_MPCWM1AR_SUBA_LENGTH_Msk              /*!< SUBA_LENGTH[11:0] bits (Length of sub-region A) */

