STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/******************  Bit definition for LPTIM_CCR1 register  ******************/
#define LPTIM_CCR1_CCR1_Pos                 (0UL)
#define LPTIM_CCR1_CCR1_Msk                 (0xFFFFUL << LPTIM_CCR1_CCR1_Pos)       /*!< 0x0000FFFF */
#define LPTIM_CCR1_CCR1                     LPTIM_CCR1_CCR1_Msk                     /*!< Compare register 1 */

/******************  Bit definition for LPTIM_ARR register  *******************/
#define LPTIM_ARR_ARR_Pos                   (0UL)
#define LPTIM_ARR_ARR_Msk                   (0xFFFFUL << LPTIM_ARR_ARR_Pos)         /*!< 0x0000FFFF */
#define LPTIM_ARR_ARR                       LPTIM_ARR_ARR_Msk                       /*!< Auto reload register */

/******************  Bit definition for LPTIM_CNT register  *******************/
#define LPTIM_CNT_CNT_Pos                   (0UL)
#define LPTIM_CNT_CNT_Msk                   (0xFFFFUL << LPTIM_CNT_CNT_Pos)         /*!< 0x0000FFFF */
#define LPTIM_CNT_CNT                       LPTIM_CNT_CNT_Msk                       /*!< Counter register */

/******************  Bit definition for LPTIM_CFGR2 register  *****************/
#define LPTIM_CFGR2_IN1SEL_Pos              (0UL)
#define LPTIM_CFGR2_IN1SEL_Msk              (0x3UL << LPTIM_CFGR2_IN1SEL_Pos)       /*!< 0x00000003 */
#define LPTIM_CFGR2_IN1SEL                  LPTIM_CFGR2_IN1SEL_Msk                  /*!< IN1SEL[1:0] bits (Remap selection) */
#define LPTIM_CFGR2_IN1SEL_0                (0x1UL << LPTIM_CFGR2_IN1SEL_Pos)       /*!< 0x00000001 */
#define LPTIM_CFGR2_IN1SEL_1                (0x2UL << LPTIM_CFGR2_IN1SEL_Pos)       /*!< 0x00000002 */
#define LPTIM_CFGR2_IN2SEL_Pos              (4UL)
#define LPTIM_CFGR2_IN2SEL_Msk              (0x3UL << LPTIM_CFGR2_IN2SEL_Pos)       /*!< 0x00000030 */
#define LPTIM_CFGR2_IN2SEL                  LPTIM_CFGR2_IN2SEL_Msk                  /*!< IN2SEL[5:4] bits (Remap selection) */
#define LPTIM_CFGR2_IN2SEL_0                (0x1UL << LPTIM_CFGR2_IN2SEL_Pos)       /*!< 0x00000010 */
#define LPTIM_CFGR2_IN2SEL_1                (0x2UL << LPTIM_CFGR2_IN2SEL_Pos)       /*!< 0x00000020 */
#define LPTIM_CFGR2_IC1SEL_Pos              (16UL)
#define LPTIM_CFGR2_IC1SEL_Msk              (0x3UL << LPTIM_CFGR2_IC1SEL_Pos)       /*!< 0x00000003 */
#define LPTIM_CFGR2_IC1SEL                  LPTIM_CFGR2_IC1SEL_Msk                  /*!< IC1SEL[17:16] bits */
#define LPTIM_CFGR2_IC1SEL_0                (0x1UL << LPTIM_CFGR2_IC1SEL_Pos)       /*!< 0x00010000 */
#define LPTIM_CFGR2_IC1SEL_1                (0x2UL << LPTIM_CFGR2_IC1SEL_Pos)       /*!< 0x00020000 */
#define LPTIM_CFGR2_IC2SEL_Pos              (20UL)
#define LPTIM_CFGR2_IC2SEL_Msk              (0x3UL << LPTIM_CFGR2_IC2SEL_Pos)       /*!< 0x00000030 */
#define LPTIM_CFGR2_IC2SEL                  LPTIM_CFGR2_IC2SEL_Msk                  /*!< IC2SEL[21:20] bits */
#define LPTIM_CFGR2_IC2SEL_0                (0x1UL << LPTIM_CFGR2_IC2SEL_Pos)       /*!< 0x00100000 */
#define LPTIM_CFGR2_IC2SEL_1                (0x2UL << LPTIM_CFGR2_IC2SEL_Pos)       /*!< 0x00200000 */

/******************  Bit definition for LPTIM_RCR register  *******************/
#define LPTIM_RCR_REP_Pos                   (0UL)
#define LPTIM_RCR_REP_Msk                   (0xFFUL << LPTIM_RCR_REP_Pos)           /*!< 0x000000FF */
#define LPTIM_RCR_REP                       LPTIM_RCR_REP_Msk                       /*!< Repetition register value */

/*****************  Bit definition for LPTIM_CCMR1 register  ******************/
#define LPTIM_CCMR1_CC1SEL_Pos              (0UL)
#define LPTIM_CCMR1_CC1SEL_Msk              (0x1UL << LPTIM_CCMR1_CC1SEL_Pos)       /*!< 0x00000001 */
#define LPTIM_CCMR1_CC1SEL                  LPTIM_CCMR1_CC1SEL_Msk                  /*!< Capture/Compare 1 selection */
#define LPTIM_CCMR1_CC1E_Pos                (1UL)
#define LPTIM_CCMR1_CC1E_Msk                (0x1UL << LPTIM_CCMR1_CC1E_Pos)         /*!< 0x00000002 */
#define LPTIM_CCMR1_CC1E                    LPTIM_CCMR1_CC1E_Msk                    /*!< Capture/Compare 1 output enable */
#define LPTIM_CCMR1_CC1P_Pos                (2UL)
#define LPTIM_CCMR1_CC1P_Msk                (0x3UL << LPTIM_CCMR1_CC1P_Pos)         /*!< 0x0000000C */
#define LPTIM_CCMR1_CC1P                    LPTIM_CCMR1_CC1P_Msk                    /*!< Capture/Compare 1 output polarity */
#define LPTIM_CCMR1_CC1P_0                  (0x1UL << LPTIM_CCMR1_CC1P_Pos)         /*!< 0x00000004 */
#define LPTIM_CCMR1_CC1P_1                  (0x2UL << LPTIM_CCMR1_CC1P_Pos)         /*!< 0x00000008 */
#define LPTIM_CCMR1_IC1PSC_Pos              (8UL)
#define LPTIM_CCMR1_IC1PSC_Msk              (0x3UL << LPTIM_CCMR1_IC1PSC_Pos)       /*!< 0x00000300 */
#define LPTIM_CCMR1_IC1PSC                  LPTIM_CCMR1_IC1PSC_Msk                  /*!< Input capture 1 prescaler */
#define LPTIM_CCMR1_IC1PSC_0                (0x1UL << LPTIM_CCMR1_IC1PSC_Pos)       /*!< 0x00000100 */
#define LPTIM_CCMR1_IC1PSC_1                (0x2UL << LPTIM_CCMR1_IC1PSC_Pos)       /*!< 0x00000200 */
#define LPTIM_CCMR1_IC1F_Pos                (12UL)
#define LPTIM_CCMR1_IC1F_Msk                (0x3UL << LPTIM_CCMR1_IC1F_Pos)         /*!< 0x00003000 */
#define LPTIM_CCMR1_IC1F                    LPTIM_CCMR1_IC1F_Msk                    /*!< Input capture 1 filter */
#define LPTIM_CCMR1_IC1F_0                  (0x1UL << LPTIM_CCMR1_IC1F_Pos)         /*!< 0x00001000 */
#define LPTIM_CCMR1_IC1F_1                  (0x2UL << LPTIM_CCMR1_IC1F_Pos)         /*!< 0x00002000 */
#define LPTIM_CCMR1_CC2SEL_Pos              (16UL)
#define LPTIM_CCMR1_CC2SEL_Msk              (0x1UL << LPTIM_CCMR1_CC2SEL_Pos)       /*!< 0x00010000 */
#define LPTIM_CCMR1_CC2SEL                  LPTIM_CCMR1_CC2SEL_Msk                  /*!< Capture/Compare 2 selection */
#define LPTIM_CCMR1_CC2E_Pos                (17UL)
#define LPTIM_CCMR1_CC2E_Msk                (0x1UL << LPTIM_CCMR1_CC2E_Pos)         /*!< 0x00020000 */
#define LPTIM_CCMR1_CC2E                    LPTIM_CCMR1_CC2E_Msk                    /*!< Capture/Compare 2 output enable */
#define LPTIM_CCMR1_CC2P_Pos                (18UL)
#define LPTIM_CCMR1_CC2P_Msk                (0x3UL << LPTIM_CCMR1_CC2P_Pos)         /*!< 0x000C0000 */
#define LPTIM_CCMR1_CC2P                    LPTIM_CCMR1_CC2P_Msk                    /*!< Capture/Compare 2 output polarity */
#define LPTIM_CCMR1_CC2P_0                  (0x1UL << LPTIM_CCMR1_CC2P_Pos)         /*!< 0x00040000 */
#define LPTIM_CCMR1_CC2P_1                  (0x2UL << LPTIM_CCMR1_CC2P_Pos)         /*!< 0x00080000 */
#define LPTIM_CCMR1_IC2PSC_Pos              (24UL)
#define LPTIM_CCMR1_IC2PSC_Msk              (0x3UL << LPTIM_CCMR1_IC2PSC_Pos)       /*!< 0x03000000 */
#define LPTIM_CCMR1_IC2PSC                  LPTIM_CCMR1_IC2PSC_Msk                  /*!< Input capture 2 prescaler */
#define LPTIM_CCMR1_IC2PSC_0                (0x1UL << LPTIM_CCMR1_IC2PSC_Pos)       /*!< 0x01000000 */
#define LPTIM_CCMR1_IC2PSC_1                (0x2UL << LPTIM_CCMR1_IC2PSC_Pos)       /*!< 0x02000000 */
#define LPTIM_CCMR1_IC2F_Pos                (28UL)
#define LPTIM_CCMR1_IC2F_Msk                (0x3UL << LPTIM_CCMR1_IC2F_Pos)         /*!< 0x30000000 */
#define LPTIM_CCMR1_IC2F                    LPTIM_CCMR1_IC2F_Msk                    /*!< Input capture 2 filter */
#define LPTIM_CCMR1_IC2F_0                  (0x1UL << LPTIM_CCMR1_IC2F_Pos)         /*!< 0x10000000 */
#define LPTIM_CCMR1_IC2F_1                  (0x2UL << LPTIM_CCMR1_IC2F_Pos)         /*!< 0x20000000 */

/******************  Bit definition for LPTIM_CCR2 register  ******************/
#define LPTIM_CCR2_CCR2_Pos                 (0UL)
#define LPTIM_CCR2_CCR2_Msk                 (0xFFFFUL << LPTIM_CCR2_CCR2_Pos)       /*!< 0x0000FFFF */
#define LPTIM_CCR2_CCR2                     LPTIM_CCR2_CCR2_Msk                     /*!< Compare register 2 */

#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
/******************************************************************************/
/*                                                                            */
/*                        OTFDEC register bank*/
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for OTFDEC_CR register  ********************/
#define OTFDEC_CR_ENC_Pos (0UL)
#define OTFDEC_CR_ENC_Msk (0x1UL << OTFDEC_CR_ENC_Pos) /*!< 0x00000001 */
#define OTFDEC_CR_ENC     OTFDEC_CR_ENC_Msk            /*!< ENC (Encryption mode bit) */

/********************  Bit definition for OTFDEC_PRIVCFGR register  ********************/
#define OTFDEC_PRIVCFGR_PRIV_Pos (0UL)
#define OTFDEC_PRIVCFGR_PRIV_Msk (0x1UL << OTFDEC_PRIVCFGR_PRIV_Pos) /*!< 0x00000001 */
#define OTFDEC_PRIVCFGR_PRIV     OTFDEC_PRIVCFGR_PRIV_Msk            /*!< PRIV (Privileged access protection.) */

/********************  Bit definition for OTFDEC_R1CFGR register  ********************/
#define OTFDEC_R1CFGR_REG_EN_Pos      (0UL)
#define OTFDEC_R1CFGR_REG_EN_Msk      (0x1UL << OTFDEC_R1CFGR_REG_EN_Pos)         /*!< 0x00000001 */
#define OTFDEC_R1CFGR_REG_EN          OTFDEC_R1CFGR_REG_EN_Msk                    /*!< REG_EN (region on-the-fly decryption enable) */
#define OTFDEC_R1CFGR_CONFIGLOCK_Pos  (1UL)
#define OTFDEC_R1CFGR_CONFIGLOCK_Msk  (0x1UL << OTFDEC_R1CFGR_CONFIGLOCK_Pos)     /*!< 0x00000002 */
#define OTFDEC_R1CFGR_CONFIGLOCK      OTFDEC_R1CFGR_CONFIGLOCK_Msk                /*!< CONFIGLOCK (region config lock) */
#define OTFDEC_R1CFGR_KEYLOCK_Pos     (2UL)
#define OTFDEC_R1CFGR_KEYLOCK_Msk     (0x1UL << OTFDEC_R1CFGR_KEYLOCK_Pos)        /*!< 0x00000004 */
#define OTFDEC_R1CFGR_KEYLOCK         OTFDEC_R1CFGR_KEYLOCK_Msk                   /*!< KEYLOCK (region key lock) */
#define OTFDEC_R1CFGR_MODE_Pos        (4UL)
#define OTFDEC_R1CFGR_MODE_Msk        (0x3UL << OTFDEC_R1CFGR_MODE_Pos)           /*!< 0x00000030 */
#define OTFDEC_R1CFGR_MODE            OTFDEC_R1CFGR_MODE_Msk                      /*!< MODE[1:0] bits (operating mode) */
#define OTFDEC_R1CFGR_MODE_0          (0x1UL << OTFDEC_R1CFGR_MODE_Pos)           /*!< 0x00000010 */
#define OTFDEC_R1CFGR_MODE_1          (0x2UL << OTFDEC_R1CFGR_MODE_Pos)           /*!< 0x00000020 */
#define OTFDEC_R1CFGR_KEYCRC_Pos      (8UL)
#define OTFDEC_R1CFGR_KEYCRC_Msk      (0xFFUL << OTFDEC_R1CFGR_KEYCRC_Pos)        /*!< 0x0000FF00 */
#define OTFDEC_R1CFGR_KEYCRC          OTFDEC_R1CFGR_KEYCRC_Msk                    /*!< KEYCRC[7:0] bits (region key 8-bit CRC) */
#define OTFDEC_R1CFGR_REG_VERSION_Pos (16UL)
#define OTFDEC_R1CFGR_REG_VERSION_Msk (0xFFFFUL << OTFDEC_R1CFGR_REG_VERSION_Pos) /*!< 0xFFFF0000 */
#define OTFDEC_R1CFGR_REG_VERSION     OTFDEC_R1CFGR_REG_VERSION_Msk               /*!< REG_VERSION[15:0] bits (region firmware version) */

/********************  Bit definition for OTFDEC_R1STARTADDR register  ********************/
#define OTFDEC_R1STARTADDR_REG_START_ADDR_Pos (0UL)
#define OTFDEC_R1STARTADDR_REG_START_ADDR_Msk (0xFFFFFFFFUL << OTFDEC_R1STARTADDR_REG_START_ADDR_Pos) /*!< 0xFFFFFFFF */
#define OTFDEC_R1STARTADDR_REG_START_ADDR     OTFDEC_R1STARTADDR_REG_START_ADDR_Msk                   /*!< REG_START_ADDR[31:0] bits (Region AHB start address) */

/********************  Bit definition for OTFDEC_R1ENDADDR register  ********************/
#define OTFDEC_R1ENDADDR_REG_END_ADDR_Pos (0UL)
#define OTFDEC_R1ENDADDR_REG_END_ADDR_Msk (0xFFFFFFFFUL << OTFDEC_R1ENDADDR_REG_END_ADDR_Pos) /*!< 0xFFFFFFFF */
#define OTFDEC_R1ENDADDR_REG_END_ADDR     OTFDEC_R1ENDADDR_REG_END_ADDR_Msk                   /*!< REG_END_ADDR[31:0] bits (Region AHB end address) */

/********************  Bit definition for OTFDEC_R1NONCER0 register  ********************/
/*!< REG_NONCE configuration */
#define OTFDEC_R1NONCER0_REG_NONCE_Pos (0UL)
#define OTFDEC_R1NONCER0_REG_NONCE_Msk (0xFFFFFFFFUL << OTFDEC_R1NONCER0_REG_NONCE_Pos) /*!< 0xFFFFFFFF */
#define OTFDEC_R1NONCER0_REG_NONCE     OTFDEC_R1NONCER0_REG_NONCE_Msk                   /*!< REG_NONCE[31:0] bits (Region nonce, bits [31:0]) */

