STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/********************  Bit definition for OTFDEC_R1NONCER1 register  ********************/
#define OTFDEC_R1NONCER1_REG_NONCE_Pos (0UL)
#define OTFDEC_R1NONCER1_REG_NONCE_Msk (0xFFFFFFFFUL << OTFDEC_R1NONCER1_REG_NONCE_Pos) /*!< 0xFFFFFFFF */
#define OTFDEC_R1NONCER1_REG_NONCE     OTFDEC_R1NONCER1_REG_NONCE_Msk                   /*!< REG_NONCE[31:0] bits (Region nonce, bits [63:32]) */

/********************  Bit definition for OTFDEC_R1KEYR0 register  ********************/
#define OTFDEC_R1KEYR0_REG_KEY_Pos (0UL)
#define OTFDEC_R1KEYR0_REG_KEY_Msk (0xFFFFFFFFUL << OTFDEC_R1KEYR0_REG_KEY_Pos) /*!< 0xFFFFFFFF */
#define OTFDEC_R1KEYR0_REG_KEY     OTFDEC_R1KEYR0_REG_KEY_Msk                   /*!< REG_KEY[31:0] bits (Region key, bits [31:0]) */

/********************  Bit definition for OTFDEC_R1KEYR1 register  ********************/
#define OTFDEC_R1KEYR1_REG_KEY_Pos (0UL)
#define OTFDEC_R1KEYR1_REG_KEY_Msk (0xFFFFFFFFUL << OTFDEC_R1KEYR1_REG_KEY_Pos) /*!< 0xFFFFFFFF */
#define OTFDEC_R1KEYR1_REG_KEY     OTFDEC_R1KEYR1_REG_KEY_Msk                   /*!< REG_KEY[31:0] bits (Region key, bits [63:32]) */

/********************  Bit definition for OTFDEC_R1KEYR2 register  ********************/
#define OTFDEC_R1KEYR2_REG_KEY_Pos (0UL)
#define OTFDEC_R1KEYR2_REG_KEY_Msk (0xFFFFFFFFUL << OTFDEC_R1KEYR2_REG_KEY_Pos) /*!< 0xFFFFFFFF */
#define OTFDEC_R1KEYR2_REG_KEY     OTFDEC_R1KEYR2_REG_KEY_Msk                   /*!< REG_KEY[31:0] bits (Region key, bits [95:64]) */

/********************  Bit definition for OTFDEC_R1KEYR3 register  ********************/
#define OTFDEC_R1KEYR3_REG_KEY_Pos (0UL)
#define OTFDEC_R1KEYR3_REG_KEY_Msk (0xFFFFFFFFUL << OTFDEC_R1KEYR3_REG_KEY_Pos) /*!< 0xFFFFFFFF */
#define OTFDEC_R1KEYR3_REG_KEY     OTFDEC_R1KEYR3_REG_KEY_Msk                   /*!< REG_KEY[31:0] bits (Region key, bits [127:96]) */

/********************  Bit definition for OTFDEC_ISR register  ********************/
#define OTFDEC_ISR_SEIF_Pos   (0UL)
#define OTFDEC_ISR_SEIF_Msk   (0x1UL << OTFDEC_ISR_SEIF_Pos)   /*!< 0x00000001 */
#define OTFDEC_ISR_SEIF       OTFDEC_ISR_SEIF_Msk              /*!< SEIF (Security error interrupt flag status) */
#define OTFDEC_ISR_XONEIF_Pos (1UL)
#define OTFDEC_ISR_XONEIF_Msk (0x1UL << OTFDEC_ISR_XONEIF_Pos) /*!< 0x00000002 */
#define OTFDEC_ISR_XONEIF     OTFDEC_ISR_XONEIF_Msk            /*!< XONEIF (Execute-only execute-never error interrupt flag status) */
#define OTFDEC_ISR_KEIF_Pos   (2UL)
#define OTFDEC_ISR_KEIF_Msk   (0x1UL << OTFDEC_ISR_KEIF_Pos)   /*!< 0x00000004 */
#define OTFDEC_ISR_KEIF       OTFDEC_ISR_KEIF_Msk              /*!< KEIF (Key error interrupt flag status) */

/********************  Bit definition for OTFDEC_ICR register  ********************/
#define OTFDEC_ICR_SEIF_Pos   (0UL)
#define OTFDEC_ICR_SEIF_Msk   (0x1UL << OTFDEC_ICR_SEIF_Pos)   /*!< 0x00000001 */
#define OTFDEC_ICR_SEIF       OTFDEC_ICR_SEIF_Msk              /*!< SEIF (Security error interrupt flag clear) */
#define OTFDEC_ICR_XONEIF_Pos (1UL)
#define OTFDEC_ICR_XONEIF_Msk (0x1UL << OTFDEC_ICR_XONEIF_Pos) /*!< 0x00000002 */
#define OTFDEC_ICR_XONEIF     OTFDEC_ICR_XONEIF_Msk            /*!< XONEIF (Execute-only execute-never error interrupt flag clear) */
#define OTFDEC_ICR_KEIF_Pos   (2UL)
#define OTFDEC_ICR_KEIF_Msk   (0x1UL << OTFDEC_ICR_KEIF_Pos)   /*!< 0x00000004 */
#define OTFDEC_ICR_KEIF       OTFDEC_ICR_KEIF_Msk              /*!< KEIF (Key error interrupt flag clear) */

/********************  Bit definition for OTFDEC_IER register  ********************/
#define OTFDEC_IER_SEIE_Pos   (0UL)
#define OTFDEC_IER_SEIE_Msk   (0x1UL << OTFDEC_IER_SEIE_Pos)   /*!< 0x00000001 */
#define OTFDEC_IER_SEIE       OTFDEC_IER_SEIE_Msk              /*!< SEIE (Security error interrupt enable) */
#define OTFDEC_IER_XONEIE_Pos (1UL)
#define OTFDEC_IER_XONEIE_Msk (0x1UL << OTFDEC_IER_XONEIE_Pos) /*!< 0x00000002 */
#define OTFDEC_IER_XONEIE     OTFDEC_IER_XONEIE_Msk            /*!< XONEIE (Execute-only execute-never error interrupt enable) */
#define OTFDEC_IER_KEIE_Pos   (2UL)
#define OTFDEC_IER_KEIE_Msk   (0x1UL << OTFDEC_IER_KEIE_Pos)   /*!< 0x00000004 */
#define OTFDEC_IER_KEIE       OTFDEC_IER_KEIE_Msk              /*!< KEIE (Key error interrupt enable) */

#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#if $WBA_CRYPTO$
/******************************************************************************/
/*                                                                            */
/*                       Public Key Accelerator (PKA)                         */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for PKA_CR register  *********************/
#define PKA_CR_EN_Pos                       (0UL)
#define PKA_CR_EN_Msk                       (0x1UL << PKA_CR_EN_Pos)                /*!< 0x00000001 */
#define PKA_CR_EN                           PKA_CR_EN_Msk                           /*!< PKA enable */
#define PKA_CR_START_Pos                    (1UL)
#define PKA_CR_START_Msk                    (0x1UL << PKA_CR_START_Pos)             /*!< 0x00000002 */
#define PKA_CR_START                        PKA_CR_START_Msk                        /*!< Start operation */
#define PKA_CR_MODE_Pos                     (8UL)
#define PKA_CR_MODE_Msk                     (0x3FUL << PKA_CR_MODE_Pos)             /*!< 0x00003F00 */
#define PKA_CR_MODE                         PKA_CR_MODE_Msk                         /*!< MODE[5:0] PKA operation code */
#define PKA_CR_MODE_0                       (0x01UL << PKA_CR_MODE_Pos)             /*!< 0x00000100 */
#define PKA_CR_MODE_1                       (0x02UL << PKA_CR_MODE_Pos)             /*!< 0x00000200 */
#define PKA_CR_MODE_2                       (0x04UL << PKA_CR_MODE_Pos)             /*!< 0x00000400 */
#define PKA_CR_MODE_3                       (0x08UL << PKA_CR_MODE_Pos)             /*!< 0x00000800 */
#define PKA_CR_MODE_4                       (0x10UL << PKA_CR_MODE_Pos)             /*!< 0x00001000 */
#define PKA_CR_MODE_5                       (0x20UL << PKA_CR_MODE_Pos)             /*!< 0x00002000 */
#define PKA_CR_PROCENDIE_Pos                (17UL)
#define PKA_CR_PROCENDIE_Msk                (0x1UL << PKA_CR_PROCENDIE_Pos)         /*!< 0x00020000 */
#define PKA_CR_PROCENDIE                    PKA_CR_PROCENDIE_Msk                    /*!< End of operation interrupt enable */
#define PKA_CR_RAMERRIE_Pos                 (19UL)
#define PKA_CR_RAMERRIE_Msk                 (0x1UL << PKA_CR_RAMERRIE_Pos)          /*!< 0x00080000 */
#define PKA_CR_RAMERRIE                     PKA_CR_RAMERRIE_Msk                     /*!< RAM error interrupt enable */
#define PKA_CR_ADDRERRIE_Pos                (20UL)
#define PKA_CR_ADDRERRIE_Msk                (0x1UL << PKA_CR_ADDRERRIE_Pos)         /*!< 0x00100000 */
#define PKA_CR_ADDRERRIE                    PKA_CR_ADDRERRIE_Msk                    /*!< Address error interrupt enable */
#define PKA_CR_OPERRIE_Pos                  (21UL)
#define PKA_CR_OPERRIE_Msk                  (0x1UL << PKA_CR_OPERRIE_Pos)           /*!< 0x00200000 */
#define PKA_CR_OPERRIE                      PKA_CR_OPERRIE_Msk                      /*!< Operation Error interrupt enable */

