STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/********************  Bit definition for PWR_IORETRD register  *****************/
#if defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)

#define PWR_IORETRD_RET0_Pos                (0UL)
#define PWR_IORETRD_RET0_Msk                (0x1UL << PWR_IORETRD_RET0_Pos)             /*!< 0x00000001 */
#define PWR_IORETRD_RET0                    PWR_IORETRD_RET0_Msk                        /*!< Standby GPIO retention status for PD0 */
#define PWR_IORETRD_RET1_Pos                (1UL)
#define PWR_IORETRD_RET1_Msk                (0x1UL << PWR_IORETRD_RET1_Pos)             /*!< 0x00000002 */
#define PWR_IORETRD_RET1                    PWR_IORETRD_RET1_Msk                        /*!< Standby GPIO retention status for PD1 */
#define PWR_IORETRD_RET2_Pos                (2UL)
#define PWR_IORETRD_RET2_Msk                (0x1UL << PWR_IORETRD_RET2_Pos)             /*!< 0x00000004 */
#define PWR_IORETRD_RET2                    PWR_IORETRD_RET2_Msk                        /*!< Standby GPIO retention status for PD2 */
#define PWR_IORETRD_RET3_Pos                (3UL)
#define PWR_IORETRD_RET3_Msk                (0x1UL << PWR_IORETRD_RET3_Pos)             /*!< 0x00000008 */
#define PWR_IORETRD_RET3                    PWR_IORETRD_RET3_Msk                        /*!< Standby GPIO retention status for PD3 */
#define PWR_IORETRD_RET4_Pos                (4UL)
#define PWR_IORETRD_RET4_Msk                (0x1UL << PWR_IORETRD_RET4_Pos)             /*!< 0x00000010 */
#define PWR_IORETRD_RET4                    PWR_IORETRD_RET4_Msk                        /*!< Standby GPIO retention status for PD4 */
#define PWR_IORETRD_RET5_Pos                (5UL)
#define PWR_IORETRD_RET5_Msk                (0x1UL << PWR_IORETRD_RET5_Pos)             /*!< 0x00000020 */
#define PWR_IORETRD_RET5                    PWR_IORETRD_RET5_Msk                        /*!< Standby GPIO retention status for PD5 */
#endif /* defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx) */
#define PWR_IORETRD_RET6_Pos                (6UL)
#define PWR_IORETRD_RET6_Msk                (0x1UL << PWR_IORETRD_RET6_Pos)             /*!< 0x00000040 */
#define PWR_IORETRD_RET6                    PWR_IORETRD_RET6_Msk                        /*!< Standby GPIO retention status for PD6 */
#define PWR_IORETRD_RET7_Pos                (7UL)
#define PWR_IORETRD_RET7_Msk                (0x1UL << PWR_IORETRD_RET7_Pos)             /*!< 0x00000080 */
#define PWR_IORETRD_RET7                    PWR_IORETRD_RET7_Msk                        /*!< Standby GPIO retention status for PD7 */
#define PWR_IORETRD_RET8_Pos                (8UL)
#define PWR_IORETRD_RET8_Msk                (0x1UL << PWR_IORETRD_RET8_Pos)             /*!< 0x00000100 */
#define PWR_IORETRD_RET8                    PWR_IORETRD_RET8_Msk                        /*!< Standby GPIO retention status for PD8 */
#define PWR_IORETRD_RET9_Pos                (9UL)
#define PWR_IORETRD_RET9_Msk                (0x1UL << PWR_IORETRD_RET9_Pos)             /*!< 0x00000200 */
#define PWR_IORETRD_RET9                    PWR_IORETRD_RET9_Msk                        /*!< Standby GPIO retention status for PD9 */
#if defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define PWR_IORETRD_RET10_Pos               (10UL)
#define PWR_IORETRD_RET10_Msk               (0x1UL << PWR_IORETRD_RET10_Pos)           /*!< 0x00000400 */
#define PWR_IORETRD_RET10                   PWR_IORETRD_RET10_Msk                      /*!< Standby GPIO retention status for PD10 */
#define PWR_IORETRD_RET11_Pos               (11UL)
#define PWR_IORETRD_RET11_Msk               (0x1UL << PWR_IORETRD_RET11_Pos)           /*!< 0x00000800 */
#define PWR_IORETRD_RET11                   PWR_IORETRD_RET11_Msk                      /*!< Standby GPIO retention status for PD11 */
#define PWR_IORETRD_RET12_Pos               (12UL)
#define PWR_IORETRD_RET12_Msk               (0x1UL << PWR_IORETRD_RET12_Pos)           /*!< 0x00001000 */
#define PWR_IORETRD_RET12                   PWR_IORETRD_RET12_Msk                      /*!< Standby GPIO retention status for PD12 */
#define PWR_IORETRD_RET13_Pos               (13UL)
#define PWR_IORETRD_RET13_Msk               (0x1UL << PWR_IORETRD_RET13_Pos)           /*!< 0x00002000 */
#define PWR_IORETRD_RET13                   PWR_IORETRD_RET13_Msk                      /*!< Standby GPIO retention status for PD13 */
#define PWR_IORETRD_RET14_Pos               (14UL)
#define PWR_IORETRD_RET14_Msk               (0x1UL << PWR_IORETRD_RET14_Pos)            /*!< 0x00004000 */
#define PWR_IORETRD_RET14                   PWR_IORETRD_RET14_Msk                       /*!< Standby GPIO retention status for PD14 */
#define PWR_IORETRD_RET15_Pos               (15UL)
#define PWR_IORETRD_RET15_Msk               (0x1UL << PWR_IORETRD_RET15_Pos)           /*!< 0x00008000 */
#define PWR_IORETRD_RET15                   PWR_IORETRD_RET15_Msk                      /*!< Standby GPIO retention status for PD15 */
#endif /* defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx) */
#endif /* defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx) */
#if defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
/********************  Bit definition for PWR_IORETENRE register  *****************/
#define PWR_IORETENRE_EN0_Pos               (0UL)
#define PWR_IORETENRE_EN0_Msk               (0x1UL << PWR_IORETENRE_EN0_Pos)           /*!< 0x00000001 */
#define PWR_IORETENRE_EN0                   PWR_IORETENRE_EN0_Msk                      /*!< Standby GPIO retention enable for PE0 */
#define PWR_IORETENRE_EN1_Pos               (1UL)
#define PWR_IORETENRE_EN1_Msk               (0x1UL << PWR_IORETENRE_EN1_Pos)           /*!< 0x00000002 */
#define PWR_IORETENRE_EN1                   PWR_IORETENRE_EN1_Msk                      /*!< Standby GPIO retention enable for PE1 */
#define PWR_IORETENRE_EN2_Pos               (2UL)
#define PWR_IORETENRE_EN2_Msk               (0x1UL << PWR_IORETENRE_EN2_Pos)           /*!< 0x00000004 */
#define PWR_IORETENRE_EN2                   PWR_IORETENRE_EN2_Msk                      /*!< Standby GPIO retention enable for PE2 */
#define PWR_IORETENRE_EN3_Pos               (3UL)
#define PWR_IORETENRE_EN3_Msk               (0x1UL << PWR_IORETENRE_EN3_Pos)           /*!< 0x00000008 */
#define PWR_IORETENRE_EN3                   PWR_IORETENRE_EN3_Msk                      /*!< Standby GPIO retention enable for PE3 */
#define PWR_IORETENRE_EN4_Pos               (4UL)
#define PWR_IORETENRE_EN4_Msk               (0x1UL << PWR_IORETENRE_EN4_Pos)           /*!< 0x00000010 */
#define PWR_IORETENRE_EN4                   PWR_IORETENRE_EN4_Msk                      /*!< Standby GPIO retention enable for PE4 */
#define PWR_IORETENRE_EN5_Pos               (5UL)
#define PWR_IORETENRE_EN5_Msk               (0x1UL << PWR_IORETENRE_EN5_Pos)           /*!< 0x00000020 */
#define PWR_IORETENRE_EN5                   PWR_IORETENRE_EN5_Msk                      /*!< Standby GPIO retention enable for PE5 */
#define PWR_IORETENRE_EN6_Pos               (6UL)
#define PWR_IORETENRE_EN6_Msk               (0x1UL << PWR_IORETENRE_EN6_Pos)           /*!< 0x00000040 */
#define PWR_IORETENRE_EN6                   PWR_IORETENRE_EN6_Msk                      /*!< Standby GPIO retention enable for PE6 */

