STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/********************  Bit definition for PWR_IORETRG register  *****************/
#define PWR_IORETRG_EN2_Pos                 (2UL)
#define PWR_IORETRG_EN2_Msk                 (0x1UL << PWR_IORETRG_EN2_Pos)             /*!< 0x00000004 */
#define PWR_IORETRG_EN2                     PWR_IORETRG_EN2_Msk                        /*!< Standby GPIO retention status for PG2 */
#define PWR_IORETRG_EN3_Pos                 (3UL)
#define PWR_IORETRG_EN3_Msk                 (0x1UL << PWR_IORETRG_EN3_Pos)             /*!< 0x00000008 */
#define PWR_IORETRG_EN3                     PWR_IORETRG_EN3_Msk                        /*!< Standby GPIO retention status for PG3 */
#define PWR_IORETRG_EN4_Pos                 (4UL)
#define PWR_IORETRG_EN4_Msk                 (0x1UL << PWR_IORETRG_EN4_Pos)             /*!< 0x00000010 */
#define PWR_IORETRG_EN4                     PWR_IORETRG_EN4_Msk                        /*!< Standby GPIO retention status for PG4 */
#define PWR_IORETRG_EN5_Pos                 (5UL)
#define PWR_IORETRG_EN5_Msk                 (0x1UL << PWR_IORETRG_EN5_Pos)             /*!< 0x00000020 */
#define PWR_IORETRG_EN5                     PWR_IORETRG_EN5_Msk                        /*!< Standby GPIO retention status for PG5 */
#define PWR_IORETRG_EN6_Pos                 (6UL)
#define PWR_IORETRG_EN6_Msk                 (0x1UL << PWR_IORETRG_EN6_Pos)             /*!< 0x00000040 */
#define PWR_IORETRG_EN6                     PWR_IORETRG_EN6_Msk                        /*!< Standby GPIO retention status for PG6 */
#define PWR_IORETRG_EN7_Pos                 (7UL)
#define PWR_IORETRG_EN7_Msk                 (0x1UL << PWR_IORETRG_EN7_Pos)             /*!< 0x00000080 */
#define PWR_IORETRG_EN7                     PWR_IORETRG_EN7_Msk                        /*!< Standby GPIO retention status for PG7 */
#define PWR_IORETRG_EN8_Pos                 (8UL)
#define PWR_IORETRG_EN8_Msk                 (0x1UL << PWR_IORETRG_EN8_Pos)             /*!< 0x00000100 */
#define PWR_IORETRG_EN8                     PWR_IORETRG_EN8_Msk                        /*!< Standby GPIO retention status for PG8 */
#define PWR_IORETRG_EN9_Pos                 (9UL)
#define PWR_IORETRG_EN9_Msk                 (0x1UL << PWR_IORETRG_EN9_Pos)             /*!< 0x00000200 */
#define PWR_IORETRG_EN9                     PWR_IORETRG_EN9_Msk                        /*!< Standby GPIO retention status for PG9 */
#define PWR_IORETRG_EN10_Pos                (10UL)
#define PWR_IORETRG_EN10_Msk                (0x1UL << PWR_IORETRG_EN10_Pos)            /*!< 0x00000400 */
#define PWR_IORETRG_EN10                    PWR_IORETRG_EN10_Msk                       /*!< Standby GPIO retention status for PG10 */
#define PWR_IORETRG_EN11_Pos                (11UL)
#define PWR_IORETRG_EN11_Msk                (0x1UL << PWR_IORETRG_EN11_Pos)            /*!< 0x00000800 */
#define PWR_IORETRG_EN11                    PWR_IORETRG_EN11_Msk                       /*!< Standby GPIO retention status for PG11 */
#define PWR_IORETRG_EN12_Pos                (12UL)
#define PWR_IORETRG_EN12_Msk                (0x1UL << PWR_IORETRG_EN12_Pos)            /*!< 0x00001000 */
#define PWR_IORETRG_EN12                    PWR_IORETRG_EN12_Msk                       /*!< Standby GPIO retention status for PG12 */
#define PWR_IORETRG_EN13_Pos                (13UL)
#define PWR_IORETRG_EN13_Msk                (0x1UL << PWR_IORETRG_EN13_Pos)            /*!< 0x00002000 */
#define PWR_IORETRG_EN13                    PWR_IORETRG_EN13_Msk                       /*!< Standby GPIO retention status for PG13 */
#define PWR_IORETRG_EN14_Pos                (14UL)
#define PWR_IORETRG_EN14_Msk                (0x1UL << PWR_IORETRG_EN14_Pos)            /*!< 0x00004000 */
#define PWR_IORETRG_EN14                    PWR_IORETRG_EN14_Msk                       /*!< Standby GPIO retention status for PG14 */
#define PWR_IORETRG_EN15_Pos                (15UL)
#define PWR_IORETRG_EN15_Msk                (0x1UL << PWR_IORETRG_EN15_Pos)            /*!< 0x00008000 */
#define PWR_IORETRG_EN15                    PWR_IORETRG_EN15_Msk                       /*!< Standby GPIO retention status for PG15 */
#endif /* defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx) */

/********************  Bit definition for PWR_IORETENRH register  *****************/
#define PWR_IORETENRH_EN3_Pos               (3UL)
#define PWR_IORETENRH_EN3_Msk               (0x1UL << PWR_IORETENRH_EN3_Pos)           /*!< 0x00000008 */
#define PWR_IORETENRH_EN3                   PWR_IORETENRH_EN3_Msk                      /*!< Standby GPIO retention enable for PH3 */

/********************  Bit definition for PWR_IORETRH register  *****************/
#define PWR_IORETRH_RET3_Pos                (3UL)
#define PWR_IORETRH_RET3_Msk                (0x1UL << PWR_IORETRH_RET3_Pos)            /*!< 0x00000008 */
#define PWR_IORETRH_RET3                    PWR_IORETRH_RET3_Msk                       /*!< Standby GPIO retention status for PH3 */

/********************  Bit definition for PWR_RADIOSCR register  *****************/
#define PWR_RADIOSCR_MODE_Pos               (0UL)
#define PWR_RADIOSCR_MODE_Msk               (0x3UL << PWR_RADIOSCR_MODE_Pos)            /*!< 0x00000003 */
#define PWR_RADIOSCR_MODE                   PWR_RADIOSCR_MODE_Msk                       /*!< 2.4 GHz RADIO operating mode */
#define PWR_RADIOSCR_MODE_0                 (0x1UL << PWR_RADIOSCR_MODE_Pos)            /*!< 0x00000001 */
#define PWR_RADIOSCR_MODE_1                 (0x2UL << PWR_RADIOSCR_MODE_Pos)            /*!< 0x00000002 */
#define PWR_RADIOSCR_PHYMODE_Pos            (2UL)
#define PWR_RADIOSCR_PHYMODE_Msk            (0x1UL << PWR_RADIOSCR_PHYMODE_Pos)         /*!< 0x00000004 */
#define PWR_RADIOSCR_PHYMODE                PWR_RADIOSCR_PHYMODE_Msk                    /*!< 2.4 GHz RADIO PHY operating mode */
#define PWR_RADIOSCR_ENCMODE_Pos            (3UL)
#define PWR_RADIOSCR_ENCMODE_Msk            (0x1UL << PWR_RADIOSCR_ENCMODE_Pos)         /*!< 0x00000008 */
#define PWR_RADIOSCR_ENCMODE                PWR_RADIOSCR_ENCMODE_Msk                    /*!< 2.4 GHz RADIO encryption function operating mode */
#define PWR_RADIOSCR_RFVDDHPA_Pos           (8UL)
#define PWR_RADIOSCR_RFVDDHPA_Msk           (0x1FUL << PWR_RADIOSCR_RFVDDHPA_Pos)       /*!< 0x00001F00 */
#define PWR_RADIOSCR_RFVDDHPA               PWR_RADIOSCR_RFVDDHPA_Msk                   /*!< 2.4 GHz RADIO VDDHPA control word */
#if defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA63xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define PWR_RADIOSCR_REGPARDYV11_Pos        (14UL)
#define PWR_RADIOSCR_REGPARDYV11_Msk        (0x1UL << PWR_RADIOSCR_REGPARDYV11_Pos)     /*!< 0x00004000 */
#define PWR_RADIOSCR_REGPARDYV11            PWR_RADIOSCR_REGPARDYV11_Msk                /*!< Ready bit for VDDHPA voltage level when selecting VDDRFPA input */
#endif /* defined (STM32WBA55xx) || defined (STM32WBA63xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx) */
#define PWR_RADIOSCR_REGPARDYVDDRFPA_Pos    (15UL)
#define PWR_RADIOSCR_REGPARDYVDDRFPA_Msk    (0x1UL << PWR_RADIOSCR_REGPARDYVDDRFPA_Pos) /*!< 0x00008000 */
#define PWR_RADIOSCR_REGPARDYVDDRFPA        PWR_RADIOSCR_REGPARDYVDDRFPA_Msk            /*!< Ready bit for VDDHPA voltage level when selecting VDDRFPA input */
#if $WBA_VDDHPA_BYPASS$
#define PWR_RADIOSCR_REGPASEL_Pos           (23UL)
#define PWR_RADIOSCR_REGPASEL_Msk           (0x1UL << PWR_RADIOSCR_REGPASEL_Pos)        /*!< 0x00800000 */
#define PWR_RADIOSCR_REGPASEL               PWR_RADIOSCR_REGPASEL_Msk                   /*!< Regulator REG_VDDHPA input supply selection */
#define PWR_RADIOSCR_REGPABYPEN_Pos         (24UL)
#define PWR_RADIOSCR_REGPABYPEN_Msk         (0x1UL << PWR_RADIOSCR_REGPABYPEN_Pos)      /*!< 0x01000000 */
#define PWR_RADIOSCR_REGPABYPEN             PWR_RADIOSCR_REGPABYPEN_Msk                 /*!< Regulator REG_VDDHPA bypass enable.*/
#endif /* WBA_VDDHPA_BYPASS */

