STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/********************  Bit definition for RCC_AHB1SMENR register  **************/
#if defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define RCC_AHB1SMENR_LPDMA1SMEN_Pos        (0UL)
#define RCC_AHB1SMENR_LPDMA1SMEN_Msk        (0x1UL << RCC_AHB1SMENR_LPDMA1SMEN_Pos) /*!< 0x00000001*/
#define RCC_AHB1SMENR_LPDMA1SMEN            RCC_AHB1SMENR_LPDMA1SMEN_Msk
#else /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define RCC_AHB1SMENR_GPDMA1SMEN_Pos        (0UL)
#define RCC_AHB1SMENR_GPDMA1SMEN_Msk        (0x1UL << RCC_AHB1SMENR_GPDMA1SMEN_Pos) /*!< 0x00000000*/
#define RCC_AHB1SMENR_GPDMA1SMEN            RCC_AHB1SMENR_GPDMA1SMEN_Msk
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define RCC_AHB1SMENR_FLASHSMEN_Pos         (8UL)
#define RCC_AHB1SMENR_FLASHSMEN_Msk         (0x1UL << RCC_AHB1SMENR_FLASHSMEN_Pos)  /*!< 0x00000100 */
#define RCC_AHB1SMENR_FLASHSMEN             RCC_AHB1SMENR_FLASHSMEN_Msk
#define RCC_AHB1SMENR_CRCSMEN_Pos           (12UL)
#define RCC_AHB1SMENR_CRCSMEN_Msk           (0x1UL << RCC_AHB1SMENR_CRCSMEN_Pos)    /*!< 0x00001000 */
#define RCC_AHB1SMENR_CRCSMEN               RCC_AHB1SMENR_CRCSMEN_Msk
#if !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define RCC_AHB1SMENR_TSCSMEN_Pos           (16UL)
#define RCC_AHB1SMENR_TSCSMEN_Msk           (0x1UL << RCC_AHB1SMENR_TSCSMEN_Pos)    /*!< 0x00010000 */
#define RCC_AHB1SMENR_TSCSMEN               RCC_AHB1SMENR_TSCSMEN_Msk
#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define RCC_AHB1SMENR_RAMCFGSMEN_Pos        (17UL)
#define RCC_AHB1SMENR_RAMCFGSMEN_Msk        (0x1UL << RCC_AHB1SMENR_RAMCFGSMEN_Pos) /*!< 0x00020000 */
#define RCC_AHB1SMENR_RAMCFGSMEN            RCC_AHB1SMENR_RAMCFGSMEN_Msk
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) || defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define RCC_AHB1SMENR_GTZC1SMEN_Pos         (24UL)
#define RCC_AHB1SMENR_GTZC1SMEN_Msk         (0x1UL << RCC_AHB1SMENR_GTZC1SMEN_Pos)  /*!< 0x01000000 */
#define RCC_AHB1SMENR_GTZC1SMEN             RCC_AHB1SMENR_GTZC1SMEN_Msk
#endif
#define RCC_AHB1SMENR_ICACHESMEN_Pos        (29UL)
#define RCC_AHB1SMENR_ICACHESMEN_Msk        (0x1UL << RCC_AHB1SMENR_ICACHESMEN_Pos) /*!< 0x20000000 */
#define RCC_AHB1SMENR_ICACHESMEN            RCC_AHB1SMENR_ICACHESMEN_Msk
#define RCC_AHB1SMENR_SRAM1SMEN_Pos         (31UL)
#define RCC_AHB1SMENR_SRAM1SMEN_Msk         (0x1UL << RCC_AHB1SMENR_SRAM1SMEN_Pos)  /*!< 0x80000000 */
#define RCC_AHB1SMENR_SRAM1SMEN             RCC_AHB1SMENR_SRAM1SMEN_Msk

/********************  Bit definition for RCC_AHB2SMENR register  **************/
#define RCC_AHB2SMENR_GPIOASMEN_Pos         (0UL)
#define RCC_AHB2SMENR_GPIOASMEN_Msk         (0x1UL << RCC_AHB2SMENR_GPIOASMEN_Pos)  /*!< 0x00000001 */
#define RCC_AHB2SMENR_GPIOASMEN             RCC_AHB2SMENR_GPIOASMEN_Msk
#define RCC_AHB2SMENR_GPIOBSMEN_Pos         (1UL)
#define RCC_AHB2SMENR_GPIOBSMEN_Msk         (0x1UL << RCC_AHB2SMENR_GPIOBSMEN_Pos)  /*!< 0x00000002 */
#define RCC_AHB2SMENR_GPIOBSMEN             RCC_AHB2SMENR_GPIOBSMEN_Msk
#define RCC_AHB2SMENR_GPIOCSMEN_Pos         (2UL)
#define RCC_AHB2SMENR_GPIOCSMEN_Msk         (0x1UL << RCC_AHB2SMENR_GPIOCSMEN_Pos)  /*!< 0x00000004 */
#define RCC_AHB2SMENR_GPIOCSMEN             RCC_AHB2SMENR_GPIOCSMEN_Msk
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define RCC_AHB2SMENR_GPIODSMEN_Pos         (3UL)
#define RCC_AHB2SMENR_GPIODSMEN_Msk         (0x1UL << RCC_AHB2SMENR_GPIODSMEN_Pos)  /*!< 0x00000008 */
#define RCC_AHB2SMENR_GPIODSMEN             RCC_AHB2SMENR_GPIODSMEN_Msk
#endif
#if defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define RCC_AHB2SMENR_GPIOESMEN_Pos         (4UL)
#define RCC_AHB2SMENR_GPIOESMEN_Msk         (0x1UL << RCC_AHB2SMENR_GPIOESMEN_Pos)  /*!< 0x00000010 */
#define RCC_AHB2SMENR_GPIOESMEN             RCC_AHB2SMENR_GPIOESMEN_Msk
#define RCC_AHB2SMENR_GPIOGSMEN_Pos         (6UL)
#define RCC_AHB2SMENR_GPIOGSMEN_Msk         (0x1UL << RCC_AHB2SMENR_GPIOGSMEN_Pos)  /*!< 0x00000040 */
#define RCC_AHB2SMENR_GPIOGSMEN             RCC_AHB2SMENR_GPIOGSMEN_Msk
#endif
#define RCC_AHB2SMENR_GPIOHSMEN_Pos         (7UL)
#define RCC_AHB2SMENR_GPIOHSMEN_Msk         (0x1UL << RCC_AHB2SMENR_GPIOHSMEN_Pos)  /*!< 0x00000080 */
#define RCC_AHB2SMENR_GPIOHSMEN             RCC_AHB2SMENR_GPIOHSMEN_Msk
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define RCC_AHB2SMENR_OTGSMEN_Pos           (14UL)
#define RCC_AHB2SMENR_OTGSMEN_Msk           (0x1UL << RCC_AHB2SMENR_OTGSMEN_Pos)    /*!< 0x00004000 */
#define RCC_AHB2SMENR_OTGSMEN               RCC_AHB2SMENR_OTGSMEN_Msk
#define RCC_AHB2SMENR_OTGHSPHYSMEN_Pos      (15UL)
#define RCC_AHB2SMENR_OTGHSPHYSMEN_Msk      (0x1UL << RCC_AHB2SMENR_OTGHSPHYSMEN_Pos) /*!< 0x00008000 */
#define RCC_AHB2SMENR_OTGHSPHYSMEN          RCC_AHB2SMENR_OTGHSPHYSMEN_Msk
#endif
#define RCC_AHB2SMENR_AESSMEN_Pos           (16UL)
#define RCC_AHB2SMENR_AESSMEN_Msk           (0x1UL << RCC_AHB2SMENR_AESSMEN_Pos)    /*!< 0x00010000 */
#define RCC_AHB2SMENR_AESSMEN               RCC_AHB2SMENR_AESSMEN_Msk
#define RCC_AHB2SMENR_HASHSMEN_Pos          (17UL)
#define RCC_AHB2SMENR_HASHSMEN_Msk          (0x1UL << RCC_AHB2SMENR_HASHSMEN_Pos)   /*!< 0x00020000 */
#define RCC_AHB2SMENR_HASHSMEN              RCC_AHB2SMENR_HASHSMEN_Msk
#define RCC_AHB2SMENR_RNGSMEN_Pos           (18UL)
#define RCC_AHB2SMENR_RNGSMEN_Msk           (0x1UL << RCC_AHB2SMENR_RNGSMEN_Pos)    /*!< 0x00040000 */
#define RCC_AHB2SMENR_RNGSMEN               RCC_AHB2SMENR_RNGSMEN_Msk
#if defined (STM32WBA52xx) || defined (STM32WBA54xx) || defined (STM32WBA55xx) || defined (STM32WBA5Mxx) || defined (STM32WBA62xx) || defined (STM32WBA63xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define RCC_AHB2SMENR_SAESSMEN_Pos          (19UL)
#define RCC_AHB2SMENR_SAESSMEN_Msk          (0x1UL << RCC_AHB2SMENR_SAESSMEN_Pos)   /*!< 0x00080000 */
#define RCC_AHB2SMENR_SAESSMEN              RCC_AHB2SMENR_SAESSMEN_Msk
#endif
#define RCC_AHB2SMENR_PKASMEN_Pos           (21UL)
#define RCC_AHB2SMENR_PKASMEN_Msk           (0x1UL << RCC_AHB2SMENR_PKASMEN_Pos)    /*!< 0x00200000 */
#define RCC_AHB2SMENR_PKASMEN               RCC_AHB2SMENR_PKASMEN_Msk
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define RCC_AHB2SMENR_OTFDEC1SMEN_Pos       (23UL)
#define RCC_AHB2SMENR_OTFDEC1SMEN_Msk       (0x1UL << RCC_AHB2SMENR_OTFDEC1SMEN_Pos) /*!< 0x00800000 */
#define RCC_AHB2SMENR_OTFDEC1SMEN           RCC_AHB2SMENR_OTFDEC1SMEN_Msk            /*!< OTFDEC1SMEN (OTFDEC1 bus clock enable during Sleep and Stop modes) */
#define RCC_AHB2SMENR_XSPI1SMEN_Pos         (29UL)
#define RCC_AHB2SMENR_XSPI1SMEN_Msk         (0x1UL << RCC_AHB2SMENR_XSPI1SMEN_Pos)   /*!< 0x20000000 */
#define RCC_AHB2SMENR_XSPI1SMEN             RCC_AHB2SMENR_XSPI1SMEN_Msk              /*!< XSPI1SMEN (XSPI1 bus clock enable during Sleep and Stop modes) */
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define RCC_AHB2SMENR_SRAM2SMEN_Pos         (30UL)
#define RCC_AHB2SMENR_SRAM2SMEN_Msk         (0x1UL << RCC_AHB2SMENR_SRAM2SMEN_Pos)  /*!< 0x40000000 */
#define RCC_AHB2SMENR_SRAM2SMEN             RCC_AHB2SMENR_SRAM2SMEN_Msk

