STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/********************  Bit definition for USB_OTG_DOEPINT register  ********************/
#define USB_OTG_DOEPINT_XFRC_Pos                 (0UL)
#define USB_OTG_DOEPINT_XFRC_Msk                 (0x1UL << USB_OTG_DOEPINT_XFRC_Pos) /*!< 0x00000001 */
#define USB_OTG_DOEPINT_XFRC                     USB_OTG_DOEPINT_XFRC_Msk      /*!< Transfer completed interrupt */
#define USB_OTG_DOEPINT_EPDISD_Pos               (1UL)
#define USB_OTG_DOEPINT_EPDISD_Msk               (0x1UL << USB_OTG_DOEPINT_EPDISD_Pos) /*!< 0x00000002 */
#define USB_OTG_DOEPINT_EPDISD                   USB_OTG_DOEPINT_EPDISD_Msk    /*!< Endpoint disabled interrupt */
#define USB_OTG_DOEPINT_AHBERR_Pos               (2UL)
#define USB_OTG_DOEPINT_AHBERR_Msk               (0x1UL << USB_OTG_DOEPINT_AHBERR_Pos) /*!< 0x00000004 */
#define USB_OTG_DOEPINT_AHBERR                   USB_OTG_DOEPINT_AHBERR_Msk   /*!< AHB Error (AHBErr) during an OUT transaction */
#define USB_OTG_DOEPINT_STUP_Pos                 (3UL)
#define USB_OTG_DOEPINT_STUP_Msk                 (0x1UL << USB_OTG_DOEPINT_STUP_Pos) /*!< 0x00000008 */
#define USB_OTG_DOEPINT_STUP                     USB_OTG_DOEPINT_STUP_Msk      /*!< SETUP phase done */
#define USB_OTG_DOEPINT_OTEPDIS_Pos              (4UL)
#define USB_OTG_DOEPINT_OTEPDIS_Msk              (0x1UL << USB_OTG_DOEPINT_OTEPDIS_Pos) /*!< 0x00000010 */
#define USB_OTG_DOEPINT_OTEPDIS                  USB_OTG_DOEPINT_OTEPDIS_Msk   /*!< OUT token received when endpoint disabled */
#define USB_OTG_DOEPINT_OTEPSPR_Pos              (5UL)
#define USB_OTG_DOEPINT_OTEPSPR_Msk              (0x1UL << USB_OTG_DOEPINT_OTEPSPR_Pos) /*!< 0x00000020 */
#define USB_OTG_DOEPINT_OTEPSPR                  USB_OTG_DOEPINT_OTEPSPR_Msk   /*!< OUT Status Phase Received interrupt */
#define USB_OTG_DOEPINT_B2BSTUP_Pos              (6UL)
#define USB_OTG_DOEPINT_B2BSTUP_Msk              (0x1UL << USB_OTG_DOEPINT_B2BSTUP_Pos) /*!< 0x00000040 */
#define USB_OTG_DOEPINT_B2BSTUP                  USB_OTG_DOEPINT_B2BSTUP_Msk   /*!< Back-to-back SETUP packets received */
#define USB_OTG_DOEPINT_OUTPKTERR_Pos            (8UL)
#define USB_OTG_DOEPINT_OUTPKTERR_Msk            (0x1UL << USB_OTG_DOEPINT_OUTPKTERR_Pos) /*!< 0x00000100 */
#define USB_OTG_DOEPINT_OUTPKTERR                USB_OTG_DOEPINT_OUTPKTERR_Msk   /*!< OUT packet error */
#define USB_OTG_DOEPINT_BERR_Pos                 (12UL)
#define USB_OTG_DOEPINT_BERR_Msk                 (0x1UL << USB_OTG_DOEPINT_BERR_Pos) /*!< 0x00001000 */
#define USB_OTG_DOEPINT_BERR                      USB_OTG_DOEPINT_BERR_Msk   /*!< Babble error interrupt */
#define USB_OTG_DOEPINT_NAK_Pos                  (13UL)
#define USB_OTG_DOEPINT_NAK_Msk                  (0x1UL << USB_OTG_DOEPINT_NAK_Pos) /*!< 0x00002000 */
#define USB_OTG_DOEPINT_NAK                      USB_OTG_DOEPINT_NAK_Msk   /*!< NAK Packet is transmitted by the device */
#define USB_OTG_DOEPINT_NYET_Pos                 (14UL)
#define USB_OTG_DOEPINT_NYET_Msk                 (0x1UL << USB_OTG_DOEPINT_NYET_Pos) /*!< 0x00004000 */
#define USB_OTG_DOEPINT_NYET                     USB_OTG_DOEPINT_NYET_Msk      /*!< NYET interrupt */
#define USB_OTG_DOEPINT_STPKTRX_Pos              (15UL)
#define USB_OTG_DOEPINT_STPKTRX_Msk              (0x1UL << USB_OTG_DOEPINT_STPKTRX_Pos) /*!< 0x00008000 */
#define USB_OTG_DOEPINT_STPKTRX                  USB_OTG_DOEPINT_STPKTRX_Msk   /*!< Setup Packet Received */

/********************  Bit definition for USB_OTG_DOEPTSIZ register  ********************/
#define USB_OTG_DOEPTSIZ_XFRSIZ_Pos              (0UL)
#define USB_OTG_DOEPTSIZ_XFRSIZ_Msk              (0x7FFFFUL << USB_OTG_DOEPTSIZ_XFRSIZ_Pos) /*!< 0x0007FFFF */
#define USB_OTG_DOEPTSIZ_XFRSIZ                  USB_OTG_DOEPTSIZ_XFRSIZ_Msk   /*!< Transfer size */
#define USB_OTG_DOEPTSIZ_PKTCNT_Pos              (19UL)
#define USB_OTG_DOEPTSIZ_PKTCNT_Msk              (0x3FFUL << USB_OTG_DOEPTSIZ_PKTCNT_Pos) /*!< 0x1FF80000 */
#define USB_OTG_DOEPTSIZ_PKTCNT                  USB_OTG_DOEPTSIZ_PKTCNT_Msk   /*!< Packet count */

#define USB_OTG_DOEPTSIZ_STUPCNT_Pos             (29UL)
#define USB_OTG_DOEPTSIZ_STUPCNT_Msk             (0x3UL << USB_OTG_DOEPTSIZ_STUPCNT_Pos) /*!< 0x60000000 */
#define USB_OTG_DOEPTSIZ_STUPCNT                 USB_OTG_DOEPTSIZ_STUPCNT_Msk  /*!< SETUP packet count */
#define USB_OTG_DOEPTSIZ_STUPCNT_0               (0x1UL << USB_OTG_DOEPTSIZ_STUPCNT_Pos) /*!< 0x20000000 */
#define USB_OTG_DOEPTSIZ_STUPCNT_1               (0x2UL << USB_OTG_DOEPTSIZ_STUPCNT_Pos) /*!< 0x40000000 */

/********************  Bit definition for PCGCCTL register  ********************/
#define USB_OTG_PCGCCTL_STOPCLK_Pos              (0UL)
#define USB_OTG_PCGCCTL_STOPCLK_Msk              (0x1UL << USB_OTG_PCGCCTL_STOPCLK_Pos) /*!< 0x00000001 */
#define USB_OTG_PCGCCTL_STOPCLK                  USB_OTG_PCGCCTL_STOPCLK_Msk   /*!< SETUP packet count */
#define USB_OTG_PCGCCTL_GATECLK_Pos              (1UL)
#define USB_OTG_PCGCCTL_GATECLK_Msk              (0x1UL << USB_OTG_PCGCCTL_GATECLK_Pos) /*!< 0x00000002 */
#define USB_OTG_PCGCCTL_GATECLK                  USB_OTG_PCGCCTL_GATECLK_Msk   /*!<Bit 0 */
#define USB_OTG_PCGCCTL_PHYSUSP_Pos              (4UL)
#define USB_OTG_PCGCCTL_PHYSUSP_Msk              (0x1UL << USB_OTG_PCGCCTL_PHYSUSP_Pos) /*!< 0x00000010 */
#define USB_OTG_PCGCCTL_PHYSUSP                  USB_OTG_PCGCCTL_PHYSUSP_Msk   /*!<Bit 1 */

/********************  Bit definition for PCGCCTL1 register  ********************/
#define USB_OTG_PCGCCTL1_GATEEN_Pos               (0UL)
#define USB_OTG_PCGCCTL1_GATEEN_Msk               (0x1UL << USB_OTG_PCGCCTL1_GATEEN_Pos) /*!< 0x00000001 */
#define USB_OTG_PCGCCTL1_GATEEN                   USB_OTG_PCGCCTL1_GATEEN_Msk   /*!< Enable Active Clock Gating */
#define USB_OTG_PCGCCTL1_COUNTER_Pos              (1UL)
#define USB_OTG_PCGCCTL1_COUNTER_Msk              (0x3UL << USB_OTG_PCGCCTL1_COUNTER_Pos) /*!< 0x00000002 */
#define USB_OTG_PCGCCTL1_COUNTER                  USB_OTG_PCGCCTL1_COUNTER_Msk   /*!< Count to Gate Clock */
#define USB_OTG_PCGCCTL1_RAMGATEEN_Pos            (3UL)
#define USB_OTG_PCGCCTL1_RAMGATEEN_Msk            (0x1UL << USB_OTG_PCGCCTL1_RAMGATEEN_Pos) /*!< 0x00000010 */
#define USB_OTG_PCGCCTL1_RAMGATEEN                USB_OTG_PCGCCTL1_RAMGATEEN_Msk   /*!< RAM Clock Gating Enable */

/*!< USB registers base address */
#define USB_OTG_GLOBAL_BASE                       (0x000UL)
#define USB_OTG_DEVICE_BASE                       (0x800UL)
#define USB_OTG_IN_ENDPOINT_BASE                  (0x900UL)
#define USB_OTG_OUT_ENDPOINT_BASE                 (0xB00UL)
#define USB_OTG_EP_REG_SIZE                       (0x20UL)
#define USB_OTG_HOST_BASE                         (0x400UL)
#define USB_OTG_HOST_PORT_BASE                    (0x440UL)
#define USB_OTG_HOST_CHANNEL_BASE                 (0x500UL)
#define USB_OTG_HOST_CHANNEL_SIZE                 (0x20UL)
#define USB_OTG_PCGCCTL_BASE                      (0xE00UL)
#define USB_OTG_FIFO_BASE                         (0x1000UL)
#define USB_OTG_FIFO_SIZE                         (0x1000UL)
#define USB_OTG_HS_EP_NBR                         (9UL)            /*!< Number of USB HS Device endpoints */
#define USB_OTG_HS_CH_NBR                         (16UL)           /*!< Number of USB HS Host channels */
#endif /* defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx) */

#if defined (STM32WBA62xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
/******************************************************************************/
/*                                                                            */
/*                                   VREFBUF                                  */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for VREFBUF_CSR register  ****************/
#define VREFBUF_CSR_ENVR_Pos        (0UL)
#define VREFBUF_CSR_ENVR_Msk        (0x1UL << VREFBUF_CSR_ENVR_Pos)            /*!< 0x00000001 */
#define VREFBUF_CSR_ENVR            VREFBUF_CSR_ENVR_Msk                       /*!<Voltage reference buffer enable */
#define VREFBUF_CSR_HIZ_Pos         (1UL)
#define VREFBUF_CSR_HIZ_Msk         (0x1UL << VREFBUF_CSR_HIZ_Pos)             /*!< 0x00000002 */
#define VREFBUF_CSR_HIZ             VREFBUF_CSR_HIZ_Msk                        /*!<High impedance mode             */
#define VREFBUF_CSR_VRR_Pos         (3UL)
#define VREFBUF_CSR_VRR_Msk         (0x1UL << VREFBUF_CSR_VRR_Pos)             /*!< 0x00000008 */
#define VREFBUF_CSR_VRR             VREFBUF_CSR_VRR_Msk                        /*!<Voltage reference buffer ready  */
#define VREFBUF_CSR_VRS_Pos         (4UL)
#define VREFBUF_CSR_VRS_Msk         (0x7UL << VREFBUF_CSR_VRS_Pos)             /*!< 0x00000070 */
#define VREFBUF_CSR_VRS             VREFBUF_CSR_VRS_Msk                        /*!<Voltage reference scale         */

#define VREFBUF_CSR_VRS_OUT1        ((uint32_t)0x00000000)                     /*!<Voltage reference VREF_OUT1     */
#define VREFBUF_CSR_VRS_OUT2_Pos    (4UL)
#define VREFBUF_CSR_VRS_OUT2_Msk    (0x1UL << VREFBUF_CSR_VRS_OUT2_Pos)        /*!< 0x00000010 */
#define VREFBUF_CSR_VRS_OUT2        VREFBUF_CSR_VRS_OUT2_Msk                   /*!<Voltage reference VREF_OUT2     */
#define VREFBUF_CSR_VRS_OUT3_Pos    (5UL)
#define VREFBUF_CSR_VRS_OUT3_Msk    (0x1UL << VREFBUF_CSR_VRS_OUT3_Pos)        /*!< 0x00000020 */
#define VREFBUF_CSR_VRS_OUT3        VREFBUF_CSR_VRS_OUT3_Msk                   /*!<Voltage reference VREF_OUT3     */
#define VREFBUF_CSR_VRS_OUT4_Pos    (4UL)
#define VREFBUF_CSR_VRS_OUT4_Msk    (0x3UL << VREFBUF_CSR_VRS_OUT4_Pos)        /*!< 0x00000030 */
#define VREFBUF_CSR_VRS_OUT4        VREFBUF_CSR_VRS_OUT4_Msk                   /*!<Voltage reference VREF_OUT4     */

/*******************  Bit definition for VREFBUF_CCR register  ****************/
#define VREFBUF_CCR_TRIM_Pos        (0UL)
#define VREFBUF_CCR_TRIM_Msk        (0x3FUL << VREFBUF_CCR_TRIM_Pos)           /*!< 0x0000003F */
#define VREFBUF_CCR_TRIM            VREFBUF_CCR_TRIM_Msk                       /*!<TRIM[5:0] bits (Trimming code)  */


#endif
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
/******************************************************************************/
/*                                                                            */
/*                        USB address block description*/
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for USB_CHEPnR registers  ********************/
#define USB_CHEP_EA_Pos           (0UL)
#define USB_CHEP_EA_Msk           (0xFUL << USB_CHEP_EA_Pos)           /*!< 0x0000000F */
#define USB_CHEP_EA               USB_CHEP_EA_Msk                      /*!< EA[3:0] bits (endpoint/channel address) */
#define USB_CHEP_EA_0             (0x01UL << USB_CHEP_EA_Pos)          /*!< 0x00000001 */
#define USB_CHEP_EA_1             (0x02UL << USB_CHEP_EA_Pos)          /*!< 0x00000002 */
#define USB_CHEP_EA_2             (0x04UL << USB_CHEP_EA_Pos)          /*!< 0x00000004 */
#define USB_CHEP_EA_3             (0x08UL << USB_CHEP_EA_Pos)          /*!< 0x00000008 */
#define USB_CHEP_STATTX_Pos       (4UL)
#define USB_CHEP_STATTX_Msk       (0x3UL << USB_CHEP_STATTX_Pos)       /*!< 0x00000030 */
#define USB_CHEP_STATTX           USB_CHEP_STATTX_Msk                  /*!< STATTX[1:0] bits (Status bits, for transmission transfers) */
#define USB_CHEP_STATTX_0         (0x1UL << USB_CHEP_STATTX_Pos)       /*!< 0x00000010 */
#define USB_CHEP_STATTX_1         (0x2UL << USB_CHEP_STATTX_Pos)       /*!< 0x00000020 */
#define USB_CHEP_DTOGTX_Pos       (6UL)
#define USB_CHEP_DTOGTX_Msk       (0x1UL << USB_CHEP_DTOGTX_Pos)       /*!< 0x00000040 */
#define USB_CHEP_DTOGTX           USB_CHEP_DTOGTX_Msk                  /*!< DTOGTX (Data toggle, for transmission transfers) */
#define USB_CHEP_VTTX_Pos         (7UL)
#define USB_CHEP_VTTX_Msk         (0x1UL << USB_CHEP_VTTX_Pos)         /*!< 0x00000080 */
#define USB_CHEP_VTTX             USB_CHEP_VTTX_Msk                    /*!< VTTX (Valid USB transaction transmitted) */
#define USB_CHEP_EPKIND_Pos       (8UL)
#define USB_CHEP_EPKIND_Msk       (0x1UL << USB_CHEP_EPKIND_Pos)       /*!< 0x00000100 */
#define USB_CHEP_EPKIND           USB_CHEP_EPKIND_Msk                  /*!< EPKIND (endpoint/channel kind) */
#define USB_CHEP_UTYPE_Pos        (9UL)
#define USB_CHEP_UTYPE_Msk        (0x3UL << USB_CHEP_UTYPE_Pos)        /*!< 0x00000600 */
#define USB_CHEP_UTYPE            USB_CHEP_UTYPE_Msk                   /*!< UTYPE[1:0] bits (USB type of transaction) */
#define USB_CHEP_UTYPE_0          (0x1UL << USB_CHEP_UTYPE_Pos)        /*!< 0x00000200 */
#define USB_CHEP_UTYPE_1          (0x2UL << USB_CHEP_UTYPE_Pos)        /*!< 0x00000400 */
#define USB_CHEP_SETUP_Pos        (11UL)
#define USB_CHEP_SETUP_Msk        (0x1UL << USB_CHEP_SETUP_Pos)        /*!< 0x00000800 */
#define USB_CHEP_SETUP            USB_CHEP_SETUP_Msk                   /*!< SETUP (Setup transaction completed) */
#define USB_CHEP_STATRX_Pos       (12UL)
#define USB_CHEP_STATRX_Msk       (0x3UL << USB_CHEP_STATRX_Pos)       /*!< 0x00003000 */
#define USB_CHEP_STATRX           USB_CHEP_STATRX_Msk                  /*!< STATRX[1:0] bits (Status bits, for reception transfers) */
#define USB_CHEP_STATRX_0         (0x1UL << USB_CHEP_STATRX_Pos)       /*!< 0x00001000 */
#define USB_CHEP_STATRX_1         (0x2UL << USB_CHEP_STATRX_Pos)       /*!< 0x00002000 */
#define USB_CHEP_DTOGRX_Pos       (14UL)
#define USB_CHEP_DTOGRX_Msk       (0x1UL << USB_CHEP_DTOGRX_Pos)       /*!< 0x00004000 */
#define USB_CHEP_DTOGRX           USB_CHEP_DTOGRX_Msk                  /*!< DTOGRX (Data Toggle, for reception transfers) */
#define USB_CHEP_VTRX_Pos         (15UL)
#define USB_CHEP_VTRX_Msk         (0x1UL << USB_CHEP_VTRX_Pos)         /*!< 0x00008000 */
#define USB_CHEP_VTRX             USB_CHEP_VTRX_Msk                    /*!< VTRX (USB valid transaction received) */
#define USB_CHEP_DEVADDR_Pos      (16UL)
#define USB_CHEP_DEVADDR_Msk      (0x7FUL << USB_CHEP_DEVADDR_Pos)     /*!< 0x007F0000 */
#define USB_CHEP_DEVADDR          USB_CHEP_DEVADDR_Msk                 /*!< DEVADDR[6:0] bits (Host mode) */
#define USB_CHEP_DEVADDR_0        (0x01UL << USB_CHEP_DEVADDR_Pos)     /*!< 0x00010000 */
#define USB_CHEP_DEVADDR_1        (0x02UL << USB_CHEP_DEVADDR_Pos)     /*!< 0x00020000 */
#define USB_CHEP_DEVADDR_2        (0x04UL << USB_CHEP_DEVADDR_Pos)     /*!< 0x00040000 */
#define USB_CHEP_DEVADDR_3        (0x08UL << USB_CHEP_DEVADDR_Pos)     /*!< 0x00080000 */
#define USB_CHEP_DEVADDR_4        (0x10UL << USB_CHEP_DEVADDR_Pos)     /*!< 0x00100000 */
#define USB_CHEP_DEVADDR_5        (0x20UL << USB_CHEP_DEVADDR_Pos)     /*!< 0x00200000 */
#define USB_CHEP_DEVADDR_6        (0x40UL << USB_CHEP_DEVADDR_Pos)     /*!< 0x00400000 */
#define USB_CHEP_NAK_Pos          (23UL)
#define USB_CHEP_NAK_Msk          (0x1UL << USB_CHEP_NAK_Pos)          /*!< 0x00800000 */
#define USB_CHEP_NAK              USB_CHEP_NAK_Msk                     /*!< NAK (Host mode) */
#define USB_CHEP_LS_EP_Pos        (24UL)
#define USB_CHEP_LS_EP_Msk        (0x1UL << USB_CHEP_LS_EP_Pos)        /*!< 0x01000000 */
#define USB_CHEP_LS_EP            USB_CHEP_LS_EP_Msk                   /*!< LS_EP (Low speed endpoint and host with HUB only) */
#define USB_CHEP_ERR_TX_Pos       (25UL)
#define USB_CHEP_ERR_TX_Msk       (0x1UL << USB_CHEP_ERR_TX_Pos)       /*!< 0x02000000 */
#define USB_CHEP_ERR_TX           USB_CHEP_ERR_TX_Msk                  /*!< ERR_TX (Received error for an OUT/SETUP transaction) */
#define USB_CHEP_ERR_RX_Pos       (26UL)
#define USB_CHEP_ERR_RX_Msk       (0x1UL << USB_CHEP_ERR_RX_Pos)       /*!< 0x04000000 */
#define USB_CHEP_ERR_RX           USB_CHEP_ERR_RX_Msk                  /*!< ERR_RX (Received error for an IN transaction) */
#define USB_CHEP_THREE_ERR_TX_Pos (27UL)
#define USB_CHEP_THREE_ERR_TX_Msk (0x3UL << USB_CHEP_THREE_ERR_TX_Pos) /*!< 0x18000000 */
#define USB_CHEP_THREE_ERR_TX     USB_CHEP_THREE_ERR_TX_Msk            /*!< THREE_ERR_TX[1:0] bits (Three errors for an OUT or SETUP transaction) */
#define USB_CHEP_THREE_ERR_TX_0   (0x1UL << USB_CHEP_THREE_ERR_TX_Pos) /*!< 0x08000000 */
#define USB_CHEP_THREE_ERR_TX_1   (0x2UL << USB_CHEP_THREE_ERR_TX_Pos) /*!< 0x10000000 */
#define USB_CHEP_THREE_ERR_RX_Pos (29UL)
#define USB_CHEP_THREE_ERR_RX_Msk (0x3UL << USB_CHEP_THREE_ERR_RX_Pos) /*!< 0x60000000 */
#define USB_CHEP_THREE_ERR_RX     USB_CHEP_THREE_ERR_RX_Msk            /*!< THREE_ERR_RX[1:0] bits (Three errors for an IN transaction) */
#define USB_CHEP_THREE_ERR_RX_0   (0x1UL << USB_CHEP_THREE_ERR_RX_Pos) /*!< 0x20000000 */
#define USB_CHEP_THREE_ERR_RX_1   (0x2UL << USB_CHEP_THREE_ERR_RX_Pos) /*!< 0x40000000 */

/********************  Bit definition for USB_CNTR register  ********************/
#define USB_CNTR_USBRST_Pos    (0UL)
#define USB_CNTR_USBRST_Msk    (0x1UL << USB_CNTR_USBRST_Pos)    /*!< 0x00000001 */
#define USB_CNTR_USBRST        USB_CNTR_USBRST_Msk               /*!< USBRST (USB Reset) */
#define USB_CNTR_PDWN_Pos      (1UL)
#define USB_CNTR_PDWN_Msk      (0x1UL << USB_CNTR_PDWN_Pos)      /*!< 0x00000002 */
#define USB_CNTR_PDWN          USB_CNTR_PDWN_Msk                 /*!< PDWN (Power down) */
#define USB_CNTR_SUSPRDY_Pos   (2UL)
#define USB_CNTR_SUSPRDY_Msk   (0x1UL << USB_CNTR_SUSPRDY_Pos)   /*!< 0x00000004 */
#define USB_CNTR_SUSPRDY       USB_CNTR_SUSPRDY_Msk              /*!< SUSPRDY (Suspend state effective) */
#define USB_CNTR_SUSPEN_Pos    (3UL)
#define USB_CNTR_SUSPEN_Msk    (0x1UL << USB_CNTR_SUSPEN_Pos)    /*!< 0x00000008 */
#define USB_CNTR_SUSPEN        USB_CNTR_SUSPEN_Msk               /*!< SUSPEN (Suspend state enable) */
#define USB_CNTR_L2RES_Pos     (4UL)
#define USB_CNTR_L2RES_Msk     (0x1UL << USB_CNTR_L2RES_Pos)     /*!< 0x00000010 */
#define USB_CNTR_L2RES         USB_CNTR_L2RES_Msk                /*!< L2RES (L2 remote wake-up / resume driver) */
#define USB_CNTR_L1RES_Pos     (5UL)
#define USB_CNTR_L1RES_Msk     (0x1UL << USB_CNTR_L1RES_Pos)     /*!< 0x00000020 */
#define USB_CNTR_L1RES         USB_CNTR_L1RES_Msk                /*!< L1RES (L1 remote wake-up / resume driver) */
#define USB_CNTR_L1REQM_Pos    (7UL)
#define USB_CNTR_L1REQM_Msk    (0x1UL << USB_CNTR_L1REQM_Pos)    /*!< 0x00000080 */
#define USB_CNTR_L1REQM        USB_CNTR_L1REQM_Msk               /*!< L1REQM (LPM L1 state request interrupt mask) */
#define USB_CNTR_ESOFM_Pos     (8UL)
#define USB_CNTR_ESOFM_Msk     (0x1UL << USB_CNTR_ESOFM_Pos)     /*!< 0x00000100 */
#define USB_CNTR_ESOFM         USB_CNTR_ESOFM_Msk                /*!< ESOFM (Expected start of frame interrupt mask) */
#define USB_CNTR_SOFM_Pos      (9UL)
#define USB_CNTR_SOFM_Msk      (0x1UL << USB_CNTR_SOFM_Pos)      /*!< 0x00000200 */
#define USB_CNTR_SOFM          USB_CNTR_SOFM_Msk                 /*!< SOFM (Start of frame interrupt mask) */
#define USB_CNTR_RST_DCONM_Pos (10UL)
#define USB_CNTR_RST_DCONM_Msk (0x1UL << USB_CNTR_RST_DCONM_Pos) /*!< 0x00000400 */
#define USB_CNTR_RST_DCONM     USB_CNTR_RST_DCONM_Msk            /*!< RST_DCONM (USB reset request (Device mode) or device connect/disconnect (Host mode) interrupt mask) */
#define USB_CNTR_SUSPM_Pos     (11UL)
#define USB_CNTR_SUSPM_Msk     (0x1UL << USB_CNTR_SUSPM_Pos)     /*!< 0x00000800 */
#define USB_CNTR_SUSPM         USB_CNTR_SUSPM_Msk                /*!< SUSPM (Suspend mode interrupt mask) */
#define USB_CNTR_WKUPM_Pos     (12UL)
#define USB_CNTR_WKUPM_Msk     (0x1UL << USB_CNTR_WKUPM_Pos)     /*!< 0x00001000 */
#define USB_CNTR_WKUPM         USB_CNTR_WKUPM_Msk                /*!< WKUPM (Wake-up interrupt mask) */
#define USB_CNTR_ERRM_Pos      (13UL)
#define USB_CNTR_ERRM_Msk      (0x1UL << USB_CNTR_ERRM_Pos)      /*!< 0x00002000 */
#define USB_CNTR_ERRM          USB_CNTR_ERRM_Msk                 /*!< ERRM (Error interrupt mask) */
#define USB_CNTR_PMAOVRM_Pos   (14UL)
#define USB_CNTR_PMAOVRM_Msk   (0x1UL << USB_CNTR_PMAOVRM_Pos)   /*!< 0x00004000 */
#define USB_CNTR_PMAOVRM       USB_CNTR_PMAOVRM_Msk              /*!< PMAOVRM (Packet memory area over / underrun interrupt mask) */
#define USB_CNTR_CTRM_Pos      (15UL)
#define USB_CNTR_CTRM_Msk      (0x1UL << USB_CNTR_CTRM_Pos)      /*!< 0x00008000 */
#define USB_CNTR_CTRM          USB_CNTR_CTRM_Msk                 /*!< CTRM (Correct transfer interrupt mask) */
#define USB_CNTR_THR512M_Pos   (16UL)
#define USB_CNTR_THR512M_Msk   (0x1UL << USB_CNTR_THR512M_Pos)   /*!< 0x00010000 */
#define USB_CNTR_THR512M       USB_CNTR_THR512M_Msk              /*!< THR512M (512 byte threshold interrupt mask) */
#define USB_CNTR_DDISCM_Pos    (17UL)
#define USB_CNTR_DDISCM_Msk    (0x1UL << USB_CNTR_DDISCM_Pos)    /*!< 0x00020000 */
#define USB_CNTR_DDISCM        USB_CNTR_DDISCM_Msk               /*!< DDISCM (Device disconnection mask) */
#define USB_CNTR_HOST_Pos      (31UL)
#define USB_CNTR_HOST_Msk      (0x1UL << USB_CNTR_HOST_Pos)      /*!< 0x80000000 */
#define USB_CNTR_HOST          USB_CNTR_HOST_Msk                 /*!< HOST (HOST mode) */

