STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/********************  Bit definition for USB_ISTR register  ********************/
#define USB_ISTR_IDN_Pos       (0UL)
#define USB_ISTR_IDN_Msk       (0xFUL << USB_ISTR_IDN_Pos)       /*!< 0x0000000F */
#define USB_ISTR_IDN           USB_ISTR_IDN_Msk                  /*!< IDN[3:0] bits (Device Endpoint / host channel identification number) */
#define USB_ISTR_IDN_0         (0x01UL << USB_ISTR_IDN_Pos)      /*!< 0x00000001 */
#define USB_ISTR_IDN_1         (0x02UL << USB_ISTR_IDN_Pos)      /*!< 0x00000002 */
#define USB_ISTR_IDN_2         (0x04UL << USB_ISTR_IDN_Pos)      /*!< 0x00000004 */
#define USB_ISTR_IDN_3         (0x08UL << USB_ISTR_IDN_Pos)      /*!< 0x00000008 */
#define USB_ISTR_DIR_Pos       (4UL)
#define USB_ISTR_DIR_Msk       (0x1UL << USB_ISTR_DIR_Pos)       /*!< 0x00000010 */
#define USB_ISTR_DIR           USB_ISTR_DIR_Msk                  /*!< DIR (Direction of transaction) */
#define USB_ISTR_L1REQ_Pos     (7UL)
#define USB_ISTR_L1REQ_Msk     (0x1UL << USB_ISTR_L1REQ_Pos)     /*!< 0x00000080 */
#define USB_ISTR_L1REQ         USB_ISTR_L1REQ_Msk                /*!< L1REQ (LPM L1 state request) */
#define USB_ISTR_ESOF_Pos      (8UL)
#define USB_ISTR_ESOF_Msk      (0x1UL << USB_ISTR_ESOF_Pos)      /*!< 0x00000100 */
#define USB_ISTR_ESOF          USB_ISTR_ESOF_Msk                 /*!< ESOF (Expected start of frame) */
#define USB_ISTR_SOF_Pos       (9UL)
#define USB_ISTR_SOF_Msk       (0x1UL << USB_ISTR_SOF_Pos)       /*!< 0x00000200 */
#define USB_ISTR_SOF           USB_ISTR_SOF_Msk                  /*!< SOF (Start of frame) */
#define USB_ISTR_RST_DCON_Pos  (10UL)
#define USB_ISTR_RST_DCON_Msk  (0x1UL << USB_ISTR_RST_DCON_Pos)  /*!< 0x00000400 */
#define USB_ISTR_RST_DCON      USB_ISTR_RST_DCON_Msk             /*!< RST_DCON (USB reset request (Device mode) or device connect/disconnect (Host mode)) */
#define USB_ISTR_SUSP_Pos      (11UL)
#define USB_ISTR_SUSP_Msk      (0x1UL << USB_ISTR_SUSP_Pos)      /*!< 0x00000800 */
#define USB_ISTR_SUSP          USB_ISTR_SUSP_Msk                 /*!< SUSP (Suspend mode request) */
#define USB_ISTR_WKUP_Pos      (12UL)
#define USB_ISTR_WKUP_Msk      (0x1UL << USB_ISTR_WKUP_Pos)      /*!< 0x00001000 */
#define USB_ISTR_WKUP          USB_ISTR_WKUP_Msk                 /*!< WKUP (Wake-up) */
#define USB_ISTR_ERR_Pos       (13UL)
#define USB_ISTR_ERR_Msk       (0x1UL << USB_ISTR_ERR_Pos)       /*!< 0x00002000 */
#define USB_ISTR_ERR           USB_ISTR_ERR_Msk                  /*!< ERR (Error) */
#define USB_ISTR_PMAOVR_Pos    (14UL)
#define USB_ISTR_PMAOVR_Msk    (0x1UL << USB_ISTR_PMAOVR_Pos)    /*!< 0x00004000 */
#define USB_ISTR_PMAOVR        USB_ISTR_PMAOVR_Msk               /*!< PMAOVR (Packet memory area over / underrun) */
#define USB_ISTR_CTR_Pos       (15UL)
#define USB_ISTR_CTR_Msk       (0x1UL << USB_ISTR_CTR_Pos)       /*!< 0x00008000 */
#define USB_ISTR_CTR           USB_ISTR_CTR_Msk                  /*!< CTR (Completed transfer in host mode) */
#define USB_ISTR_THR512_Pos    (16UL)
#define USB_ISTR_THR512_Msk    (0x1UL << USB_ISTR_THR512_Pos)    /*!< 0x00010000 */
#define USB_ISTR_THR512        USB_ISTR_THR512_Msk               /*!< THR512 (512 byte threshold interrupt) */
#define USB_ISTR_DDISC_Pos     (17UL)
#define USB_ISTR_DDISC_Msk     (0x1UL << USB_ISTR_DDISC_Pos)     /*!< 0x00020000 */
#define USB_ISTR_DDISC         USB_ISTR_DDISC_Msk                /*!< DDISC (Device connection) */
#define USB_ISTR_DCON_STAT_Pos (29UL)
#define USB_ISTR_DCON_STAT_Msk (0x1UL << USB_ISTR_DCON_STAT_Pos) /*!< 0x20000000 */
#define USB_ISTR_DCON_STAT     USB_ISTR_DCON_STAT_Msk            /*!< DCON_STAT (Device connection status) */
#define USB_ISTR_LS_DCON_Pos   (30UL)
#define USB_ISTR_LS_DCON_Msk   (0x1UL << USB_ISTR_LS_DCON_Pos)   /*!< 0x40000000 */
#define USB_ISTR_LS_DCON       USB_ISTR_LS_DCON_Msk              /*!< LS_DCON (Low speed device connected) */

/********************  Bit definition for USB_FNR register  ********************/
#define USB_FNR_FN_Pos   (0UL)
#define USB_FNR_FN_Msk   (0x7FFUL << USB_FNR_FN_Pos) /*!< 0x000007FF */
#define USB_FNR_FN       USB_FNR_FN_Msk              /*!< FN[10:0] bits (Frame number) */
#define USB_FNR_LSOF_Pos (11UL)
#define USB_FNR_LSOF_Msk (0x3UL << USB_FNR_LSOF_Pos) /*!< 0x00001800 */
#define USB_FNR_LSOF     USB_FNR_LSOF_Msk            /*!< LSOF[1:0] bits (Lost SOF) */
#define USB_FNR_LSOF_0   (0x1UL << USB_FNR_LSOF_Pos) /*!< 0x00000800 */
#define USB_FNR_LSOF_1   (0x2UL << USB_FNR_LSOF_Pos) /*!< 0x00001000 */
#define USB_FNR_LCK_Pos  (13UL)
#define USB_FNR_LCK_Msk  (0x1UL << USB_FNR_LCK_Pos)  /*!< 0x00002000 */
#define USB_FNR_LCK      USB_FNR_LCK_Msk             /*!< LCK (Locked) */
#define USB_FNR_RXDM_Pos (14UL)
#define USB_FNR_RXDM_Msk (0x1UL << USB_FNR_RXDM_Pos) /*!< 0x00004000 */
#define USB_FNR_RXDM     USB_FNR_RXDM_Msk            /*!< RXDM (Receive data - line status) */
#define USB_FNR_RXDP_Pos (15UL)
#define USB_FNR_RXDP_Msk (0x1UL << USB_FNR_RXDP_Pos) /*!< 0x00008000 */
#define USB_FNR_RXDP     USB_FNR_RXDP_Msk            /*!< RXDP (Receive data + line status) */

/********************  Bit definition for USB_DADDR register  ********************/
#define USB_DADDR_ADD_Pos (0UL)
#define USB_DADDR_ADD_Msk (0x7FUL << USB_DADDR_ADD_Pos) /*!< 0x0000007F */
#define USB_DADDR_ADD     USB_DADDR_ADD_Msk             /*!< ADD[6:0] bits (Device address) */
#define USB_DADDR_EF_Pos  (7UL)
#define USB_DADDR_EF_Msk  (0x1UL << USB_DADDR_EF_Pos)   /*!< 0x00000080 */
#define USB_DADDR_EF      USB_DADDR_EF_Msk              /*!< EF (Enable function) */

/********************  Bit definition for USB_LPMCSR register  ********************/
#define USB_LPMCSR_LPMEN_Pos   (0UL)
#define USB_LPMCSR_LPMEN_Msk   (0x1UL << USB_LPMCSR_LPMEN_Pos)   /*!< 0x00000001 */
#define USB_LPMCSR_LPMEN       USB_LPMCSR_LPMEN_Msk              /*!< LPMEN (LPM support enable) */
#define USB_LPMCSR_LPMACK_Pos  (1UL)
#define USB_LPMCSR_LPMACK_Msk  (0x1UL << USB_LPMCSR_LPMACK_Pos)  /*!< 0x00000002 */
#define USB_LPMCSR_LPMACK      USB_LPMCSR_LPMACK_Msk             /*!< LPMACK (LPM token acknowledge enable) */
#define USB_LPMCSR_REMWAKE_Pos (3UL)
#define USB_LPMCSR_REMWAKE_Msk (0x1UL << USB_LPMCSR_REMWAKE_Pos) /*!< 0x00000008 */
#define USB_LPMCSR_REMWAKE     USB_LPMCSR_REMWAKE_Msk            /*!< REMWAKE (bRemoteWake value) */
#define USB_LPMCSR_BESL_Pos    (4UL)
#define USB_LPMCSR_BESL_Msk    (0xFUL << USB_LPMCSR_BESL_Pos)    /*!< 0x000000F0 */
#define USB_LPMCSR_BESL        USB_LPMCSR_BESL_Msk               /*!< BESL[3:0] bits (BESL value) */
#define USB_LPMCSR_BESL_0      (0x01UL << USB_LPMCSR_BESL_Pos)   /*!< 0x00000010 */
#define USB_LPMCSR_BESL_1      (0x02UL << USB_LPMCSR_BESL_Pos)   /*!< 0x00000020 */
#define USB_LPMCSR_BESL_2      (0x04UL << USB_LPMCSR_BESL_Pos)   /*!< 0x00000040 */
#define USB_LPMCSR_BESL_3      (0x08UL << USB_LPMCSR_BESL_Pos)   /*!< 0x00000080 */

/********************  Bit definition for USB_BCDR register  ********************/
#define USB_BCDR_BCDEN_Pos    (0UL)
#define USB_BCDR_BCDEN_Msk    (0x1UL << USB_BCDR_BCDEN_Pos)    /*!< 0x00000001 */
#define USB_BCDR_BCDEN        USB_BCDR_BCDEN_Msk               /*!< BCDEN (Battery charging detector (BCD) enable) */
#define USB_BCDR_PDEN_Pos     (2UL)
#define USB_BCDR_PDEN_Msk     (0x1UL << USB_BCDR_PDEN_Pos)     /*!< 0x00000004 */
#define USB_BCDR_PDEN         USB_BCDR_PDEN_Msk                /*!< PDEN (Primary detection (PD) mode enable) */
#define USB_BCDR_SDEN_Pos     (3UL)
#define USB_BCDR_SDEN_Msk     (0x1UL << USB_BCDR_SDEN_Pos)     /*!< 0x00000008 */
#define USB_BCDR_SDEN         USB_BCDR_SDEN_Msk                /*!< SDEN (Secondary detection (SD) mode enable) */
#define USB_BCDR_PDET_Pos     (5UL)
#define USB_BCDR_PDET_Msk     (0x1UL << USB_BCDR_PDET_Pos)     /*!< 0x00000020 */
#define USB_BCDR_PDET         USB_BCDR_PDET_Msk                /*!< PDET (Primary detection (PD) status) */
#define USB_BCDR_SDET_Pos     (6UL)
#define USB_BCDR_SDET_Msk     (0x1UL << USB_BCDR_SDET_Pos)     /*!< 0x00000040 */
#define USB_BCDR_SDET         USB_BCDR_SDET_Msk                /*!< SDET (Secondary detection (SD) status) */
#define USB_BCDR_PS2DET_Pos   (7UL)
#define USB_BCDR_PS2DET_Msk   (0x1UL << USB_BCDR_PS2DET_Pos)   /*!< 0x00000080 */
#define USB_BCDR_PS2DET       USB_BCDR_PS2DET_Msk              /*!< PS2DET (DM pull-up detection status) */
#define USB_BCDR_DPPU_DPD_Pos (15UL)
#define USB_BCDR_DPPU_DPD_Msk (0x1UL << USB_BCDR_DPPU_DPD_Pos) /*!< 0x00008000 */
#define USB_BCDR_DPPU_DPD     USB_BCDR_DPPU_DPD_Msk            /*!< DPPU_DPD (DP pull-up / DPDM pull-down) */

/********************  Bit definition for USB_CHEP_TXRXBD_n registers  ********************/
#define USB_CHEP_TXRXBD_ADDR_TX_Pos   (0UL)
#define USB_CHEP_TXRXBD_ADDR_TX_Msk   (0xFFFFUL << USB_CHEP_TXRXBD_ADDR_TX_Pos) /*!< 0x0000FFFF */
#define USB_CHEP_TXRXBD_ADDR_TX       USB_CHEP_TXRXBD_ADDR_TX_Msk               /*!< ADDR_TX[15:0] bits (Transmission buffer address) */
#define USB_CHEP_TXRXBD_COUNT_TX_Pos  (16UL)
#define USB_CHEP_TXRXBD_COUNT_TX_Msk  (0x3FFUL << USB_CHEP_TXRXBD_COUNT_TX_Pos) /*!< 0x03FF0000 */
#define USB_CHEP_TXRXBD_COUNT_TX      USB_CHEP_TXRXBD_COUNT_TX_Msk              /*!< COUNT_TX[9:0] bits (Transmission byte count) */
#define USB_CHEP_TXRXBD_ADDR_RX_Pos   (0UL)
#define USB_CHEP_TXRXBD_ADDR_RX_Msk   (0xFFFFUL << USB_CHEP_TXRXBD_ADDR_RX_Pos) /*!< 0x0000FFFF */
#define USB_CHEP_TXRXBD_ADDR_RX       USB_CHEP_TXRXBD_ADDR_RX_Msk               /*!< ADDR_RX[15:0] bits (Reception buffer address) */
#define USB_CHEP_TXRXBD_COUNT_RX_Pos  (16UL)
#define USB_CHEP_TXRXBD_COUNT_RX_Msk  (0x3FFUL << USB_CHEP_TXRXBD_COUNT_RX_Pos) /*!< 0x03FF0000 */
#define USB_CHEP_TXRXBD_COUNT_RX      USB_CHEP_TXRXBD_COUNT_RX_Msk              /*!< COUNT_RX[9:0] bits (Reception byte count) */
#define USB_CHEP_TXRXBD_NUM_BLOCK_Pos (26UL)
#define USB_CHEP_TXRXBD_NUM_BLOCK_Msk (0x1FUL << USB_CHEP_TXRXBD_NUM_BLOCK_Pos) /*!< 0x7C000000 */
#define USB_CHEP_TXRXBD_NUM_BLOCK     USB_CHEP_TXRXBD_NUM_BLOCK_Msk             /*!< NUM_BLOCK[4:0] bits (Number of blocks) */
#define USB_CHEP_TXRXBD_BLSIZE_Pos    (31UL)
#define USB_CHEP_TXRXBD_BLSIZE_Msk    (0x1UL << USB_CHEP_TXRXBD_BLSIZE_Pos)     /*!< 0x80000000 */
#define USB_CHEP_TXRXBD_BLSIZE        USB_CHEP_TXRXBD_BLSIZE_Msk                /*!< BLSIZE (Block size) */

