STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/********************  Bit definition for USB_CHEP_RXTXBD_n registers  ********************/
#define USB_CHEP_RXTXBD_ADDR_RX_Pos   (0UL)
#define USB_CHEP_RXTXBD_ADDR_RX_Msk   (0xFFFFUL << USB_CHEP_RXTXBD_ADDR_RX_Pos) /*!< 0x0000FFFF */
#define USB_CHEP_RXTXBD_ADDR_RX       USB_CHEP_RXTXBD_ADDR_RX_Msk               /*!< ADDR_RX[15:0] bits (Reception buffer address) */
#define USB_CHEP_RXTXBD_COUNT_RX_Pos  (16UL)
#define USB_CHEP_RXTXBD_COUNT_RX_Msk  (0x3FFUL << USB_CHEP_RXTXBD_COUNT_RX_Pos) /*!< 0x03FF0000 */
#define USB_CHEP_RXTXBD_COUNT_RX      USB_CHEP_RXTXBD_COUNT_RX_Msk              /*!< COUNT_RX[9:0] bits (Reception byte count) */
#define USB_CHEP_RXTXBD_NUM_BLOCK_Pos (26UL)
#define USB_CHEP_RXTXBD_NUM_BLOCK_Msk (0x1FUL << USB_CHEP_RXTXBD_NUM_BLOCK_Pos) /*!< 0x7C000000 */
#define USB_CHEP_RXTXBD_NUM_BLOCK     USB_CHEP_RXTXBD_NUM_BLOCK_Msk             /*!< NUM_BLOCK[4:0] bits (Number of blocks) */
#define USB_CHEP_RXTXBD_BLSIZE_Pos    (31UL)
#define USB_CHEP_RXTXBD_BLSIZE_Msk    (0x1UL << USB_CHEP_RXTXBD_BLSIZE_Pos)     /*!< 0x80000000 */
#define USB_CHEP_RXTXBD_BLSIZE        USB_CHEP_RXTXBD_BLSIZE_Msk                /*!< BLSIZE (Block size) */
#define USB_CHEP_RXTXBD_ADDR_TX_Pos   (0UL)
#define USB_CHEP_RXTXBD_ADDR_TX_Msk   (0xFFFFUL << USB_CHEP_RXTXBD_ADDR_TX_Pos) /*!< 0x0000FFFF */
#define USB_CHEP_RXTXBD_ADDR_TX       USB_CHEP_RXTXBD_ADDR_TX_Msk               /*!< ADDR_TX[15:0] bits (Transmission buffer address) */
#define USB_CHEP_RXTXBD_COUNT_TX_Pos  (16UL)
#define USB_CHEP_RXTXBD_COUNT_TX_Msk  (0x3FFUL << USB_CHEP_RXTXBD_COUNT_TX_Pos) /*!< 0x03FF0000 */
#define USB_CHEP_RXTXBD_COUNT_TX      USB_CHEP_RXTXBD_COUNT_TX_Msk              /*!< COUNT_TX[9:0] bits (Transmission byte count) */

#define USB_EP_ERR_RX                 USB_CHEP_ERR_RX                           /*!< EP Receive error */
#define USB_CH_ERR_RX                 USB_CHEP_ERR_RX                           /*!< CH Receive error */
#define USB_EP_ERR_TX                 USB_CHEP_ERR_TX                           /*!< EP Transmit error */
#define USB_CH_ERR_TX                 USB_CHEP_ERR_TX                           /*!< CH Transmit error */
#define USB_EP_VTRX                   USB_CHEP_VTRX                             /*!< USB Endpoint valid transaction received Mask */
#define USB_CH_VTRX                   USB_CHEP_VTRX                             /*!< USB valid Channel transaction received Mask */
#define USB_EP_DTOGRX                 USB_CHEP_DTOGRX                           /*!< EP Data Toggle, for reception transfers Mask */
#define USB_CH_DTOGRX                 USB_CHEP_DTOGRX                           /*!< CH Data Toggle, for reception transfers Mask */
#define USB_EP_STATRX                 USB_CHEP_STATRX                           /*!< Status bits, for EP reception transfers Mask */
#define USB_CH_STATRX                 USB_CHEP_STATRX                           /*!< Status bits, for CH reception transfers Mask */
#define USB_EP_SETUP                  USB_CHEP_SETUP                            /*!< EP Setup transaction completed Mask */
#define USB_CH_SETUP                  USB_CHEP_SETUP                            /*!< CH Setup transaction completed Mask */
#define USB_EP_UTYPE                  USB_CHEP_UTYPE                            /*!< USB type of EP transaction Mask */
#define USB_CH_UTYPE                  USB_CHEP_UTYPE                            /*!< USB type of CH transaction Mask */
#define USB_EP_KIND                   USB_CHEP_EPKIND                           /*!< EndPoint EPKIND Mask */
#define USB_CH_KIND                   USB_CHEP_EPKIND                           /*!< Channel EPKIND Mask */
#define USB_EP_VTTX                   USB_CHEP_VTTX                             /*!< USB Endpoint valid transaction transmitted Mask */
#define USB_CH_VTTX                   USB_CHEP_VTTX                             /*!< USB valid Channel transaction transmitted Mask */
#define USB_EP_DTOGTX                 USB_CHEP_DTOGTX                           /*!< EP Data Toggle, for transmission transfers Mask */
#define USB_CH_DTOGTX                 USB_CHEP_DTOGTX                           /*!< CH Data Toggle, for transmission transfers Mask */
#define USB_EP_STATTX                 USB_CHEP_STATTX                           /*!< Status bits, for EP transmission transfers Mask */
#define USB_CH_STATTX                 USB_CHEP_STATTX                           /*!< Status bits, for CH transmission transfers Mask */

/* EndPoint Register MASK (no toggle fields) */
#define USB_CHEP_REG_MASK                          (USB_CHEP_ERR_RX | USB_CHEP_ERR_TX | USB_CHEP_LS_EP | \
                                                    USB_CHEP_DEVADDR | USB_CHEP_VTRX | USB_CHEP_SETUP | \
                                                    USB_CHEP_UTYPE | USB_CHEP_EPKIND | USB_CHEP_VTTX | USB_CHEP_ADDR | \
                                                    USB_CHEP_NAK) /* 0x07FF8F8F */

#define USB_CHEP_TX_DTOGMASK                       (USB_CHEP_TX_STTX | USB_CHEP_REG_MASK)
#define USB_CHEP_RX_DTOGMASK                       (USB_CHEP_RX_STRX | USB_CHEP_REG_MASK)

#define USB_CHEP_TX_DTOG1                          (0x00000010UL)           /*!< Channel/EndPoint TX Data Toggle bit1 */
#define USB_CHEP_TX_DTOG2                          (0x00000020UL)           /*!< Channel/EndPoint TX Data Toggle bit2 */
#define USB_CHEP_RX_DTOG1                          (0x00001000UL)           /*!< Channel/EndPoint RX Data Toggle bit1 */
#define USB_CHEP_RX_DTOG2                          (0x00002000UL)           /*!< Channel/EndPoint RX Data Toggle bit1 */

/*!< EP_TYPE[1:0] Channel/EndPoint TYPE */
#define USB_EP_TYPE_MASK                           (0x00000600UL)           /*!< Channel/EndPoint TYPE Mask */
#define USB_EP_BULK                                (0x00000000UL)           /*!< Channel/EndPoint BULK */
#define USB_EP_CONTROL                             (0x00000200UL)           /*!< Channel/EndPoint CONTROL */
#define USB_EP_ISOCHRONOUS                         (0x00000400UL)           /*!< Channel/EndPoint ISOCHRONOUS */
#define USB_EP_INTERRUPT                           (0x00000600UL)           /*!< Channel/EndPoint INTERRUPT */

#define USB_EP_T_MASK                              ((~USB_EP_UTYPE) & USB_CHEP_REG_MASK) /* =0x898F */
#define USB_CH_T_MASK                              ((~USB_CH_UTYPE) & USB_CHEP_REG_MASK) /* =0x898F */

#define USB_EP_KIND_MASK                           ((~USB_EP_KIND) & USB_CHEP_REG_MASK) /*!< EP_KIND EndPoint KIND */
#define USB_CH_KIND_MASK                           ((~USB_CH_KIND) & USB_CHEP_REG_MASK) /*!< EP_KIND EndPoint KIND */

