STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/*******************  Bit definition for WWDG_SR register  ********************/
#define WWDG_SR_EWIF_Pos                    (0UL)
#define WWDG_SR_EWIF_Msk                    (0x1UL << WWDG_SR_EWIF_Pos)             /*!< 0x00000001 */
#define WWDG_SR_EWIF                        WWDG_SR_EWIF_Msk                        /*!<Early Wakeup Interrupt Flag */

#endif /* !defined (STM32WBA20xx) && !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#if defined (STM32WBA24xx) || defined (STM32WBA25xx)
/******************************************************************************/
/*                                                                            */
/*                        XSPI register block                                 */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for XSPI_CR register  ********************/
#define XSPI_CR_EN_Pos     (0UL)
#define XSPI_CR_EN_Msk     (0x1UL << XSPI_CR_EN_Pos)      /*!< 0x00000001 */
#define XSPI_CR_EN         XSPI_CR_EN_Msk                 /*!< EN (Enable) */
#define XSPI_CR_ABORT_Pos  (1UL)
#define XSPI_CR_ABORT_Msk  (0x1UL << XSPI_CR_ABORT_Pos)   /*!< 0x00000002 */
#define XSPI_CR_ABORT      XSPI_CR_ABORT_Msk              /*!< ABORT (Abort request) */
#define XSPI_CR_DMAEN_Pos  (2UL)
#define XSPI_CR_DMAEN_Msk  (0x1UL << XSPI_CR_DMAEN_Pos)   /*!< 0x00000004 */
#define XSPI_CR_DMAEN      XSPI_CR_DMAEN_Msk              /*!< DMAEN (DMA enable) */
#define XSPI_CR_TCEN_Pos   (3UL)
#define XSPI_CR_TCEN_Msk   (0x1UL << XSPI_CR_TCEN_Pos)    /*!< 0x00000008 */
#define XSPI_CR_TCEN       XSPI_CR_TCEN_Msk               /*!< TCEN (Timeout counter enable) */
#define XSPI_CR_DMM_Pos    (6UL)
#define XSPI_CR_DMM_Msk    (0x1UL << XSPI_CR_DMM_Pos)     /*!< 0x00000040 */
#define XSPI_CR_DMM        XSPI_CR_DMM_Msk                /*!< DMM (Dual-memory configuration) */
#define XSPI_CR_FTHRES_Pos (8UL)
#define XSPI_CR_FTHRES_Msk (0x1FUL << XSPI_CR_FTHRES_Pos) /*!< 0x00001F00 */
#define XSPI_CR_FTHRES     XSPI_CR_FTHRES_Msk             /*!< FTHRES[4:0] bits (FIFO threshold level) */
#define XSPI_CR_TEIE_Pos   (16UL)
#define XSPI_CR_TEIE_Msk   (0x1UL << XSPI_CR_TEIE_Pos)    /*!< 0x00010000 */
#define XSPI_CR_TEIE       XSPI_CR_TEIE_Msk               /*!< TEIE (Transfer error interrupt enable) */
#define XSPI_CR_TCIE_Pos   (17UL)
#define XSPI_CR_TCIE_Msk   (0x1UL << XSPI_CR_TCIE_Pos)    /*!< 0x00020000 */
#define XSPI_CR_TCIE       XSPI_CR_TCIE_Msk               /*!< TCIE (Transfer complete interrupt enable) */
#define XSPI_CR_FTIE_Pos   (18UL)
#define XSPI_CR_FTIE_Msk   (0x1UL << XSPI_CR_FTIE_Pos)    /*!< 0x00040000 */
#define XSPI_CR_FTIE       XSPI_CR_FTIE_Msk               /*!< FTIE (FIFO threshold interrupt enable) */
#define XSPI_CR_TOIE_Pos   (20UL)
#define XSPI_CR_TOIE_Msk   (0x1UL << XSPI_CR_TOIE_Pos)    /*!< 0x00100000 */
#define XSPI_CR_TOIE       XSPI_CR_TOIE_Msk               /*!< TOIE (Timeout interrupt enable) */
#define XSPI_CR_CSSEL_Pos  (24UL)
#define XSPI_CR_CSSEL_Msk  (0x1UL << XSPI_CR_CSSEL_Pos)   /*!< 0x01000000 */
#define XSPI_CR_CSSEL      XSPI_CR_CSSEL_Msk              /*!< Chip Select Selection */
#define XSPI_CR_NOPREF_Pos (25UL)
#define XSPI_CR_NOPREF_Msk (0x1UL << XSPI_CR_NOPREF_Pos)  /*!< 0x02000000 */
#define XSPI_CR_NOPREF     XSPI_CR_NOPREF_Msk             /*!< No Prefetch Data */
#define XSPI_CR_FMODE_Pos  (28UL)
#define XSPI_CR_FMODE_Msk  (0x3UL << XSPI_CR_FMODE_Pos)   /*!< 0x30000000 */
#define XSPI_CR_FMODE      XSPI_CR_FMODE_Msk              /*!< FMODE[1:0] bits (Functional mode) */
#define XSPI_CR_FMODE_0    (0x1UL << XSPI_CR_FMODE_Pos)   /*!< 0x10000000 */
#define XSPI_CR_FMODE_1    (0x2UL << XSPI_CR_FMODE_Pos)   /*!< 0x20000000 */
#define XSPI_CR_MSEL_Pos   (30UL)
#define XSPI_CR_MSEL_Msk   (0x1UL << XSPI_CR_MSEL_Pos)    /*!< 0x40000000 */
#define XSPI_CR_MSEL       XSPI_CR_MSEL_Msk               /*!< Flash Select */

/********************  Bit definition for XSPI_DCR1 register  ********************/
#define XSPI_DCR1_CKMODE_Pos  (0UL)
#define XSPI_DCR1_CKMODE_Msk  (0x1UL << XSPI_DCR1_CKMODE_Pos)   /*!< 0x00000001 */
#define XSPI_DCR1_CKMODE      XSPI_DCR1_CKMODE_Msk              /*!< CKMODE (Clock mode 0/mode 3) */
#define XSPI_DCR1_FRCK_Pos    (1UL)
#define XSPI_DCR1_FRCK_Msk    (0x1UL << XSPI_DCR1_FRCK_Pos)     /*!< 0x00000002 */
#define XSPI_DCR1_FRCK        XSPI_DCR1_FRCK_Msk                /*!< FRCK (Free running clock) */
#define XSPI_DCR1_DLYBYP_Pos  (3UL)
#define XSPI_DCR1_DLYBYP_Msk  (0x1UL << XSPI_DCR1_DLYBYP_Pos)   /*!< 0x00000008 */
#define XSPI_DCR1_DLYBYP      XSPI_DCR1_DLYBYP_Msk              /*!< DLYBYP (Delay block bypass) */
#define XSPI_DCR1_CSHT_Pos    (8UL)
#define XSPI_DCR1_CSHT_Msk    (0x3FUL << XSPI_DCR1_CSHT_Pos)    /*!< 0x00003F00 */
#define XSPI_DCR1_CSHT        XSPI_DCR1_CSHT_Msk                /*!< CSHT[5:0] bits (Chip-select high time) */
#define XSPI_DCR1_DEVSIZE_Pos (16UL)
#define XSPI_DCR1_DEVSIZE_Msk (0x1FUL << XSPI_DCR1_DEVSIZE_Pos) /*!< 0x001F0000 */
#define XSPI_DCR1_DEVSIZE     XSPI_DCR1_DEVSIZE_Msk             /*!< DEVSIZE[4:0] bits (Device size) */
#define XSPI_DCR1_MTYP_Pos    (24UL)
#define XSPI_DCR1_MTYP_Msk    (0x7UL << XSPI_DCR1_MTYP_Pos)     /*!< 0x07000000 */
#define XSPI_DCR1_MTYP        XSPI_DCR1_MTYP_Msk                /*!< MTYP[2:0] bits (Memory type) */
#define XSPI_DCR1_MTYP_0      (0x1UL << XSPI_DCR1_MTYP_Pos)     /*!< 0x01000000 */
#define XSPI_DCR1_MTYP_1      (0x2UL << XSPI_DCR1_MTYP_Pos)     /*!< 0x02000000 */
#define XSPI_DCR1_MTYP_2      (0x4UL << XSPI_DCR1_MTYP_Pos)     /*!< 0x04000000 */

/********************  Bit definition for XSPI_DCR2 register  ********************/
#define XSPI_DCR2_PRESCALER_Pos (0UL)
#define XSPI_DCR2_PRESCALER_Msk (0xFFUL << XSPI_DCR2_PRESCALER_Pos)  /*!< 0x000000FF */
#define XSPI_DCR2_PRESCALER     XSPI_DCR2_PRESCALER_Msk              /*!< PRESCALER[7:0] bits (Clock prescaler) */

/********************  Bit definition for XSPI_SR register  ********************/
#define XSPI_SR_TEF_Pos    (0UL)
#define XSPI_SR_TEF_Msk    (0x1UL << XSPI_SR_TEF_Pos)     /*!< 0x00000001 */
#define XSPI_SR_TEF        XSPI_SR_TEF_Msk                /*!< TEF (Transfer error flag) */
#define XSPI_SR_TCF_Pos    (1UL)
#define XSPI_SR_TCF_Msk    (0x1UL << XSPI_SR_TCF_Pos)     /*!< 0x00000002 */
#define XSPI_SR_TCF        XSPI_SR_TCF_Msk                /*!< TCF (Transfer complete flag) */
#define XSPI_SR_FTF_Pos    (2UL)
#define XSPI_SR_FTF_Msk    (0x1UL << XSPI_SR_FTF_Pos)     /*!< 0x00000004 */
#define XSPI_SR_FTF        XSPI_SR_FTF_Msk                /*!< FTF (FIFO threshold flag) */
#define XSPI_SR_TOF_Pos    (4UL)
#define XSPI_SR_TOF_Msk    (0x1UL << XSPI_SR_TOF_Pos)     /*!< 0x00000010 */
#define XSPI_SR_TOF        XSPI_SR_TOF_Msk                /*!< TOF (Timeout flag) */
#define XSPI_SR_BUSY_Pos   (5UL)
#define XSPI_SR_BUSY_Msk   (0x1UL << XSPI_SR_BUSY_Pos)    /*!< 0x00000020 */
#define XSPI_SR_BUSY       XSPI_SR_BUSY_Msk               /*!< BUSY (Busy) */
#define XSPI_SR_FLEVEL_Pos (8UL)
#define XSPI_SR_FLEVEL_Msk (0x3FUL << XSPI_SR_FLEVEL_Pos) /*!< 0x00003F00 */
#define XSPI_SR_FLEVEL     XSPI_SR_FLEVEL_Msk             /*!< FLEVEL[5:0] bits (FIFO level) */

