STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/****** TIM Instances : Master mode available (TIMx_CR2.MMS available )********/
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define IS_TIM_MASTER_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S)  || \
                                            ((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S)  || \
                                            ((INSTANCE) == TIM3_NS)  || ((INSTANCE) == TIM3_S)  || \
                                            ((INSTANCE) == TIM4_NS)  || ((INSTANCE) == TIM4_S))
#elif defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define IS_TIM_MASTER_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S))
#else
#define IS_TIM_MASTER_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S)  || \
                                            ((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S)  || \
                                            ((INSTANCE) == TIM3_NS)  || ((INSTANCE) == TIM3_S))
#endif

/*********** TIM Instances : Slave mode available (TIMx_SMCR available )*******/
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define IS_TIM_SLAVE_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S)  || \
                                            ((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S)  || \
                                            ((INSTANCE) == TIM3_NS)  || ((INSTANCE) == TIM3_S)  || \
                                            ((INSTANCE) == TIM4_NS)  || ((INSTANCE) == TIM4_S))
#elif defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define IS_TIM_SLAVE_INSTANCE(INSTANCE)    (((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S))
#else
#define IS_TIM_SLAVE_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S)  || \
                                            ((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S)  || \
                                            ((INSTANCE) == TIM3_NS)  || ((INSTANCE) == TIM3_S))
#endif

/****************** TIM Instances : supporting OCxREF clear *******************/
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define IS_TIM_OCXREF_CLEAR_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S)  || \
                                                 ((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S)  || \
                                                 ((INSTANCE) == TIM3_NS)  || ((INSTANCE) == TIM3_S)  || \
                                                 ((INSTANCE) == TIM4_NS)  || ((INSTANCE) == TIM4_S)  || \
                                                 ((INSTANCE) == TIM16_NS) || ((INSTANCE) == TIM16_S) || \
                                                 ((INSTANCE) == TIM17_NS) || ((INSTANCE) == TIM17_S))
#elif defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define IS_TIM_OCXREF_CLEAR_INSTANCE(INSTANCE)  (((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S)  || \
                                                 ((INSTANCE) == TIM16_NS) || ((INSTANCE) == TIM16_S) || \
                                                 ((INSTANCE) == TIM17_NS) || ((INSTANCE) == TIM17_S))
#else
#define IS_TIM_OCXREF_CLEAR_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S)  || \
                                                 ((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S)  || \
                                                 ((INSTANCE) == TIM3_NS)  || ((INSTANCE) == TIM3_S)  || \
                                                 ((INSTANCE) == TIM16_NS) || ((INSTANCE) == TIM16_S) || \
                                                 ((INSTANCE) == TIM17_NS) || ((INSTANCE) == TIM17_S))
#endif

/****************** TIM Instances : supporting bitfield OCCS in SMCR register *******************/
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define IS_TIM_OCCS_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S)  || \
                                         ((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S)  || \
                                         ((INSTANCE) == TIM3_NS)  || ((INSTANCE) == TIM3_S)  || \
                                         ((INSTANCE) == TIM4_NS)  || ((INSTANCE) == TIM4_S))
#elif defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define IS_TIM_OCCS_INSTANCE(INSTANCE)  (((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S))
#else
#define IS_TIM_OCCS_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S)  || \
                                         ((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S)  || \
                                         ((INSTANCE) == TIM3_NS)  || ((INSTANCE) == TIM3_S))
#endif

/****************** TIM Instances : remapping capability **********************/
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define IS_TIM_REMAP_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S)  || \
                                            ((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S)  || \
                                            ((INSTANCE) == TIM3_NS)  || ((INSTANCE) == TIM3_S)  || \
                                            ((INSTANCE) == TIM4_NS)  || ((INSTANCE) == TIM4_S))
#elif defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define IS_TIM_REMAP_INSTANCE(INSTANCE)    (((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S))
#else
#define IS_TIM_REMAP_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S)  || \
                                            ((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S)  || \
                                            ((INSTANCE) == TIM3_NS)  || ((INSTANCE) == TIM3_S))
#endif

/****************** TIM Instances : supporting repetition counter *************/
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define IS_TIM_REPETITION_COUNTER_INSTANCE(INSTANCE)  (((INSTANCE) == TIM16_NS) || ((INSTANCE) == TIM16_S) || \
                                                       ((INSTANCE) == TIM17_NS) || ((INSTANCE) == TIM17_S))
#else /* defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define IS_TIM_REPETITION_COUNTER_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S)  || \
                                                       ((INSTANCE) == TIM16_NS) || ((INSTANCE) == TIM16_S) || \
                                                       ((INSTANCE) == TIM17_NS) || ((INSTANCE) == TIM17_S))
#endif /* defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */

/****************** TIM Instances : supporting ADC triggering through TRGO2 ***/
#if !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define IS_TIM_TRGO2_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S))
#else /* !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define IS_TIM_TRGO2_INSTANCE(INSTANCE)    (0)
#endif /* !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */

/******************* TIM Instances : Timer input XOR function *****************/
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define IS_TIM_XOR_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S)  || \
                                            ((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S)  || \
                                            ((INSTANCE) == TIM3_NS)  || ((INSTANCE) == TIM3_S)  || \
                                            ((INSTANCE) == TIM4_NS)  || ((INSTANCE) == TIM4_S))
#elif defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define IS_TIM_XOR_INSTANCE(INSTANCE)      (((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S))
#else
#define IS_TIM_XOR_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S)  || \
                                            ((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S)  || \
                                            ((INSTANCE) == TIM3_NS)  || ((INSTANCE) == TIM3_S))
#endif

