STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/****************** TIM Instances : supporting 32 bits counter ****************/
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define IS_TIM_32B_COUNTER_INSTANCE(INSTANCE) (((INSTANCE) == TIM2_NS) || \
                                               ((INSTANCE) == TIM4_NS))
#else
#define IS_TIM_32B_COUNTER_INSTANCE(INSTANCE) ((INSTANCE) == TIM2_NS)
#endif

/****************** TIM Instances : supporting the break function *************/
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define IS_TIM_BREAK_INSTANCE(INSTANCE)    (((INSTANCE) == TIM16_NS) || \
                                            ((INSTANCE) == TIM17_NS))
#else /*  defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define IS_TIM_BREAK_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_NS)  || \
                                            ((INSTANCE) == TIM16_NS) || \
                                            ((INSTANCE) == TIM17_NS))
#endif /* defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */

/************** TIM Instances : supporting Break source selection *************/
#if defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define IS_TIM_BREAKSOURCE_INSTANCE(INSTANCE) (((INSTANCE) == TIM16_NS) || \
                                               ((INSTANCE) == TIM17_NS))
#else /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */
#define IS_TIM_BREAKSOURCE_INSTANCE(INSTANCE) (((INSTANCE) == TIM1_NS)  || \
                                               ((INSTANCE) == TIM16_NS) || \
                                               ((INSTANCE) == TIM17_NS))
#endif /* defined (STM32WBA20xx) || defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx) */

/****************** TIM Instances : supporting 2 break inputs *****************/
#if !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define IS_TIM_BKIN2_INSTANCE(INSTANCE)    ((INSTANCE) == TIM1_NS)
#else /* !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define IS_TIM_BKIN2_INSTANCE(INSTANCE)    (0)
#endif /* !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */

/************* TIM Instances : at least 1 capture/compare channel *************/
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define IS_TIM_CC1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_NS)  || \
                                         ((INSTANCE) == TIM4_NS)  || \
                                         ((INSTANCE) == TIM16_NS) || \
                                         ((INSTANCE) == TIM17_NS))
#elif defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define IS_TIM_CC1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM16_NS) || \
                                         ((INSTANCE) == TIM17_NS))
#else
#define IS_TIM_CC1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_NS)  || \
                                         ((INSTANCE) == TIM16_NS) || \
                                         ((INSTANCE) == TIM17_NS))
#endif

/************ TIM Instances : at least 2 capture/compare channels *************/
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define IS_TIM_CC2_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_NS)  || \
                                         ((INSTANCE) == TIM4_NS))
#elif defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define IS_TIM_CC2_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_CC2_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_NS))
#endif

/************ TIM Instances : at least 3 capture/compare channels *************/
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define IS_TIM_CC3_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_NS)  || \
                                         ((INSTANCE) == TIM4_NS))
#elif defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define IS_TIM_CC3_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_CC3_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_NS))
#endif

/************ TIM Instances : at least 4 capture/compare channels *************/
#if defined (STM32WBA62xx) || defined (STM32WBA64xx) || defined (STM32WBA65xx) || defined (STM32WBA6Mxx)
#define IS_TIM_CC4_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_NS)  || \
                                         ((INSTANCE) == TIM4_NS))
#elif defined (STM32WBA23xx) || defined (STM32WBA24xx) || defined (STM32WBA25xx)
#define IS_TIM_CC4_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_CC4_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_NS)  || \
                                         ((INSTANCE) == TIM3_NS))
#endif

/****************** TIM Instances : at least 5 capture/compare channels *******/
#if !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define IS_TIM_CC5_INSTANCE(INSTANCE)   ((INSTANCE) == TIM1_NS)
#else /* !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define IS_TIM_CC5_INSTANCE(INSTANCE)   (0)
#endif /* !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */

/****************** TIM Instances : at least 6 capture/compare channels *******/
#if !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx)
#define IS_TIM_CC6_INSTANCE(INSTANCE)   ((INSTANCE) == TIM1_NS)
#else /* !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */
#define IS_TIM_CC6_INSTANCE(INSTANCE)   (0)
#endif /* !defined (STM32WBA23xx) && !defined (STM32WBA24xx) && !defined (STM32WBA25xx) */

