STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
#define IS_I2C_GRP2_INSTANCE(INSTANCE) ((INSTANCE) == I2C3_NS)

/****************** I2C Instances : wakeup capability from stop modes *********/
#define IS_I2C_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) IS_I2C_ALL_INSTANCE(INSTANCE)

#if $WBA_CRYPTO$
/******************************* AES Instances ********************************/
#define IS_PKA_ALL_INSTANCE(INSTANCE) ((INSTANCE) == PKA_NS)

#endif /* WBA_CRYPTO */
/******************************* RNG Instances ********************************/
#define IS_RNG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == RNG_NS)

/****************************** RTC Instances *********************************/
#define IS_RTC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == RTC_NS)

/****************************** SMBUS Instances *******************************/
#define IS_SMBUS_ALL_INSTANCE(INSTANCE) ((INSTANCE) == I2C3_NS)

/******************* SMBUS Instances : Group belongingness *********************/
#define IS_SMBUS_GRP1_INSTANCE(INSTANCE) (0)

#define IS_SMBUS_GRP2_INSTANCE(INSTANCE) ((INSTANCE) == I2C3_NS)

/******************************** SPI Instances *******************************/
#define IS_SPI_ALL_INSTANCE(INSTANCE) ((INSTANCE) == SPI3_NS)

#define IS_SPI_LIMITED_INSTANCE(INSTANCE) ((INSTANCE) == SPI3_NS)

#define IS_SPI_FULL_INSTANCE(INSTANCE) (0)

/******************* SPI Instances : Group belongingness *********************/
#define IS_SPI_GRP1_INSTANCE(INSTANCE) (0)

#define IS_SPI_GRP2_INSTANCE(INSTANCE) ((INSTANCE) == SPI3_NS)

/******************************** LPTIM Instances *******************************/
#define IS_LPTIM_INSTANCE(INSTANCE)     ((INSTANCE) == LPTIM1_NS)

/****************** LPTIM Instances : DMA supported instances *****************/
#define IS_LPTIM_DMA_INSTANCE(INSTANCE)  ((INSTANCE) == LPTIM1_NS)

/************* LPTIM Instances : at least 1 capture/compare channel ***********/
#define IS_LPTIM_CC1_INSTANCE(INSTANCE) ((INSTANCE) == LPTIM1_NS)

/************* LPTIM Instances : at least 2 capture/compare channel ***********/
#define IS_LPTIM_CC2_INSTANCE(INSTANCE) ((INSTANCE) == LPTIM1_NS)

/****************** LPTIM Instances : supporting encoder interface **************/
#define IS_LPTIM_ENCODER_INTERFACE_INSTANCE(INSTANCE)  ((INSTANCE) == LPTIM1_NS)

/****************** LPTIM Instances : supporting Input Capture **************/
#define IS_LPTIM_INPUT_CAPTURE_INSTANCE(INSTANCE)  ((INSTANCE) == LPTIM1_NS)

/****************** TIM Instances : All supported instances *******************/
#if defined (STM32WBA20xx)
#define IS_TIM_INSTANCE(INSTANCE)       (((INSTANCE) == TIM2_NS)   || \
                                         ((INSTANCE) == TIM16_NS))
#else
#define IS_TIM_INSTANCE(INSTANCE)       (((INSTANCE) == TIM1_NS)   || \
                                         ((INSTANCE) == TIM2_NS)   || \
                                         ((INSTANCE) == TIM16_NS))
#endif

/****************** TIM Instances : supporting 32 bits counter ****************/
#define IS_TIM_32B_COUNTER_INSTANCE(INSTANCE) ((INSTANCE) == TIM2_NS)

/****************** TIM Instances : supporting the break function *************/
#if defined (STM32WBA20xx)
#define IS_TIM_BREAK_INSTANCE(INSTANCE)    (((INSTANCE) == TIM16_NS))
#else
#define IS_TIM_BREAK_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_NS)   || \
                                            ((INSTANCE) == TIM16_NS))
#endif

/************** TIM Instances : supporting Break source selection *************/
#if defined (STM32WBA20xx)
#define IS_TIM_BREAKSOURCE_INSTANCE(INSTANCE) (((INSTANCE) == TIM16_NS))
#else
#define IS_TIM_BREAKSOURCE_INSTANCE(INSTANCE) (((INSTANCE) == TIM1_NS)  || \
                                               ((INSTANCE) == TIM16_NS))
#endif

/****************** TIM Instances : supporting 2 break inputs *****************/
#if !defined (STM32WBA20xx)
#define IS_TIM_BKIN2_INSTANCE(INSTANCE)    ((INSTANCE) == TIM1_NS)
#else
#define IS_TIM_BKIN2_INSTANCE(INSTANCE)    (0)
#endif

/************* TIM Instances : at least 1 capture/compare channel *************/
#if defined (STM32WBA20xx)
#define IS_TIM_CC1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2_NS) || \
                                         ((INSTANCE) == TIM16_NS))
#else
#define IS_TIM_CC1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS) || \
                                         ((INSTANCE) == TIM2_NS) || \
                                         ((INSTANCE) == TIM16_NS))
#endif

/************ TIM Instances : at least 2 capture/compare channels *************/
#if defined (STM32WBA20xx)
#define IS_TIM_CC2_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_CC2_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_NS))
#endif

/************ TIM Instances : at least 3 capture/compare channels *************/
#if defined (STM32WBA20xx)
#define IS_TIM_CC3_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_CC3_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_NS))
#endif

/************ TIM Instances : at least 4 capture/compare channels *************/
#if defined (STM32WBA20xx)
#define IS_TIM_CC4_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_CC4_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS)  || \
                                         ((INSTANCE) == TIM2_NS))
#endif

/****************** TIM Instances : at least 5 capture/compare channels *******/
#if !defined (STM32WBA20xx)
#define IS_TIM_CC5_INSTANCE(INSTANCE)   ((INSTANCE) == TIM1_NS)
#else
#define IS_TIM_CC5_INSTANCE(INSTANCE)   (0)
#endif

/****************** TIM Instances : at least 6 capture/compare channels *******/
#if !defined (STM32WBA20xx)
#define IS_TIM_CC6_INSTANCE(INSTANCE)   ((INSTANCE) == TIM1_NS)
#else
#define IS_TIM_CC6_INSTANCE(INSTANCE)   (0)
#endif

/************ TIM Instances : DMA requests generation (TIMx_DIER.COMDE) *******/
#if defined (STM32WBA20xx)
#define IS_TIM_CCDMA_INSTANCE(INSTANCE)    (((INSTANCE) == TIM16_NS))
#else
#define IS_TIM_CCDMA_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_NS)  || \
                                            ((INSTANCE) == TIM16_NS))
#endif

/****************** TIM Instances : DMA requests generation (TIMx_DIER.UDE) ***/
#if defined (STM32WBA20xx)
#define IS_TIM_DMA_INSTANCE(INSTANCE)      (((INSTANCE) == TIM2_NS) || \
                                            ((INSTANCE) == TIM16_NS))
#else
#define IS_TIM_DMA_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1_NS) || \
                                            ((INSTANCE) == TIM2_NS) || \
                                            ((INSTANCE) == TIM16_NS))
#endif

/************ TIM Instances : DMA requests generation (TIMx_DIER.CCxDE) *******/
#if defined (STM32WBA20xx)
#define IS_TIM_DMA_CC_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2_NS) || \
                                            ((INSTANCE) == TIM16_NS))
#else
#define IS_TIM_DMA_CC_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS) || \
                                            ((INSTANCE) == TIM2_NS) || \
                                            ((INSTANCE) == TIM16_NS))
#endif

/******************** TIM Instances : DMA burst feature ***********************/
#if defined (STM32WBA20xx)
#define IS_TIM_DMABURST_INSTANCE(INSTANCE) (((INSTANCE) == TIM2_NS) || \
                                            ((INSTANCE) == TIM16_NS))
#else
#define IS_TIM_DMABURST_INSTANCE(INSTANCE) (((INSTANCE) == TIM1_NS) || \
                                            ((INSTANCE) == TIM2_NS) || \
                                            ((INSTANCE) == TIM16_NS))
#endif

/******************* TIM Instances : output(s) available **********************/
#if defined (STM32WBA20xx)
#define IS_TIM_CCX_INSTANCE(INSTANCE, CHANNEL) \
    ((((INSTANCE) == TIM2_NS)  &&              \
     (((CHANNEL) == TIM_CHANNEL_1) ||          \
      ((CHANNEL) == TIM_CHANNEL_2) ||          \
      ((CHANNEL) == TIM_CHANNEL_3) ||          \
      ((CHANNEL) == TIM_CHANNEL_4)))           \
     ||                                        \
     (((INSTANCE) == TIM16_NS) &&              \
     (((CHANNEL) == TIM_CHANNEL_1))))
#else
#define IS_TIM_CCX_INSTANCE(INSTANCE, CHANNEL) \
    ((((INSTANCE) == TIM1_NS)  &&              \
     (((CHANNEL) == TIM_CHANNEL_1) ||          \
      ((CHANNEL) == TIM_CHANNEL_2) ||          \
      ((CHANNEL) == TIM_CHANNEL_3) ||          \
      ((CHANNEL) == TIM_CHANNEL_4) ||          \
      ((CHANNEL) == TIM_CHANNEL_5) ||          \
      ((CHANNEL) == TIM_CHANNEL_6)))           \
     ||                                        \
     (((INSTANCE) == TIM2_NS)  &&              \
     (((CHANNEL) == TIM_CHANNEL_1) ||          \
      ((CHANNEL) == TIM_CHANNEL_2) ||          \
      ((CHANNEL) == TIM_CHANNEL_3) ||          \
      ((CHANNEL) == TIM_CHANNEL_4)))           \
     ||                                        \
     (((INSTANCE) == TIM16_NS) &&              \
     (((CHANNEL) == TIM_CHANNEL_1))))
#endif

/****************** TIM Instances : supporting complementary output(s) ********/
#if defined (STM32WBA20xx)
#define IS_TIM_CCXN_INSTANCE(INSTANCE, CHANNEL) \
    ((((INSTANCE) == TIM16_NS)  &&               \
     ((CHANNEL) == TIM_CHANNEL_1)))
#else
#define IS_TIM_CCXN_INSTANCE(INSTANCE, CHANNEL) \
    ((((INSTANCE) == TIM1_NS)  &&               \
     (((CHANNEL) == TIM_CHANNEL_1) ||           \
      ((CHANNEL) == TIM_CHANNEL_2) ||           \
      ((CHANNEL) == TIM_CHANNEL_3) ||           \
      ((CHANNEL) == TIM_CHANNEL_4)))            \
    ||                                          \
    (((INSTANCE) == TIM16_NS)  &&               \
     ((CHANNEL) == TIM_CHANNEL_1)))
#endif

