STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wbaxxxxx.h
/****************** TIM Instances : supporting clock division *****************/
#if defined (STM32WBA20xx)
#define IS_TIM_CLOCK_DIVISION_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2_NS) || \
                                                    ((INSTANCE) == TIM16_NS))
#else
#define IS_TIM_CLOCK_DIVISION_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS) || \
                                                    ((INSTANCE) == TIM2_NS) || \
                                                    ((INSTANCE) == TIM16_NS))
#endif

/****** TIM Instances : supporting external clock mode 1 for ETRF input *******/
#if defined (STM32WBA20xx)
#define IS_TIM_CLOCKSOURCE_ETRMODE1_INSTANCE(INSTANCE) (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_CLOCKSOURCE_ETRMODE1_INSTANCE(INSTANCE) (((INSTANCE) == TIM1_NS) || \
                                                        ((INSTANCE) == TIM2_NS))
#endif

/****** TIM Instances : supporting external clock mode 2 for ETRF input *******/
#if defined (STM32WBA20xx)
#define IS_TIM_CLOCKSOURCE_ETRMODE2_INSTANCE(INSTANCE) (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_CLOCKSOURCE_ETRMODE2_INSTANCE(INSTANCE) (((INSTANCE) == TIM1_NS) || \
                                                        ((INSTANCE) == TIM2_NS))
#endif

/****************** TIM Instances : supporting external clock mode 1 for TIX inputs*/
#if defined (STM32WBA20xx)
#define IS_TIM_CLOCKSOURCE_TIX_INSTANCE(INSTANCE)      (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_CLOCKSOURCE_TIX_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1_NS) || \
                                                        ((INSTANCE) == TIM2_NS))
#endif

/****************** TIM Instances : supporting internal trigger inputs(ITRX) *******/
#if defined (STM32WBA20xx)
#define IS_TIM_CLOCKSOURCE_ITRX_INSTANCE(INSTANCE)    (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_CLOCKSOURCE_ITRX_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_NS) || \
                                                       ((INSTANCE) == TIM2_NS))
#endif

/****************** TIM Instances : supporting combined 3-phase PWM mode ******/
#if !defined (STM32WBA20xx)
#define IS_TIM_COMBINED3PHASEPWM_INSTANCE(INSTANCE)   ((INSTANCE) == TIM1_NS)
#else
#define IS_TIM_COMBINED3PHASEPWM_INSTANCE(INSTANCE)   (0)
#endif

/****************** TIM Instances : supporting commutation event generation ***/
#if defined (STM32WBA20xx)
#define IS_TIM_COMMUTATION_EVENT_INSTANCE(INSTANCE) (((INSTANCE) == TIM16_NS))
#else
#define IS_TIM_COMMUTATION_EVENT_INSTANCE(INSTANCE) (((INSTANCE) == TIM1_NS) || \
                                                     ((INSTANCE) == TIM16_NS))
#endif

/****************** TIM Instances : supporting counting mode selection ********/
#if defined (STM32WBA20xx)
#define IS_TIM_COUNTER_MODE_SELECT_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_COUNTER_MODE_SELECT_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS) || \
                                                         ((INSTANCE) == TIM2_NS))
#endif

/****************** TIM Instances : supporting encoder interface **************/
#if defined (STM32WBA20xx)
#define IS_TIM_ENCODER_INTERFACE_INSTANCE(INSTANCE)  (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_ENCODER_INTERFACE_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1_NS) || \
                                                      ((INSTANCE) == TIM2_NS))
#endif

/****************** TIM Instances : supporting Hall sensor interface **********/
#if defined (STM32WBA20xx)
#define IS_TIM_HALL_SENSOR_INTERFACE_INSTANCE(INSTANCE)  (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_HALL_SENSOR_INTERFACE_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1_NS) || \
                                                          ((INSTANCE) == TIM2_NS))
#endif

/**************** TIM Instances : external trigger input available ************/
#if defined (STM32WBA20xx)
#define IS_TIM_ETR_INSTANCE(INSTANCE)    (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_ETR_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_NS) || \
                                          ((INSTANCE) == TIM2_NS))
#endif

/************* TIM Instances : supporting ETR source selection ***************/
#if defined (STM32WBA20xx)
#define IS_TIM_ETRSEL_INSTANCE(INSTANCE)    (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_ETRSEL_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_NS) || \
                                             ((INSTANCE) == TIM2_NS))
#endif

/****** TIM Instances : Master mode available (TIMx_CR2.MMS available )********/
#if defined (STM32WBA20xx)
#define IS_TIM_MASTER_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_MASTER_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS) || \
                                           ((INSTANCE) == TIM2_NS))
#endif

/*********** TIM Instances : Slave mode available (TIMx_SMCR available )*******/
#if defined (STM32WBA20xx)
#define IS_TIM_SLAVE_INSTANCE(INSTANCE)   (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_SLAVE_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_NS) || \
                                           ((INSTANCE) == TIM2_NS))
#endif

/****************** TIM Instances : supporting OCxREF clear *******************/
#if defined (STM32WBA20xx)
#define IS_TIM_OCXREF_CLEAR_INSTANCE(INSTANCE)  (((INSTANCE) == TIM2_NS)  || \
                                                 ((INSTANCE) == TIM16_NS))
#else
#define IS_TIM_OCXREF_CLEAR_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1_NS)  || \
                                                 ((INSTANCE) == TIM2_NS)  || \
                                                 ((INSTANCE) == TIM16_NS))
#endif

/********* TIM Instances : supporting bitfield OCCS in SMCR register **********/
#if defined (STM32WBA20xx)
#define IS_TIM_OCCS_INSTANCE(INSTANCE)       (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_OCCS_INSTANCE(INSTANCE)       (((INSTANCE) == TIM1_NS)  || \
                                              ((INSTANCE) == TIM2_NS))
#endif

/****************** TIM Instances : remapping capability **********************/
#if defined (STM32WBA20xx)
#define IS_TIM_REMAP_INSTANCE(INSTANCE)    (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_REMAP_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_NS)  || \
                                            ((INSTANCE) == TIM2_NS))
#endif

/****************** TIM Instances : supporting repetition counter *************/
#if defined (STM32WBA20xx)
#define IS_TIM_REPETITION_COUNTER_INSTANCE(INSTANCE)  (((INSTANCE) == TIM16_NS))
#else
#define IS_TIM_REPETITION_COUNTER_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1_NS)  || \
                                                       ((INSTANCE) == TIM16_NS))
#endif

/****************** TIM Instances : supporting ADC triggering through TRGO2 ***/
#if !defined (STM32WBA20xx)
#define IS_TIM_TRGO2_INSTANCE(INSTANCE)    ((INSTANCE) == TIM1_NS)
#else
#define IS_TIM_TRGO2_INSTANCE(INSTANCE)    (0)
#endif

/******************* TIM Instances : Timer input XOR function *****************/
#if defined (STM32WBA20xx)
#define IS_TIM_XOR_INSTANCE(INSTANCE)      (((INSTANCE) == TIM2_NS))
#else
#define IS_TIM_XOR_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1_NS) || \
                                            ((INSTANCE) == TIM2_NS))
#endif

